[{"search": 0, "content": "r/politics being... Well, r/politics ", "relevance": 0}, {"search": 0, "content": "What non-political opinion gives away someone's politics? ", "relevance": 0}, {"search": 0, "content": "r/politics is f****** trash  \n\nI swear to god that sub is so toxic. They claim to be 'non-biased' and 'on the fence', While being the most biased people ever. Most popular posts consist of a misleading title, a dumb article, and the most biohazardous comment section ever. People on Reddit literally cannot hold a civil debate without screeching at each other. I also seemed to notice that they love downvoting other opinions to oblivion and even censoring them. It's the most 'orange man bad' sub I've ever seen. It's literally worse than actually dedicated subs. I know this will be downvoted to hell, but it's my opinion, so please respect it. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm sorry if the formatting is off, English isn't my first language.\n\nUpdate: holy shit my inbox’s Asshole is ripped. I just wanted to say that I’m not trying to take sides here. Both parties are guilty of being toxic. Also, I’m not even a trumpie. I should have written this better so it’s not misleading.", "relevance": 0}, {"search": 0, "content": "Politics in pods I am only on ep 3 but I had to chuckle to myself when Jeramey asked Sarah Ann where she stood on politics. After last season with JP, the topic of couples discussing politics came up a lot in this sub, and it was noted how it’s never actually shown on the episodes, but of course, we could assume those things were discussed before marriage. I just thought it was funny it was shown this season. We see you lurking, LIB producers 👀 👋🏼", "relevance": 0}, {"search": 0, "content": "CMV: R/Politics Should Be Renamed  The default political sub, [r/politics](https://www.reddit.com/r/politics/), should be renamed to something to demonstrate the political bias of the sub. It is not a sub for politics, it is a sub for one side of politics. There is not legitimate political discourse because the subreddit is significantly biased, as are the moderators, and they moderate based on said bias. I have no problem with political subs existing with a specific bias. I just take issue that the sub advertised as the subreddit of default politics does not allow discussion of broad politics-only discussion of broad politics from one side.", "relevance": 0}, {"search": 0, "content": "How do honest people navigate office politics? After 2.5 years of this crap, I'm finally on the verge of being fired/laid off or whatever the next step is before that. I can tell it from how my manager has been treating me the past few months or so (I have not had any 1-on-1's with him for several months now AND hes been excluding me from trainings that all other team members who've been with the company under 2 years are being explicitly mentioned to be invited to). The team leader directly leading me on my immediate team hardly assigns me work anymore and minimizes his interactions with me specifically just to receive updates. Outside of my team, other coworkers don't really interact with me. I'm not really invited to meetings outside of team meetings. With the other engineers who are in the same YOE as I am, they're typically very passive aggressive towards me, saying stuff like \"wow, see &lt;other coworker's name&gt;, I told you that &lt;my name&gt; was doing important work. Wow, very cool!\" and the other coworker would interject with another snide comment and they're using a sarcastic tone of voice. I can recall MANY instances in our internal team meetings where my manager or another manager or even my team lead is saying \"hey, lets not be open about certain details/issues when we have our meetings with other people from departments\". And I'm someone who sort of let it slide.\n\nWhen I recall the internship I did before this job, it was even more toxic. Coworkers who weren't afraid to show me that they hated me, would immediately act nice and helpful when management was around and observing. I could recall that I was used for other people's benefit, whether that was my former manager trying to manipulate one of my coworkers or a coworker trying to look like he was being helpful to me when he offered his contact information during my exit out of my internship. Theres so many toxic people in the professional world.\n\nI hate not being honest especially around the issues at work. Its really tiring. When I reflect on how my dad, who is a retired mechanic, transitioned from working under other people in their auto shops to renting out his own autoshop and working as an independent mechanic, it kind of makes sense. My dad is a really honest guy who genuinely likes helping other people. But, the fucking work industry is full of snakes who bully/sabotage other people to get ahead. Really, theres no place for people like me here. I am at my most peaceful when I'm alone.", "relevance": 0}, {"search": 0, "content": "What is the best/biggest office politics lesson you have learned in life? I learnt to always get things in writing to be on the safer side, and never trust your line manager with your issues as they might use them against you.", "relevance": 0}, {"search": 0, "content": "What is/what are some examples of office politics/drama? I never understood this.  I have always never intimated any drama/negative talk about employees at work and played neutral at jobs/was positive to everyone.  \nI would like to hear about some real life stories and examples that seem minor, but happen frequently.  I feel naive to this world at 28f having never really experiencing it and have had many different jobs.", "relevance": 0}, {"search": 0, "content": "“Politics” ", "relevance": 0}, {"search": 0, "content": "Helldivers getting political ", "relevance": 0}, {"search": 0, "content": "Political trolley ", "relevance": 0}, {"search": 0, "content": "Was told not to put my political beliefs on my resume. Is this political? I  just failed a job interview yesterday. The guy seemed a bit hostile and basically took all my responses in the worst light. I've seen that before. He already picked who he wanted but was obligated to finish the rest of the interviews. Fine, whatever, I've dealt with that before.\n\nBut what gets me is that going over my resume, he gets to the point where I say that I am fully vaccinated against covid-19.  This is for a retail position so I feel it's relevant.  But he gets there and tells me 'Here's a tip, don't announce your political leanings on your resume. No-one with any sense will hire you if you announce it.' (Paraphrasing I don't recall the exact wording)\n\nAgain it's a retail job, it seems to me like very relevant information.  But just in case should I remove that from my resume?\n\nEDIT: Thanks for all the answers y'all. I have removed the detail from my resume as the majority reccomends, and I'm glad many understand why I had it on there in the first place.  Got another interview at another place nearby shortly after I posted this and that interview went much better.  Closer place too, still waiting on background check but they basically hired me on the spot.\n\nThanks for the advice everyone!", "relevance": 0}, {"search": 0, "content": "Flags not politics ", "relevance": 0}, {"search": 0, "content": "Politics Guy 🪱 ", "relevance": 0}, {"search": 0, "content": "Plantation politics ", "relevance": 0}, {"search": 0, "content": "Politics ", "relevance": 0}, {"search": 0, "content": "Political statement  ", "relevance": 0}, {"search": 0, "content": "Politics? I don't see any politics. Do you see any politics? ", "relevance": 0}, {"search": 0, "content": "Conservative Politics ", "relevance": 0}, {"search": 0, "content": "Polite catcalling ", "relevance": 0}, {"search": 0, "content": "anime political dub ", "relevance": 0}, {"search": 0, "content": "Brave Enough for Politics vs Ignorance of Political Definitions ", "relevance": 0}, {"search": 0, "content": "Something is wrong with American politics ", "relevance": 0}, {"search": 0, "content": "Something non political ", "relevance": 0}, {"search": 0, "content": "A Polite Douchebag? So I'm somewhat new to shopping, been doing it about 2 months now and this is the first bad interaction I've had, was just wondering if I was being condescending or rude in any capacity so I can talk to customers better.\n\nIm missing one screenshot of the conversation but I informed the customer they were out of this certain deli cut I'm unfamiliar with so I asked an associate and he reccomended these two items(first picture) as he said he can't get what the customer requested. This was at 11:38am so I could give the customer plenty of time to respond as they preferred text.\n\nThis is where in wondering if I was in the wrong, I go through the entire order and never hear back and usually when that happens I just continue on with my order and I did so. At 12:20pm when I was delivering the order she then responded(40min after my text) said the replacement was fine and to contact her. I informed her I already delivered the items and left the store about 15 minutes prior to her text.\n\nShe then immediately says she's pissed, asked for a number for management, and then called me polite and a douchebag at the same time after trying to inform her on prefer text/call.\n\nCould I have done anything different? I immediately contacted the support so I could keep the tip and dodge an incoming bad rating which did get removed.", "relevance": 0}, {"search": 0, "content": "“Politics before country” Problem with this is if you focus on politics too much you end up with no country", "relevance": 0}, {"search": 0, "content": "“Politics.” ", "relevance": 0}, {"search": 0, "content": "Punk is too political ", "relevance": 0}, {"search": 0, "content": "non political political meme ", "relevance": 0}, {"search": 0, "content": "DON CHEADLE POLITICAL?! ", "relevance": 0}, {"search": 0, "content": "Politely beaten ", "relevance": 0}, {"search": 0, "content": "Global politics are in good hands ", "relevance": 0}, {"search": 0, "content": "It's all politics ", "relevance": 0}, {"search": 0, "content": "American Politics are cool ", "relevance": 0}, {"search": 0, "content": "The American Politics Trolley Problem ", "relevance": 0}, {"search": 0, "content": "Gender politics ", "relevance": 0}, {"search": 0, "content": "US politics ", "relevance": 0}, {"search": 0, "content": "Punk Has Always Besn Political, SMH ", "relevance": 0}, {"search": 0, "content": "Elder Scrolls Politics &gt; Real Life Politics ", "relevance": 0}, {"search": 0, "content": "Political tattoos, definitely a good idea. ", "relevance": 0}, {"search": 0, "content": "Political Journey[OC] ", "relevance": 0}, {"search": 0, "content": "Neocon now uncomfortable with religion in politics. ", "relevance": 0}, {"search": 0, "content": "Political Discourse ", "relevance": 0}, {"search": 0, "content": "reasons why religion and politics need to be seperated ", "relevance": 0}, {"search": 0, "content": "to use political influence ", "relevance": 0}, {"search": 0, "content": "No politics on this sub ", "relevance": 0}, {"search": 0, "content": "Unsurprisingly, the whole border fiasco is cynical politics at play. ", "relevance": 0}, {"search": 0, "content": "political pizza ", "relevance": 0}, {"search": 0, "content": "video games are political now smh ", "relevance": 0}, {"search": 0, "content": "anime political dub ", "relevance": 0}, {"search": 0, "content": "Legally protected political satire! ", "relevance": 0}, {"search": 0, "content": "Politics shouldn't be team sports ", "relevance": 0}, {"search": 0, "content": "Fuck /r/politics, all my homies hate /r/politics ", "relevance": 0}, {"search": 0, "content": "cursed political statement ", "relevance": 0}, {"search": 0, "content": "political dub ", "relevance": 0}, {"search": 0, "content": "VIRGIN U.S politics 🤢🤢🤢 vs CHAD Indian politics 😎👍😎👌 ", "relevance": 0}, {"search": 0, "content": "anon figures out American politics ", "relevance": 0}, {"search": 0, "content": "Neil Gaiman on political correctness ", "relevance": 0}, {"search": 0, "content": "MAGA: Punk is political? ", "relevance": 0}, {"search": 0, "content": "Actually,politics is a good thing and politics i don't like is agenda😤 ", "relevance": 0}, {"search": 0, "content": "Politics of Unchilding https://www.tumblr.com/veetuku-ponum/742568085613051904?source=share", "relevance": 0}, {"search": 0, "content": "American political victory ", "relevance": 0}, {"search": 0, "content": "Political Compass Political Compass ", "relevance": 0}, {"search": 0, "content": "American Politics ", "relevance": 0}, {"search": 0, "content": "Politics Politics Politics Roggies is the man, but I haven't been able to listen to a full episode since covid. I've never posted or commented about it and I just thought it's not my cup of tea anymore and he can do what he wants, it's a free podcast after all and he never tells anyone to listen or promotes it which is fair. \n\nI just wanted to see if anyone shares my sentiment? I do sincerely think that he wasn't a political guy before and he was genuinely curious but as the cast got bigger, I think politics found him and he has since become quite bullish on his ideas. Since the Bernie episode + Covid + moving to Texas + money I think the gravity around him got too dense and I don't blame him. \n\nI do remember his point on politics before was 'It's a weird system anyway no one can be trusted, and no one person should be running the country it should be a team of people'. I always liked this take because I felt it was a genuine idea and he never tied himself to a side (being true to the comedian who just likes to talk about cool shit). and the point would last 2-5 minutes and then conversation would flow again.  After covid he started complaining of sides and then clearly picked one, I think he has unknowingly become what he is complaining about before. He preaches on episodes, Biden is worked into every episode, and he clearly gets off talking about cancel culture, I think he would be more upset if cancel culture went away because he wouldn't have anything to talk about (he literally just does the same thing but on the other side and repeats his points non-stop). \n\nIdk, I just wanted to see if I'm the only one because he is clearly still the number 1 podcast in the world and every episode is marked as 'most shared'. Obviously, people change (I've been listening since episode 300) so I don't mind growth, but the episodes have not been fun to listen too... Tell me why I'm wrong though I'd love your opinions. ", "relevance": 0}, {"search": 0, "content": "When politics = personality….. ", "relevance": 0}, {"search": 0, "content": "Getting political ", "relevance": 0}, {"search": 0, "content": "Russian Politics = U.S. Republican Politics in 2024 ", "relevance": 0}, {"search": 0, "content": "Very polite slaps ", "relevance": 0}, {"search": 0, "content": "Finnish political cartoon ", "relevance": 0}, {"search": 0, "content": "Friendship beats politics ", "relevance": 0}, {"search": 0, "content": "Far Political Leanings ", "relevance": 0}, {"search": 0, "content": "keep your modern politics away uj/ don't remake it but for a far sinister reason also quina my beloved", "relevance": 0}, {"search": 0, "content": "Politics. Politics never changes. ", "relevance": 0}, {"search": 0, "content": "to think American Idiot was not about politics. ", "relevance": 0}, {"search": 0, "content": "Science v Politics v Religion ", "relevance": 0}, {"search": 0, "content": "Rich mids with political power ", "relevance": 0}, {"search": 0, "content": "I don't care about politics. Me after drinking a cup: ", "relevance": 0}, {"search": 0, "content": "The English are polite, not nice ", "relevance": 0}, {"search": 0, "content": "Political ", "relevance": 0}, {"search": 0, "content": "Everything is political persecution ", "relevance": 0}, {"search": 0, "content": "The good old days of 2008 before politics was invented  ", "relevance": 0}, {"search": 0, "content": "US politics explained ", "relevance": 0}, {"search": 0, "content": "A rarity in politics ", "relevance": 0}, {"search": 0, "content": "Conservative Politics ", "relevance": 0}, {"search": 0, "content": "Demonic Politics. ", "relevance": 0}, {"search": 0, "content": "A recent political cartoon ", "relevance": 0}, {"search": 0, "content": "bit ooc for me to post america politics but ", "relevance": 0}, {"search": 0, "content": "Egypt political compass ", "relevance": 0}, {"search": 0, "content": "Politically-engaged Redditors tend to be more toxic -- even in non-political subreddits ", "relevance": 0}, {"search": 0, "content": "Put aside politics, Christ is risen! ", "relevance": 0}, {"search": 0, "content": "Colorado politics? ", "relevance": 0}, {"search": 0, "content": "Political compass on satire ", "relevance": 0}, {"search": 0, "content": "Politics rule ", "relevance": 0}, {"search": 0, "content": "Two genders: Male and political. Two races: White and political. Two sexual orientations: Straight and political. You get the idea. ", "relevance": 0}, {"search": 0, "content": "I'm not big into politics but why man ", "relevance": 0}, {"search": 0, "content": "Trans candidate for Transphobic Political Party surprised to find Political Party is Transphobic ", "relevance": 0}, {"search": 0, "content": "Western Europe Political Compass ", "relevance": 0}, {"search": 0, "content": "Too political? ", "relevance": 0}, {"search": 0, "content": "Gender politics is getting way out of hand. In California there is a bill that that would allow cps to take children away from their parents in the case of custody disputes if they do not affirm the child's gender. That bill is [abs-957](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB957)\n\nIn Texas there is a bill that defines allowing your children to receive gender affirming care as child abuse. The governor has directed cps to investigate parents who offer it. That bill is [sb-1646](https://capitol.texas.gov/tlodocs/87R/billtext/pdf/SB01646I.pdf#navpanes=0)\n\nThis is insanity and politicians from both sides should be ashamed at playing with people's families like this over their own politics. I personally think it's a horrible idea in most cases to transition children but in a small amount of cases it may be the right thing to do. Only the parents can adequately make this distinction.\n\nGender politics doesn't give you the right to break up families. It doesn't matter if you're right or left.", "relevance": 0}, {"search": 1, "content": "SolanaFloor becomes the top Solana News source online 14,000,000 🚀\n\nSolanaFloor hit 14 million social impressions in January making it the top Solana news source online. \n\nJust the beginning - more insights ahead. Big thanks to our Solana family🌟\n\nTwitter: https://x.com/solanafloor/status/1753494826476089849?s=46\n\nWebsite: https://solanafloor.com/", "relevance": 0}, {"search": 1, "content": "¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡SOLANA NEWS CRYPTOS¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ Do you know of any website where the projects that are going to be created in solana can be seen in real time?", "relevance": 0}, {"search": 1, "content": "Breaking news: Solana having a partnership with McDonalds ", "relevance": 0}, {"search": 1, "content": "Solana News: WEN JUP, Token Extensions, Solana Mobile Two, Magic Eden Rewards ", "relevance": 0}, {"search": 1, "content": "Solana News: $122 Million in Solana Projected to be Sold as Part of the Dump has been Staked ", "relevance": 0}, {"search": 1, "content": "Introducing Crypto Reddit on Solana ($CR) - Your Go-To Destination for Solana News and Memes!  \n\nHey Solana enthusiasts and crypto lovers!\n\nWe're thrilled to announce the launch of a brand-new community dedicated solely to the Solana ecosystem - **Crypto Reddit on Solana ($CR)**. As we navigate through the ever-evolving world of cryptocurrency, Solana has emerged as a powerhouse, and it's high time we had a space focused on celebrating and sharing everything Solana.\n\n**What Can You Expect?**\n\n* **Exclusive Solana Memes:** Laughter is key to enjoying the crypto journey, and what better way to share a laugh than through memes? Dive into a treasure trove of Solana-related memes that will keep you entertained and informed.\n* **Latest Solana News:** Stay up-to-date with the latest happenings in the Solana ecosystem. Whether it's project launches, updates, or critical discussions, you'll find it all here.\n* **A Vibrant Community:** Join fellow Solana supporters in discussing developments, sharing insights, and exploring the potential of Solana. Whether you're a seasoned investor or new to the scene, there's a place for you here.\n* **$CR Token:** Unique to our community, the $CR token represents more than just membership. It's an opportunity to be part of something bigger, offering benefits and rewards within our ecosystem.\n\n**Why Join Us?**\n\nCrypto Reddit on Solana ($CR) isn't just another crypto community. It's a space crafted with the passion for Solana at its core, designed to foster engagement, knowledge sharing, and a bit of fun along the way. Whether you're here for the memes, the news, or the discussions, you'll find a welcoming community ready to embark on this Solana journey together.\n\n**How to Get Involved?**\n\nJoining is easy! Just subscribe to our community, participate in the discussions, and don't forget to share your favorite Solana memes. We're also keen to hear your ideas on how to grow this community and make it your go-to Solana hub.\n\n&amp;#x200B;\n\nTG: [https://twitter.com/CRSolana](https://twitter.com/CRSolana)\n\n&amp;#x200B;\n\nLet's make Crypto Reddit on Solana ($CR) the ultimate destination for Solana enthusiasts. See you there!", "relevance": 0}, {"search": 1, "content": "Week in Solana News: February 4th - 10th, 2024 ", "relevance": 0}, {"search": 1, "content": "Huge News For Solana! ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 7-13, 2024 ", "relevance": 0}, {"search": 1, "content": "Solana News Rewind: The Biggest Moments in 2023 Explore the transformative year of SOL in our Solana news rewind, witnessing a renaissance marked by Bonk (BONK) mania, the rise of Solana DeFi 2.0, and more. \n\n[https://blockchainreporter.net/solana-news-rewind-the-biggest-moments-in-2023/](https://blockchainreporter.net/solana-news-rewind-the-biggest-moments-in-2023/)\n\nhttps://preview.redd.it/hw5zux47t79c1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=89707f95c5b9ca065111b50a2ce28e29009a03b0", "relevance": 0}, {"search": 1, "content": "SolanaNews.org - Weekly News from December 17 - 23, 2023 ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "Phantom featured in \"Week in Solana News\" ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 1 - 6, 2024 ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "All Solana News from the Week in One Video ", "relevance": 0}, {"search": 1, "content": "Today's Solana News * Bitcoin's Uptime and Solana's Outages: Analyzing Their Impact on Adoption\n   * [https://solanafloor.com/news/bitcoins-uptime-and-solanas-outages-analyzing-their-impact-on-adoption](https://solanafloor.com/news/bitcoins-uptime-and-solanas-outages-analyzing-their-impact-on-adoption)\n* Top Coins to Stake on Solana: Exploring the Best Options for High Yields\n   * [https://solanafloor.com/news/the-best-coins-to-stake-on-solana](https://solanafloor.com/news/the-best-coins-to-stake-on-solana)\n* ETH User Spends $120k For Gas on One Transaction: Not Possible on Solana\n   * [https://solanafloor.com/news/eth-user-spends-120k-on-gas](https://solanafloor.com/news/eth-user-spends-120k-on-gas)\n* Firedancer Unveils fd\\_quic: A High-Performance Implementation of QUIC and Solana Transaction Ingest Network Protocols\n   * [https://solanafloor.com/news/firedancer-unveils-fd\\_quic-a-high-performance-implementation-of-quic-and-solana-transaction-ingest-network-protocols](https://solanafloor.com/news/firedancer-unveils-fd_quic-a-high-performance-implementation-of-quic-and-solana-transaction-ingest-network-protocols)\n* Meme Coin Trading Volume Skyrockets, Reaching Two-Year High\n   * [https://solanafloor.com/news/meme-coin-trading-volume-skyrockets-reaching-two-year-high](https://solanafloor.com/news/meme-coin-trading-volume-skyrockets-reaching-two-year-high)\n* Bitcoin Active Addresses Plummet to Two-Year Low as Solana Outperforms\n   * [https://solanafloor.com/news/bitcoin-active-addresses-plummet-to-two-year-low-as-solana-outperforms](https://solanafloor.com/news/bitcoin-active-addresses-plummet-to-two-year-low-as-solana-outperforms)", "relevance": 0}, {"search": 1, "content": "Exciting Updates From Xen Crypto: Pulsechain Daytona Finance &amp; Solana News ", "relevance": 0}, {"search": 1, "content": "Lighthouse seeks to stop wallet drains on Solana #News #Technology #Tech #Grafa ", "relevance": 0}, {"search": 1, "content": "Today's Solana News * Helium Foundation Offers Grant Program for Proposals on Understanding Network Performance with Solana Migration\n   * [https://solanafloor.com/news/helium-foundation-offers-grant-program-for-proposals-on-understanding-network-performance-with-solana-migration](https://solanafloor.com/news/helium-foundation-offers-grant-program-for-proposals-on-understanding-network-performance-with-solana-migration) \n* Solana Saga Mobile Phone Now Available for Public Orders: A New Era of Web3.0 Adoption\n   * [https://solanafloor.com/news/solana-saga-mobile-phone-now-available-for-public-orders-a-new-era-of-web3-0-adoption](https://solanafloor.com/news/solana-saga-mobile-phone-now-available-for-public-orders-a-new-era-of-web3-0-adoption)\n* Conjure Your Masterpiece: Tomb Stoned's AI Art Generation Tool\n   * [https://solanafloor.com/news/conjure-your-masterpiece-tomb-stoneds-ai-art-generation-tool](https://solanafloor.com/news/conjure-your-masterpiece-tomb-stoneds-ai-art-generation-tool)\n* ANS Protocol: A New Name Service Revolutionizing Domain Creation on Solana\n   * [https://solanafloor.com/news/ans-protocol-a-new-name-service-revolutionizing-domain-creation-on-solana](https://solanafloor.com/news/ans-protocol-a-new-name-service-revolutionizing-domain-creation-on-solana)", "relevance": 0}, {"search": 1, "content": "Week in Solana News - November 19-25, 2023 ", "relevance": 0}, {"search": 1, "content": "🌬 Brand New Solana Token: SOL100 | Stealth Sale | Collectible 🧸 | Rare | BSC tokens are old news, Solana is the future 📣 Ok anon,\n\n[**Today we're going to learn about SOL100.**](https://sol100.io)\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\n[SOL100 is a Solana token, and not a BSC token. This is rare on reddit due to the \"monkey see, monkey do\" hive mind - particularly surrounding BSC. It's a BSC meme coin circlejerk around here.](https://sol100.io)\n\n[The way of the future is tokens on platforms like Solana, Cardano, Polkadot, etc.](https://sol100.io)\n\n[Not necessarily BSC.](https://sol100.io)\n\n[One such brand new Solana Token is SOL100. Here's some info.](https://sol100.io)\n\n\\------------------------------------\n\n✨ Collectible &amp; Rare\n\n✨ Only 100 token created\n\n✨ No new tokens can be minted\n\n✨ Fair launch by a western team\n\n✨ IDO nearly sold out\n\n✨ Only $5,700 worth of IDO priced tokens ($1k/SOL100) remain at the time of writing\n\n\\------------------------------------\n\nWebsite: [https://sol100.io](https://sol100.io) (Which you may have noticed, as this entire post is a link.)\n\nTelegram: [https://t.me/sol100token](https://t.me/sol100token) and [https://t.me/sol100trading](https://t.me/sol100trading)\n\n\\------------------------------------\n\nHere is some misc. information from the website.\n\n[Introducing SOL100 - a scarcity token powered by the Solana blockchain. Inflationary cryptocurrencies and crypto-fiats stray from Bitcoin and from long-term sustainability. SOL100 is more or less a clone of 42-coin, an old proof-of-work project, but with much more practicality and usability.](https://sol100.io)\n\n[Pushing upwards of 50,000 transactions per second, Solana provides a sandbox enabling SOL100 the longevity necessary for it to become a mainstream store of value.](https://sol100.io)\n\n[We are a team of programmers and venture capitalists from across the world. With over 300 years of combined experience. We anticipate witnessing decentralized, community fostered growth of the SOL100 ecosystem.](https://sol100.io)\n\n\\------------------------------------\n\n🌕 Moon Fundamentals 🌕\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\n🚀 70% of tokens sold to the public\n\n🚀 Each token sold at $1,000 a piece\n\n🚀 Only a $100k initial market cap\n\n🚀 Almost sold out (Only $5,700 worth left at the time of writing)\n\n🚀 20x - 100x potential\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\nTL;DR HODL SOL100 or die in hopeless poverty. This one is an absolute gem. 20x - 100x potential easily. Solana tokens are the next trend, and SOL100 appeals to NFT psychology. This one is going up in price - A lot - Guaranteed. Chat with the team on telegram now [https://t.me/sol100token](https://t.me/sol100token) and [https://t.me/sol100trading](https://t.me/sol100trading)\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: November 26 - December 2nd, 2023 ", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 ", "relevance": 0}, {"search": 1, "content": "🔥 Week in Solana News: December 10 - 16, 2023 🔥 ", "relevance": 0}, {"search": 1, "content": "Trending Solana News 🤓 ", "relevance": 0}, {"search": 1, "content": "Top Solana News of The Week \\- Bitcoin and Ethereum face network congestion as Solana sails smoothly   \n\\- [$SWTS](https://twitter.com/search?q=%24SWTS&amp;src=cashtag_click) sets new ATH as meme coin frenzy continues   \n\\- [$GUAC](https://twitter.com/search?q=%24GUAC&amp;src=cashtag_click) pumped +39,000% in just one day    \n\n\nand more! Subscribe to our newsletter for weekly updates:   \n[https://solanafloor.substack.com/p/top-solana-news-of-the-week-may-10](https://t.co/4Xz5qeRqG8)", "relevance": 0}, {"search": 1, "content": "Weekly Solana News: SOL investment thesis, growing TVL, points system &amp; more! ", "relevance": 0}, {"search": 1, "content": "Solana News: Colosseum, Anza Agave Client, Unibot, Helius Galleria, Google BigQuery and more! ", "relevance": 0}, {"search": 1, "content": "Weekly Solana News: SOL investment thesis, growing TVL, points system &amp; more! ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! ", "relevance": 0}, {"search": 1, "content": "Exploring free AI-based trading software for Bitcoin and Solana #News #Bitcoin #cryptocurrency #Grafa ", "relevance": 0}, {"search": 1, "content": "Circle launches EURC stablecoin on Solana #News #Finance #cryptocurrency #BlockChain #Blockchain ", "relevance": 0}, {"search": 1, "content": "Week in Solana News - Genesis Edition - November 19-25, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana News! Sam Says? | Vs. Google | $350 SOL Bear Trap ", "relevance": 0}, {"search": 1, "content": "Solana News: DePin, Squads Protocol, SOL MEV, Metaplex MPLX, Developer Report &amp; MORE! ", "relevance": 0}, {"search": 1, "content": "Profit-taking and Ethereum's ascent drive 20% drop in Solana #News #Ethereum #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2023 | Solana Crypto | Solana News Today | Solan... ", "relevance": 0}, {"search": 1, "content": "Top Solana News of The Week! ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction| Solana News | Solana News Today |Solana today | 23/March/2022| ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! ", "relevance": 0}, {"search": 1, "content": "All the hottest Solana news, in one location! (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 1 - 6, 2024 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Cardano leader denies reports of struggling ad campaign vs. Solana #News #Twitter #crypto #Strategy #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana News: Dymension launch, Unibot, Bonk on Kamino, JUP launch, Marinade, Layer 2's &amp; MORE! ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction| Solana News | Solana News Today |Solana today | 25/March/2022| ", "relevance": 0}, {"search": 1, "content": "Solana News More upside??   \n\n\n  \n[https://www.msn.com/en-us/news/technology/solana-co-founder-sees-upside-from-ethereum-e2-80-99s-merge-saga-web-3-mobile/ar-AA11N4RP](https://www.msn.com/en-us/news/technology/solana-co-founder-sees-upside-from-ethereum-e2-80-99s-merge-saga-web-3-mobile/ar-AA11N4RP)", "relevance": 0}, {"search": 1, "content": "r/TopSolanaNews Lounge A place for members of r/TopSolanaNews to chat with each other", "relevance": 0}, {"search": 1, "content": "Solana News - Saga Phone, Phantom Wallet, Metaplex NFT, Jupiter DEX, Meme Coins, Breakpoint &amp; MORE ", "relevance": 0}, {"search": 1, "content": "Eclipse unveils Ethereum rollup powered by Solana #News #Ethereum #Markets #Grafa ", "relevance": 0}, {"search": 1, "content": "Week in Solana News - November 19-25, 2023 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "🔥Top Solana News Of The Week!🔥  ✨Lily/Lotus gang releases the \"cropinator\", a tool to perfectly crop and edit your JPEGs.\n\nhttps://preview.redd.it/lvktoa99bsxa1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=c52b0aa6cc4afa64eb96dd39a3700f5d22b581d4\n\n✨Underground society hint at a major partnership with the most famous subDAO in all of Solana\n\n✨Oogy teases at the final five which is set to begin tomorrow\n\n✨The fracture release a new IXARUS art sneak peek\n\n✨Doge capital announce the release of their ordinal BTC collection - 69 Doges\n\nWhich of these news has the highest impact on the Solana market?🤔", "relevance": 0}, {"search": 1, "content": "Massive Cardano News and Crypto News - BTC, Filecoin, Solana, Karate ", "relevance": 0}, {"search": 1, "content": "🔥Top Solana news of the week!🔥 Thanks to Gimzo353 for putting this together.👏\n\nhttps://preview.redd.it/fngbczvcgswa1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=dc5f600d4f1590d1e022baf59b9fb33e55e3dd73\n\n✨Taiyo Robotics announce a partnership with Hello Moon to deliver \"World Beating Products  \n✨The Fracture releases a new IXARUS sneak peek 'EVE'  \n✨Doge Capital releases a VIP Kenl Ticket airdrop - Ticket grants access to exclusive raffles.   \n✨Portals announce their Island templates are now live  \n✨Oogy mentions in the recent announcement that their explorer will be live within a few days\n\nWhich of these news has the most impact on the market? Key us know in the comment section!", "relevance": 0}, {"search": 1, "content": "Solana News: Kamino Points, Drift Points, Saga Phone 2, Aave NEON EVM, MarginFi and ATOM vs SOL ", "relevance": 0}, {"search": 1, "content": "Solana News - Saga Phone, Phantom Wallet, Metaplex NFT, Jupiter DEX, Meme Coins, Breakpoint &amp; MORE ", "relevance": 0}, {"search": 1, "content": "Recent altcoin trends highlight distinct market dynamics of Ethereum and Solana #News #Bitcoin #crypto #BlockChain #Blockchain ", "relevance": 0}, {"search": 1, "content": "Solana News: $122 Million in Solana Projected to be Sold as Part of the Dump has been Staked (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Solana News - Solana NFT ", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Solana News: Attack &amp; Recovery + Solana NFTs in Exodus | Crypto News Today ", "relevance": 0}, {"search": 1, "content": "Solana News - Solana NFT ", "relevance": 0}, {"search": 1, "content": "TOP 4 Solana ALTCOINS - SOLANA DeFi Projects - Solana Ecosystem - Solana News ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - May 17, 2023 ", "relevance": 0}, {"search": 1, "content": "Finally some good news on Solana. ", "relevance": 0}, {"search": 1, "content": "Top Solana news of the last week!🔥 📍An address named \"Dumpoor Nexus\" deposited 900K $SOL to Coinbase on 14th April.\n\nhttps://preview.redd.it/5dzzonk45fua1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=41bc359fffb742e8798d5ed0a4aedc9e89142b80\n\n📍Solana NFTs show confirmation of the beginning of a long-term trend where both USD and $SOL value increase.\n\n📍Helium to migrate to Solana on 18th April.\n\nSource: StepDataInsight on Twitter \n\nWhich of these news has the biggest impact on the market this week? Share your thoughts!👇", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin |Solana News Today| Solana Crypto News, Solana Coin In Hindi ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin | Solana News Today | Solana Crypto News | Solana Coin ", "relevance": 0}, {"search": 1, "content": "solana new update | solana crypto | solana news ", "relevance": 0}, {"search": 1, "content": "solana price prediction | solana news today | solana coin | solana crypto news today ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - February 27, 2023 ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - May 3, 2023 ", "relevance": 0}, {"search": 1, "content": "Evan Deutsch on boosting non-native token liquidity with cloned assets on Solana #News #cryptocurrency #BlockChain #Blockchain #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana meme coins surge in value #News #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin |Solana News Today| Solana Crypto News, Solana Coin In Hindi ", "relevance": 0}, {"search": 1, "content": "Solana(Sol) price Prediction ! Solana news to day ! solana coin ! solana Crypto news ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 26, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana Breakpoint Insights: news &amp; updates ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 |SOLANA NEW UPDATE|| MASSIVE Solana News! ", "relevance": 0}, {"search": 1, "content": "Solana News Today || Solana Price Prediction! Solana Today Update ", "relevance": 0}, {"search": 1, "content": "Robinhood lists Solana meme coin WIF #News #crypto #Grafa ", "relevance": 0}, {"search": 1, "content": "Exciting News! $ROGER, the utility token on Solana  Exciting News! $ROGER, the utility token on Solana, is launching its own 'Roger Launchpad'! With 1 billion max supply, Mint and Freeze Authority revoked, and a SAFU-certified dev, this project is set to revolutionize Solana's crypto space. 🌐\n\n\\#Crypto #Solana #Launchpad\" ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 19, 2023 ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "Solana news I hold a little bag of Solana, and though I’ve been researching, this puts everything into perspective, as far as the massive uptick in interest and price. Who’s holding?\n\nhttps://cointelegraph.com/news/solana-hits-record-high-with-sol-price-up-over-218-in-six-weeks-what-s-behind-the-rally", "relevance": 0}, {"search": 1, "content": "Good News | Solana news today in Hindi | solana price prediction 2022| Solana nft | #Solana #Solcoin ", "relevance": 0}, {"search": 1, "content": "solana news today | solana | solana crypto news today | crypto adda | crypto currency news in hindi ", "relevance": 0}, {"search": 1, "content": "TOP 4 Solana ALTCOINS - SOLANA DeFi Projects - Solana Ecosystem - Solana News ", "relevance": 0}, {"search": 1, "content": "Exciting News in Crypto! Introducing $ROGER on Solana  Exciting News in Crypto! Introducing $ROGER on Solana – the utility token for the upcoming Roger Launchpad. Max supply: 1B, Mint and Freeze authorities revoked. SAFU-certified Dev and CFG NINJA audit ensure security. Holders enjoy unique RevShare! ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 5, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "SOLANA - CAUTION!!! EXPLOSIVE MOVE INBOUND!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 2, "content": "Ahh yes. Machine learning is \"average\" difficulty ", "relevance": 0}, {"search": 2, "content": "machine learning math Question: How well do OpenAI executives understand the math?   \n\nSam Altman dropped out of Stanford after 2 years as a CS major, to run Loopt (Wikipedia). Greg Brockman dropped out of Harvard first, and then from MIT, to join Stripe (Wikipedia).   \n\nMira Murati has a BS in MechEng from a low-ranking university (not in the same level as Stanford or MIT).   \nIlya Sutskever got a PhD under Geoffrey Hinton. He's clearly a scientist.     \n\nNow, Sam and Greg are obviously smart, since they got into top colleges. But, do they understand the math behind AI? Or they just focus on the business side and delegate the math to Ilya?    \n\nFor reference, Zuckerberg also became a millionaire after dropping out, but his startup was just a website, a social network, it was not cutting-edge research, as OpenAI seems to be doing. Also, Demis Hassabis does have a PhD.     \n\nI understand this is a math sub, so feel free to make the discussion as mathematical as possible.", "relevance": 0}, {"search": 2, "content": "How to learn Machine Learning? My Roadmap Hello! Machine learning sparked my interest, and I'm ready to dive in. I have some previous programming knowledge but I basically start at zero in data science. So naturally, I don't really know where to begin this journey. I've researched for resources and roadmaps to learn machine learning and created my own basic roadmap just to get started.\n\n**Math - 107 hours**\n\n* [Single-Variable Calculus - MIT](https://www.youtube.com/playlist?list=PLE2215608E2574180) \\~ 29 hours\n* [Multi-Variable Calculus - MIT](https://www.youtube.com/playlist?list=PL4C4C8A7D06566F38) \\~ 29 hours\n* [Linear Algebra - MIT](https://www.youtube.com/playlist?list=PLE7DDD91010BC51F8) \\~ 28 hours\n* [Statistics &amp; Probability - MIT](https://www.youtube.com/playlist?list=PLl8XY7QVSa4aUyZAtL2Hlf_mx3LaSix9B) \\~ 21 hours\n\n**Programming - 135 hours**\n\n* [Introduction to Computer Science and Programming Using Python](https://www.edx.org/course/introduction-to-computer-science-and-programming-7) \\~ 135 hours\n\n**Machine Learning - 200+ hours**\n\n* [Machine Learning Specialization (Andrew Ng)](https://www.deeplearning.ai/program/machine-learning-specialization/) (release June)\n* [Deep Learning Specialization (Andrew Ng)](https://www.coursera.org/learn/neural-networks-deep-learning?specialization=deep-learning&amp;irclickid=Xa1wyCQHuzYeRMESFSRiQXN3UkGXVIyn4RCEVk0&amp;irgwc=1) \\~ 142 hours\n\nPlease give comments on it and or advice on better/more efficient ways to learn. Thanks!", "relevance": 0}, {"search": 2, "content": "[D] A Super Harsh Guide to Machine Learning First, read fucking Hastie, Tibshirani, and whoever. Chapters 1-4 and 7-8. If you don't understand it, keep reading it until you do. \n\nYou can read the rest of the book if you want. You probably should, but I'll assume you know all of it. \n\nTake Andrew Ng's Coursera. Do all the exercises in python and R. Make sure you get the same answers with all of them. \n\nNow forget all of that and read the deep learning book. Put tensorflow and pytorch on a Linux box and run examples until you get it. Do stuff with CNNs and RNNs and just feed forward NNs.\n\nOnce you do all of that, go on arXiv and read the most recent useful papers. The literature changes every few months, so keep up. \n\nThere. Now you can probably be hired most places. If you need resume filler, so some Kaggle competitions. If you have debugging questions, use StackOverflow. If you have math questions, read more. If you have life questions, I have no idea.", "relevance": 0}, {"search": 2, "content": "Is it too late to join machine learning? As title says.\n\n\\- Many more people joining the CS field. Lots of people struggling to get jobs.\n\n\\- Now CS skill feels useless as even ChatGPT can just do any code you ask it.\n\n\\- Machine learning skills seem only in demand at the top? The pioneers?\n\nIt is worth it for someone to even start learning machine learning skills? If not, what should they do?\n\nSerious replies only please. Looking for career advice.", "relevance": 0}, {"search": 2, "content": "How to become a Machine Learning Engineer I am currently working as a Data Scientist but I would like to start learning the skills I need to become a MLE. I understand that a MLE does not work only with the sexy machine learning models part, but also with all the CI/CD, migration to production, ML pipelines and all things related to automating the running of the model and training. What are the skills, platforms, softwares and other technical skills I need to learn to start moving towards that role?", "relevance": 0}, {"search": 2, "content": "Machine Learning Engineer Early Career Roles I have anecdotally seen fewer early career/new grad machine learning engineer positions open since the downturn in the software engineering industry and the layoffs. \n\nThis parallels the paucity of early career SWE positions in the wider software engineering industry. Any insight as to whether this is transient, or companies going forward may be less inclined to hire early career ML engineers in the future and make do with their current ML engineers?", "relevance": 0}, {"search": 2, "content": "How much of stats and math do we REALLY need for Machine learning engineer? Hello,\n\nI am asking about the MLE that create models and also deploy then. \n\nIn my team we have two type of data scientists:\n- one that is very good in kaggle but don't know stats and math deeply.\n- other that has a deep understanding in maths and stats. \n\nBoth can create good models. \n\nI am asking about MLE because, most companies that has this name instead of DS looks like to have more mature in data science culture. \n\nWhat's your opinion about this?\n\nEdit: I am talk about the MLE/DS that in majory percent of time create models and not do analysis like: which features cause the trend (causal inference example)", "relevance": 0}, {"search": 2, "content": "Do you think AI/machine learning is a very important field to get into for future relevance? I am just starting to learn about it this week and thinking it is really going to be integral in the years to come right?\n\nPerhaps as important if not more than the information age we are in now. More probably when skynet goes online and the war between humans/ai begins.\n\nSo, good to get onboard now.\n\nI think my last great decision was learning coding around 2016 and this is going to be another great one in terms of time management and where to focus your efforts.\n\nNot only yes but interested to hear what fields it will be relevant in? All?\n\nEDIT: seems this is going off what I intended. I am not actually looking for a new career path. I am more just interested in knowing what future implementations will/might be as it becomes more ubiquitous, just speculating what that might be.", "relevance": 0}, {"search": 2, "content": "jrDevVsMachineLearning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Magic. ", "relevance": 0}, {"search": 2, "content": "Machine learning... ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Machine learning ", "relevance": 0}, {"search": 2, "content": "Garbage in/Garbage out as they say with machine learning algorithms ", "relevance": 0}, {"search": 2, "content": "From Hello world to directly Machine Learning? ", "relevance": 0}, {"search": 2, "content": "Machine learning generated images animation ", "relevance": 0}, {"search": 2, "content": "Actually, I am machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Battlestation ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "How to bully machine learning training ", "relevance": 0}, {"search": 2, "content": "QAnon founder may have been identified thanks to machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Did Anyone Say ✨Machine Learning?✨ ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}, {"search": 2, "content": "Authright explores machine learning ", "relevance": 0}, {"search": 2, "content": "How Machine Learning \"Learns\" Using Loss Minimization ", "relevance": 0}, {"search": 2, "content": "Machine learning generated visuals ", "relevance": 0}, {"search": 2, "content": "Machine learning algorithms are easily defeated ", "relevance": 0}, {"search": 2, "content": "Powerful antibiotic discovered using machine learning for first time ", "relevance": 0}, {"search": 2, "content": "How Do Machines Learn? ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "How to bully machine learning training ", "relevance": 0}, {"search": 2, "content": "Math + Algorithms = Machine Learning ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}, {"search": 2, "content": "machineLearnMoneyEarn ", "relevance": 0}, {"search": 2, "content": "I started working at this company with machine learning but what actually am I? A machine teacher? ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "Machine Learning Helped Scientists Create an Enzyme That Breaks Down Plastic at Warp Speed ", "relevance": 0}, {"search": 2, "content": "How does machine learning work? ", "relevance": 0}, {"search": 2, "content": "Hololive Myth portrait created with Artbreeder (machine learning) by Hea ", "relevance": 0}, {"search": 2, "content": "Machine learning engineers ", "relevance": 0}, {"search": 2, "content": "New map made with a machine learning algorithm - Botnik Studios ", "relevance": 0}, {"search": 2, "content": "Machine Learning Applied To Art ", "relevance": 0}, {"search": 2, "content": "machine learning ", "relevance": 0}, {"search": 2, "content": "New MIT machine learning model shows relaxing quarantine rules will spike COVID-19 cases ", "relevance": 0}, {"search": 2, "content": "Some of our countries Royals from history 'brought to life' using machine learning. ", "relevance": 0}, {"search": 2, "content": "A machine learning algorithm walked into a bar. ", "relevance": 0}, {"search": 2, "content": "[D] The machine learning community has a toxicity problem It is omnipresent!\n\n**First** of all, the peer-review process is *broken*. Every fourth NeurIPS submission is put on arXiv. There are DeepMind researchers publicly going after reviewers who are criticizing their ICLR submission. On top of that, papers by well-known institutes that were put on arXiv are accepted at top conferences, despite the reviewers agreeing on rejection. In contrast, vice versa, some papers with a majority of accepts are overruled by the AC. (I don't want to call any names, just have a look the openreview page of this year's ICRL).\n\n**Secondly,** there is a *reproducibility crisis*. Tuning hyperparameters on the test set seem to be the standard practice nowadays. Papers that do not beat the current state-of-the-art method have a zero chance of getting accepted at a good conference. As a result, hyperparameters get tuned and subtle tricks implemented to observe a gain in performance where there isn't any.\n\n**Thirdly,** there is a *worshiping* problem. Every paper with a Stanford or DeepMind affiliation gets praised like a breakthrough. For instance, BERT has seven times more citations than ULMfit. The Google affiliation gives so much credibility and visibility to a paper. At every ICML conference, there is a crowd of people in front of every DeepMind poster, regardless of the content of the work. The same story happened with the Zoom meetings at the virtual ICLR 2020. Moreover, NeurIPS 2020 had twice as many submissions as ICML, even though both are top-tier ML conferences. Why? Why is the name \"neural\" praised so much? Next, Bengio, Hinton, and LeCun are truly deep learning pioneers but calling them the \"godfathers\" of AI is insane. It has reached the level of a cult.\n\n**Fourthly**, the way Yann LeCun talked about biases and fairness topics was insensitive. However, the *toxicity* and backlash that he received are beyond any reasonable quantity. Getting rid of LeCun and silencing people won't solve any issue.\n\n**Fifthly**, machine learning, and computer science in general, have a huge *diversity problem*. At our CS faculty, only 30% of undergrads and 15% of the professors are women. Going on parental leave during a PhD or post-doc usually means the end of an academic career. However, this lack of diversity is often abused as an excuse to shield certain people from any form of criticism.  Reducing every negative comment in a scientific discussion to race and gender creates a toxic environment. People are becoming afraid to engage in fear of being called a racist or sexist, which in turn reinforces the diversity problem.\n\n**Sixthly**, moral and ethics are set *arbitrarily*. The U.S. domestic politics dominate every discussion. At this very moment, thousands of Uyghurs are put into concentration camps based on computer vision algorithms invented by this community, and nobody seems even remotely to care. Adding a \"broader impact\" section at the end of every people will not make this stop. There are huge shitstorms because a researcher wasn't mentioned in an article. Meanwhile, the 1-billion+ people continent of Africa is virtually excluded from any meaningful ML discussion (besides a few Indaba workshops).\n\n**Seventhly**, there is a cut-throat publish-or-perish *mentality*. If you don't publish 5+ NeurIPS/ICML papers per year, you are a looser. Research groups have become so large that the PI does not even know the name of every PhD student anymore. Certain people submit 50+ papers per year to NeurIPS. The sole purpose of writing a paper has become to having one more NeurIPS paper in your CV. Quality is secondary; passing the peer-preview stage has become the primary objective.\n\n**Finally**, discussions have become *disrespectful*. Schmidhuber calls Hinton a thief, Gebru calls LeCun a white supremacist, Anandkumar calls Marcus a sexist, everybody is under attack, but nothing is improved.\n\nAlbert Einstein was opposing the theory of [quantum mechanics](https://en.wikipedia.org/wiki/Albert_Einstein#Einstein's_objections_to_quantum_mechanics). Can we please stop demonizing those who do not share our exact views. We are allowed to disagree without going for the jugular. \n\nThe moment we start silencing people because of their opinion is the moment scientific and societal progress dies. \n\nBest intentions, Yusuf", "relevance": 0}, {"search": 2, "content": "Machine learning is getting smarter than ever before ", "relevance": 0}, {"search": 2, "content": "sometimes machine learning algorithms are very funny ", "relevance": 0}, {"search": 2, "content": "A machine learning joke (credits to u/z0ltan_x) ", "relevance": 0}, {"search": 2, "content": "Machine learning much? (Repost from r/HolUp) ", "relevance": 0}, {"search": 2, "content": "How Do Machines Learn? ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "How to confuse your machine learning... ", "relevance": 0}, {"search": 2, "content": "NYC Bans Students and Teachers from Using ChatGPT | The machine learning chatbot is inaccessible on school networks and devices, due to \"concerns about negative impacts on student learning,\" a spokesperson said. ", "relevance": 0}, {"search": 2, "content": "XKCD Comic does machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Pipelines ", "relevance": 0}, {"search": 2, "content": "Machine-learning algorithm beats 20 lawyers in NDA legal analysis ", "relevance": 0}, {"search": 2, "content": "Hyper Text Machine Learning ", "relevance": 0}, {"search": 2, "content": "US national lab is using machine learning to detect rogue nuclear threats ", "relevance": 0}, {"search": 2, "content": "Should r/MachineLearning join the reddit blackout to protest changes to their API? Hello there, r/MachineLearning,\n\nRecently, Reddit has announced some [changes to their API](https://www.reddit.com/r/modnews/comments/13wshdp/api_update_continued_access_to_our_api_for/) that may have pretty serious impact on many of it's users.\n\n[You may have already seen quite a few posts like these](https://www.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/) across some of the other subreddits that you browse, so we're just going to cut to the chase.\n\n# What's Happening\n\nThird Party Reddit apps (such as Apollo, Reddit is Fun and others) are going to become ludicrously more expensive for it's developers to run, which will in turn either kill the apps, or result in a monthly fee to the users if they choose to use one of those apps to browse. Put simply, each request to Reddit within these mobile apps will cost the developer money. The developers of Apollo [were quoted around $2 million per month](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) for the current rate of usage. The only way for these apps to continue to be viable for the developer is if you (the user) pay a monthly fee, and realistically, this is most likely going to just outright kill them. **Put simply: If you use a third party app to browse Reddit, you will most likely no longer be able to do so, or be charged a monthly fee to keep it viable.**\n\nIn lieu of what's happening, [an open letter](https://www.reddit.com/r/ModCoord/comments/13xh1e7/an_open_letter_on_the_state_of_affairs_regarding/) has been released by the broader moderation community. Part of this initiative includes a potential subreddit blackout (meaning, the subreddit will be privatized) on June 12th, lasting 24-48 hours or longer. On one hand, this is great to hopefully make enough of an impact to influence Reddit to change their minds on this. On the other hand, we usually stay out of these blackouts, and we would rather not negatively impact usage of the subreddit.\n\nWe would like to give the community a voice in this. Is this an important enough matter that r/machinelearning should fully support the protest and blackout the subreddit on June 12th? Feel free to leave your thoughts and opinions below. \n\nAlso, please use up/downvotes for this submission to make yourself heard: upvote: r/ML should join the protest, downvote: r/ML should not join the protest.", "relevance": 0}, {"search": 2, "content": "Fake YouTube comments using machine learning ", "relevance": 0}, {"search": 2, "content": "Machine learning means repetitive behaviour ", "relevance": 0}, {"search": 2, "content": "My SOTA machine learning model. ", "relevance": 0}, {"search": 2, "content": "Nexto, a community machine learning Rocket League bot, even understands our most important rule. ", "relevance": 0}, {"search": 2, "content": "Machine Learning Algorithms in a nutshell ", "relevance": 0}, {"search": 2, "content": "Such Machine Learning Much Wow ", "relevance": 0}, {"search": 2, "content": "Experiments in the Smooth Transition of Zoom, Rotation, Pan, and Learning Rate in Text-to-Image Machine Learning Imagery [15,000 frames] ", "relevance": 0}, {"search": 2, "content": "Ian Goodfellow, Apple's Director of Machine Learning, Inventor of GAN, Resigns Due to Apple's Return to Office Work ", "relevance": 0}, {"search": 2, "content": "Supervised machine learning ", "relevance": 0}, {"search": 2, "content": "machineLearningChad ", "relevance": 0}, {"search": 2, "content": "For some reason, nobody uses R for machine learning ", "relevance": 0}, {"search": 2, "content": "[OC] Using machine learning to predict All-Stars from the 2019 draft This post has a few graphs. If you don't want to click on each one individually, they're all in an imgur album [here](https://imgur.com/a/5nkFTu4).\n\nThere is a tl;dr at the end of the post.\n\n***\n\n#Introduction\n\nWhen picking in the top-10 of a draft, teams have one goal: select a franchise-altering player with star potential. Though some teams draft for need and prefer to select more NBA-ready players, in general, GMs do their best to select a player who may become a star.\n\nThis is very challenging. Many factors affect a player’s ability to become a star. Along with college performance, factors like athleticism, intangibles, injuries, coaching, and more change a player’s star potential.\n\nAs fans on the outside looking in, we have limited information on most of these factors except one: college performance. Though even the college performance of many players needs context (such as Cam Reddish’s low volume stats due to playing with Zion Williamson and R.J. Barrett), it’s one of the only quantifiable factors we can use. So, let’s try to use college stats to predict All-Stars in the top-10 of the 2019 draft.\n\n***\n\n#Methods\n\nFirst, I created a database of every top-10 pick from the 1990-2015 NBA drafts. We use 1990 as the limit because it ensures every player played their entire college career with a 3-point line. The 2015 draft was set as an upper limit so that all players played the entirety of their rookie contract, giving them some chance to make an All-Star team.\n\nIn addition to collecting their college stats, I marked whether the prospect made an All-Star team. There is no consideration for whether the player became an All-Star while on the team that drafted him, how long it took him to get there, etc. All data was collected from Sports-Reference.\n\nPlayers who made an All-Star team at some point in their career earned a “1” in the All-Star column. Meanwhile, players who failed to make an All-Star team earned a “0.”\n\nThis represents a binary classification problem. There are two classes we’re looking at: All-Star and not All-Star. The models try to match each player to one of the two classes. We’ll also look at the prediction probability (probability for the player to be in the class) the models give each player.\n\nTo create the models, we used the following stats as inputs:\n\n|Counting stats|Efficiency|Other|\n:--|:--|:--|\n|PPG|TS%|Pick|\n|TRB|3PAr|SOS|\n|AST|FTr||\n|STL|||\n|BLK|||\n\nNote that win shares, box plus/minus, and other holistic advanced stats that are excluded. College BPM data is available only from the 2011 draft, and college WS data is available only from the 1996 draft. Therefore, using BPM restricts the data set massively. Though adding WS only excludes 6 years of drafts, the models were significantly less accurate when including WS.\n\nThe models predicted whether the player made an All-Star team (the 1s or 0s described above).\n\nWe collected the same set of stats for the top-10 picks in the 2019 draft. When using the models to All-Stars out of the 2019 draft, we’ll look primarily at the prediction probabilities of the positive class. A prediction probability of 0.75 indicates that the model is 75% certain the player will fall into class 1 (All-Star). Therefore, every player with a prediction probability above 0.5 would be predicted as a 1 if we just used the models to predict classes instead of probability.\n\nGiven that about 31% of top-10 picks since 1990, the prediction probabilities give us more information about the predictions. If we’d just predict the classes, we’d likely get 2-4 1s, and the rest be 0s. However, with the prediction probabilities, we can see whether a player has a higher All-Star probability than others drafted at his pick historically, making him a seemingly good value.\n\nNote that unlike other problems like predicting All-NBA teams – where voters have general tendencies making the problem easy to predict accurately – predicting All-Stars is incredibly difficult. Players develop differently, and college stats alone are not nearly enough to accurately project a player’s All-Star potential. We don’t expect the models to incredibly accurate. After all, if they were, teams would use better models higher quality data to make predictions that would help them always pick All-Stars.\n\nIn total, we made four models:\n\n1. Logistic classifier (LOG)\n2. Support vector classifier (SVC)\n3. Random forest classifier (RF)\n4. Gradient boosting classifier (GBC)\n\n***\n\n#Comparing All-Star and not All-Star stats\n\nLet’s compare some college stats between All-Stars and not All-Stars. This will illustrate just how difficult it is to differentiate the two groups based off just their college stats.\n\nBefore diving into the differences (or lack thereof), let’s first establish how to read these plots. This type of graph is called a boxplot. The yellow line represents the median or middle value in each group. The top of the box signifies the 75th percentile, while the bottom of the box signifies the 25th percentile. So, the 25th-50th percentile can be seen between the bottom of the box and the yellow line. From the yellow line to the top of the box represents the 50th-75th percentile. The full box represents the 25th-75th percentile of the data.\n\nThe lines flowing out of the box are called “whiskers.” The top of the whisker, or the “T” shape, represents the greatest value, excluding outliers. The bottom whisker represents the opposite (the lowest value excluding outliers). From the top of the box to the top of the whisker represents the 75th-100th percentile. The bottom of the box to the bottom of the whisker represents the 0th-25th percentile. Therefore, the top of the box also represents the median of the upper half of the data set.\n\nThe dots above or below the whiskers represent outliers. Outliers above the whiskers represent points that are greater than the upper quartile (top of the box) + 1.5 times then interquartile range (top of the box – bottom of the box). Outliers below the whiskers represent points that are less than the lower quartile (bottom of the box) – 1.5 times then interquartile range (top of the box – bottom of the box).\n\nFirst, let’s look at their points per game.\n\nhttps://i.imgur.com/W344Rfe.png\n\nThough the All-Stars have a marginally higher median PPG, the not All-Stars have a higher upper quartile PPG (top of the whisker). Therefore, there’s no clear difference here between the two groups, especially given that the bottom whiskers extend similarly for both groups.\n\nNext, let’s look at rebounds and assists. Because big men will get more rebounds, and guards will get more assists, All-Stars and not All-Stars seems to be an odd comparison. However, we’re just looking for differences in basic counting stats.\n\nhttps://i.imgur.com/P9vayUu.png\n\nhttps://i.imgur.com/GoSlUqV.png\n\nFor rebounds, there’s practically no difference yet again. Both groups show a nearly identical median and very similar ranges. For assists, the All-Stars have a higher median assist total, and the 25th-75th percentile range stretches higher. Therefore, there’s a small difference between the two.\n\nLet’s look at the difference in strength of schedule (SOS).\n\nhttps://i.imgur.com/ejj28M6.png\n\nYet again, there’s a minimal difference. The medians are almost equal. Though the All-Stars range is higher than the not All-Stars range, there are multiple low outliers for the All-Stars.\n\nLastly, let’s look at the difference in picks.\n\nhttps://i.imgur.com/D95LjtS.png\n\nThis is the first pronounced difference. The median pick of an All-Star is much lower than that of a not All-Star. Because no other stats showed any significant difference between the two groups, we can expect pick to be the most important feature in the models. Furthermore, this difference shows that NBA GMs are generally pretty good at drafting.\n\n\n***\n\n#Model analysis\n\n##Model creation: data transformation\n\nAfter creating the four models described above and testing their accuracy with basic metrics (discussed later), I did two things.\n\nFirst, I tried manipulating the data. To make the models, I initially used the raw data. Sometimes, normalizing the data may lead to better performance. Normalizing the data means scaling each individual stat so that the highest value is 1 and the lowest value is 0. This can be done across the entire data set (the player with the highest college PPG would have a PPG input to the models of 1) or to each draft year (the player with the highest college PPG in each draft year would have a PPG input to the models of 1). Neither of these methods increased performance.\n\nNext, I tried transforming the data into ranks. Instead of giving raw or normalized stats, we can simply rank all the players by their stats. Like normalization, this gives us some method to compare the players. However, ranking each stat for neither the entire data set nor each draft year improved performance.\n\nAfter all, we’ll use the usual, raw data we got from Sports Reference.\n\n##Model creation: hyperparameter tuning\n\nEvery model has certain characteristics that determine how the model fits the data. These characteristics, or hyperparameters, make the model’s architecture. For example, if we were using an exponential model, the degree (quadratic, cubic, quartic, etc.) would be a hyperparameter. Hyperparameters impact the model’s performance.\n\nIn previous posts, I used nice round numbers for the model hyperparameters and played around with them randomly until I found a mix that yielded a strong model. However, this is not scientific.\n\nFor a scientific hyperparameter tuning, we can use a method called grid search. Grid search takes a grid of possible values for hyperparameters we want to test, creates a model for each possible combination, evaluates the model’s accuracy, and returns the “best” model. In this case, we want to find the model that has the best recall (a metric we’ll discuss soon).\n\nThe SVC, RF, and GBC saw their performance improve with the hyperparameters from the grid search. So, for those models, we used the best parameters found by the grid search. For the LOG, we used the parameters we set before the grid search (in this case, the default).\n\n##Basic goodness-of-fit\n\nWe measure the performance of classification models in several ways. The simplest metric is accuracy, which measures the percentage of predictions the model made correctly. Essentially, it takes the list of predictions and finds how many values in the list were perfect matches to the list of results.\n\nBecause this is the simplest classification metric, it has its flaws. Accuracy only measures correct predictions, so it may be misleading in some cases. For example, if we’re predicting something very rare, then almost all the results will be 0s. Therefore, a model that exclusively predicts 0s will have a high accuracy even if it has no predictive power.\n\nGiven that there are more not All-Stars than All-Stars, accuracy is not the best metric in this case. 30% of the testing set consists of All-Stars, meaning a model could achieve 70% accuracy by predicting all 0s (that no one will be an All-Star). However, because picking correct All-Stars at the expense of picking some incorrect All-Stars is better than picking no All-Stars at all, it’s fine to have an accuracy less than 70%.\n\nTo understand the next few classification metrics, we must first establish some terms. A true positive occurs when the model predicts a 1, and the actual value is a 1 (meaning the model correctly predicted an All-Star). A true negative is the opposite; the model correctly predicts a 0. False positives occur when the model predicts a 1 where the actual value is 0, and false negatives occur when the model predicts a 0 where the actual value is 1.\n\nRecall measures a model’s ability to predict the positive class. In this case, it’s the model’s ability to find all the All-Stars (true positives). Recall = TP / (TP + FN), meaning that a “perfect” model that predicts every positive class correctly will have a recall of 1. Recall is arguably the most important metric here.\n\nPrecision measures how many of the returned predicted All-Stars were true. It penalizes the model for incorrectly predicting a bunch of All-Stars. Precision = TP / (TP + FP), meaning that a “perfect” model will have a precision of 1. Notice that there is typically a trade-off between precision and recall given that recall measures ability to find true positives, while precision measures ability to limit false positives.\n\nTo combine the two metrics, we can use F1. F1 = 2(precision * recall) / (precision + recall). By combining precision and recall, F1 lets us compare two models with different precisions and recalls. Like recall and precision, F1 values are between 0 and 1, with 1 being the best.\n\nNow that we’re familiar with some classification metrics, let’s examine the models’ performance. The table below shows the scores of all four models on the previously mentioned metrics.\n\n|Model|Accuracy|Recall|Precision|F1|\n:--|--:|--:|--:|--:|\n|LOG|0.746|0.316|0.667|0.429|\n|SVC|0.762|0.263|0.833|0.4|\n|RF|0.746|0.368|0.636|0.467|\n|GBC|0.73|0.368|0.583|0.452|\n\nThe RF and GBC had the highest recall, though the RF had higher precision and accuracy than the GBC. Although the SVC had the highest precision and accuracy, we’re most concerned with recall, meaning the other models are stronger. The LOG appears slightly weaker than the RF and GBC, though it’s still a strong model.\n\nAs mentioned before, we’re not expecting dazzling performance from the models. After all, if models using publicly available data could predict All-Stars, NBA teams with full analytics staffs would have no problem finding them. Therefore, though these metrics are not encouraging by themselves, they show that the models have some predictive power.\n\n##Improvement over random\n\nTo show that the models are stronger than randomly predicting All-Stars, I made a dummy classifier. The dummy classifier randomly predicts players to be a 1 or 0 with respect to the training set’s class distribution. Given that the training set had 32% All-Stars (the testing set had 30% as mentioned earlier), the dummy classifier will randomly predict 32% of the testing set to be All-Stars.\n\nThe table below shows the dummy classifier’s performance.\n\n|Model|Accuracy|Recall|Precision|F1|\n:--|--:|--:|--:|--:|\n|Dummy|0.556|0.316|0.286|0.3|\n\nEach of our four models has higher accuracy, precision, and F1 scores than the dummy classifier. It is slightly concerning that the dummy classifier has equal recall to the LOG and higher recall than the SVC. Nevertheless, the LOG and SVC were much better at getting their All-Star predictions correct when they did predict them (higher precision).\n\n##Confusion matrices\n\nTo help visualize a model’s accuracy, we can use a confusion matrix. A confusion matrix shows the predicted vs. actual classes in the test set for each model. It plots each model’s true positives (bottom right), true negatives (top left), false positive (top right), and false negatives (bottom left) in a square.\n\nThe testing set was small; it had only 63 data points. Below are the confusion matrices for all four models.\n\nhttps://i.imgur.com/H1DeMjc.png\n\nhttps://i.imgur.com/kTgdOrV.png\n\nhttps://i.imgur.com/jgQmTDV.png\n\nhttps://i.imgur.com/NjcmZW9.png\n\n##Cross-validation\n\nAs we do in other machine learning posts, we want to cross-validate our models. This will ensure that they didn’t “memorize” the correct weights for this specific split of data, meaning they overfit.\n\nIn classification problems, it’s important to see that the class balance is close to even between the training and testing set. This could influence cross-validation, given that a different split of the data might have a large imbalance. Our training set had 32% All-Stars while our testing set had 30% All-Stars, making this a non-factor.\n\nThe table below shows the cross-validated accuracy (k = 3) and the scores’ 95% confidence interval.\n\n|Model|CV accuracy|95% confidence interval|\n:--|--:|:--|\n|LOG|0.665|+/- 0.096|\n|SVC|0.683|+/- 0.027|\n|RF|0.746|+/- 0.136|\n|GBC|0.633|+/- 0.135|\n\nEvery model has a cross-validated accuracy score that’s close to its real accuracy score.\n\n##Log loss and ROC curves\n\nThe final metrics we’ll use are log loss and ROC curves.\n\nLog loss is essentially like accuracy with prediction probabilities instead of predicted classes. Lower log loss is better. Because we’re interested in the prediction probabilities, log loss is an important metric here. Though log loss isn’t exactly simple to interpret by itself, it’s useful for comparing models.\n\nThe table below shows the four models’ log loss values.\n\n|Model|Log loss|\n:--|--:|\n|LOG|0.546|\n|SVC|0.56|\n|RF|0.556|\n|GBC|1.028|\n\nThe biggest takeaway from the log loss is that the GBC may not be as strong as we initially thought, given that all the other models have significantly lower log loss scores.\n\nThe second to last metric we’ll look at is the receiver operating characteristics (ROC) curve and the area under it. The curve shows the “separation” between true positives and true negatives by plotting them against each other. The area gives us a numerical value for this separation.\n\nA model with no overlap in probability between TP and TN (perfect) would have a right-angled ROC curve and an area under the curve of 1. As the overlap increases (meaning the model is worse) the curve gets closer to the line y = x.\n\nThe ROC curves and the area under the curve for each model is below.\n\nhttps://i.imgur.com/kmGla77.png\n\nEach model has a similar ROC curve and area under the curve.\n\n***\n\n#Why do the models predict what they do?\n\nBefore going into the results, the last thing we’ll want to look at is what the models find important in predicting All-Stars. There are a couple ways to do this.\n\nFirst, we’ll look at the model coefficients and feature importances. The LOG and SVC have coefficients, while the RF and GBC have feature importances. Coefficients are different from feature importances in that the coefficients are used to express the model in an equation. Higher coefficients do not mean the feature is more important, they just mean the model scaled that feature differently. On their own, they don’t have much meaning for us, but for comparison purposes, we can see which model scales a certain factor more.\n\nThe graph below shows the coefficients of the LOG and SVC.\n\nhttps://i.imgur.com/MjISg1X.png\n\nThe two models have very similar coefficients for the most part. The two main differences are in the steals and blocks coefficients. While the LOG gives blocks a negative coefficient, the SVC gives it a positive coefficient. Furthermore, the LOG gives steals a much higher coefficient than the SVC.\n\nNext, let’s look at feature importances. Feature importance shows how much the model relies on a feature by measuring how much the model’s error increases without it. Higher feature importance indicates more reliance on the feature.\n\nThe graph below shows the feature importances of the RF and GBC.\n\nhttps://i.imgur.com/mNUa0SW.png\n\nAs we would expect, pick was the most important feature for both models (the GBC point covers the RF point). Interestingly, SOS was almost as important to the GBC as pick.\n\n##Shapley values\n\nTo get a more detailed view of how each feature impacted each model, we can use a more advanced model explanation metric called Shapley values.\n\nShapley value is defined as the “average marginal contribution of a feature value over all possible coalitions.” It tests every prediction for an instance using every combo of our inputs. This along with other similar methods gives us more information about how much each individual feature affects each model in each case.\n\nFirst, we’ll look at the mean SHAP value, or average impact of each feature on each of the four models. A higher value indicates a more important feature.\n\nThe four graphs below show the mean SHAP values for each of the four models (in order of LOG, SVC, RF, GBC).\n\nhttps://i.imgur.com/2zv7BGd.png\n\nhttps://i.imgur.com/ysMmlhg.png\n\nhttps://i.imgur.com/GqRoVj7.png\n\nhttps://i.imgur.com/51GcrlK.png\n\nThe LOG, RF, and GBC all have pick as the most important feature, as expected. Steals being the second most important feature is surprising. The three models all have pick, steals, rebounds, and assists in their top-5 most important features.\n\nThe SVC has odd results, as pick was only the third most important feature behind rebounds and assists.\n\nTo get a more detailed and individualized view of the feature impacts, we can look at the SHAP value for each point.\n\nIn the graphs below, the x-axis represents the SHAP value. The higher the magnitude on the x-axis (very positive or very negative), the more the feature impacts the model. The color indicates the feature value, with red being high values and blue being low values. So, a blue point for pick indicates the player was picked early.\n\nWith these plots, we can make conclusions like “pick is very important to the models when its value is low but becomes less important as players are picked later.”\n\nThe four graphs below show the individual point SHAP and feature values.\n\nhttps://i.imgur.com/FbarVSw.png\n\nhttps://i.imgur.com/HKheCGM.png\n\nhttps://i.imgur.com/CUSmVbd.png\n\nhttps://i.imgur.com/puJObd8.png\n\nFor the LOG, pick mattered a lot when its value was low. As players were picked later, it had less of an impact on model output. The SVC was more affected by high assists, rebounds, and steal values than low pick values, unlike other models.\n\nRebounds had minimal impact on the RF except for cases where the player’s rebound total was very low. The opposite is true for TS% in both the RF and GBC; generally, TS% had minimal impact on the model except for the highest TS% values. For the GBC, the highest SOS values had a very high impact on model output.\n\n***\n\n#Results\n\nTo make predictions for the 2019 draft, we looked at prediction probabilities instead of predicted classes. This gives us each model’s probability that the player makes an All-Star team.\n\nThe four graphs below show each model’s predictions.\n\nhttps://i.imgur.com/RohPa4F.png\n\nhttps://i.imgur.com/mIlxG9X.png\n\nhttps://i.imgur.com/HqmnVoc.png\n\nhttps://i.imgur.com/9wKvXAY.png\n\nEvery model gives Zion the highest All-Star probability. The LOG and SVC’s top-3 in All-Star probability mimic the draft’s top-3. However, the RF and GBC love Jaxson Hayes; both models gave him the second-highest All-Star probability, just above Ja Morant. Both the RF and GBC also dislike DeAndre Hunter, giving him the lowest All-Star probability.\n\nThe graph below shows the average prediction of the four models.\n\nhttps://i.imgur.com/c9JSRWj.png\n\nThe RF and GBC propel Jaxson Hayes to the fourth-highest average predicted All-Star probability.\n\nThe table below shows each model's predictions and the average of the predictions.\n\n|Pick|Player|LOG|SVC|RF|GBC|Average|\n--:|:--|--:|--:|--:|--:|--:|\n|1|Zion Williamson|0.71|0.63|0.80|1.00|0.78|\n|2|Ja Morant|0.65|0.49|0.58|0.91|0.66|\n|3|RJ Barrett|0.37|0.49|0.53|0.62|0.50|\n|4|DeAndre Hunter|0.22|0.23|0.16|0.00|0.15|\n|5|Darius Garland|0.19|0.24|0.42|0.10|0.23|\n|6|Jarrett Culver|0.25|0.30|0.48|0.47|0.37|\n|7|Coby White|0.15|0.27|0.31|0.16|0.22|\n|8|Jaxson Hayes|0.08|0.17|0.61|0.94|0.45|\n|9|Rui Hachimura|0.07|0.11|0.17|0.00|0.09|\n|10|Cam Reddish|0.10|0.20|0.35|0.28|0.23|\n\nTo determine the best value picks according to the models, we can compare each player’s predicted All-Star probability to the percent of players drafted in his slot that made an All-Star team in our data set (1990-2015 drafts). So, if a first pick and a tenth pick both have 80% All-Star probability, the tenth pick will be a better relative value because many more first picks make All-Star teams.\n\nThe graph below shows the All-Star probability minus the percent of players drafted in the slot that make an All-Star team for each player.\n\nhttps://i.imgur.com/Akivph3.png\n\nThe graph below sorts the difference from greatest to least.\n\nhttps://i.imgur.com/IySAp4R.png\n\nThe models love Ja Morant and Jaxson Hayes as great values. Meanwhile, the models dislike the #4 and #5 picks – DeAndre Hunter and Darius Garland.\n\nPart of the reason Morant has such a large difference is that #2 picks have an unusually low All-Star total. The table below shows the difference in All-Star probability. Notice that only 40% of #2 picks in our data set made an All-Star team, while 56% of #3 picks made one.\n\n|Pick|Player|All-Star % at pick # since 1990|Average prediction|Difference|\n--:|:--|--:|--:|--:|\n|1|Zion Williamson|0.64|0.78|0.14|\n|2|Ja Morant|0.4|0.66|0.26|\n|3|RJ Barrett|0.56|0.50|-0.06|\n|4|DeAndre Hunter|0.32|0.15|-0.17|\n|5|Darius Garland|0.4|0.23|-0.17|\n|6|Jarrett Culver|0.24|0.37|0.13|\n|7|Coby White|0.08|0.22|0.14|\n|8|Jaxson Hayes|0.2|0.45|0.25|\n|9|Rui Hachimura|0.16|0.09|-0.07|\n|10|Cam Reddish|0.12|0.23|0.11|\n\n***\n\n#Conclusion\n\nBecause predicting All-Stars is difficult and depends on more than just college stats, our models are not objectively accurate. Nevertheless, they can provide insight into the All-Star probabilities of the top-10 picks of this year’s draft.\n\nEach of the four models predicts Zion is the most likely player to make an All-Star team. Two of the models give the second spot to Morant, while two of the models give the spot to Jaxson Hayes. Relative to historical All-Stars drafted at each slot, Morant and Hayes appear to be great values, while Hunter and Garland appear poor values.\n\n***\n\n**TL;DR**: [Average predictions graph](https://i.imgur.com/c9JSRWj.png), [value above average All-Star percentage graph](https://i.imgur.com/IySAp4R.png). To see the individual values of these graphs, look at the two tables above.\n\n***\n\nThis is my newest post on my open-source basketball analytics blog, [Dribble Analytics](https://dribbleanalytics.blog).\n\nThe GitHub for the this project is [here](https://github.com/dribbleanalytics/2019-draft-ml).\n\nYou can check out the original piece [here](https://dribbleanalytics.blog/2019/07/2019-draft-ml-all-stars/).", "relevance": 0}, {"search": 2, "content": "Free web app that removes objects/people/text from photos using machine learning ", "relevance": 0}, {"search": 2, "content": "Nicolas Cage Can Now Be Put Into Any Movie in History Thanks to A Machine-Learning Algorithm ", "relevance": 0}, {"search": 2, "content": "Halo 3: Believe (Upscaled to 1080p via AI Machine Learning) ", "relevance": 0}, {"search": 2, "content": "Learn Machine Learning with machine learning.net ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "CK3 should use CK2 portraits with machine learning animation. ", "relevance": 0}, {"search": 2, "content": "[OC] Using machine learning to predict the 2019 MVP: mid-season predictions This post has a lot of graphs. If you don't want to click on each one individually, they're all in an imgur album [here](https://imgur.com/a/7SG7dQ4).\n\nThere is a tl;dr at the very end.\n\n***\n\n# Introduction\n\nWith James Harden's recent stretch, the Nuggets' success despite their injuries, and the Bucks maintaining the second seed in the NBA, Harden, Jokic, and Giannis all have strong cases for MVP this year. Though Harden hasn't had the same team success as Jokic and Giannis, he's been averaging an absurd 34.2 PPG - almost 5 PPG more than second place Steph Curry. On the other hand, Jokic has been leading an injury-riddled Nuggets team to the first seed in the West. Along the way, he's had numerous incredible all-around performances, such as Monday's 40/10/8 game against the Trail Blazers. Jokic averages the 9th most assists per game in the league, an unprecedented figure for a center. Meanwhile, Giannis has been posting a hyper-efficient 27/12/6 while leading the Bucks to the NBA's second best record. In addition to these players, Curry and Kawhi have legitimate arguments for MVP, as they've played very well for the best teams in the league.\n\nFor much of the beginning of the season, many saw Giannis as the MVP favorite. However, the race seems tighter now than ever.\n\nTo predict who will win MVP now that we're just past the season's midway point, I created various models that try to predict this year's MVP.\n\n***\n\n#Methods\n\nThis post uses very similar methods to [my post that analyzed the least and most deserving MVPs of the past decade](https://dribbleanalytics.blogspot.com/2018/08/least-most-deserving-mvps.html). Like the initial MVP post, I use a database of all players who placed top-10 in MVP voting since the 1979-1980 season (when the 3-point line was introduced). I measured the following stats for these players:\n\n| Counting stats | Advanced stats| MVP votes | Team stats |\n| ------------- | ------------- | ------------- | -------- |\n| G | WS | MVP votes won | Wins |\n| MPG | WS/48 | Maximum MVP votes | Overall seed |\n| PTS/G | VORP | Share of MVP votes* |  |\n| TRB/G | BPM | |\n| AST/G | | |\n| STL/G | | |\n| BLK/G | | |\n| FG% | | |\n| 3P% | | |\n| FT% | | |\n\n*Share of MVP votes = % of maximum votes received (so Curry's unanimous MVP is a vote share of 1).\n\nFor both this season and lockout seasons, I scaled up win shares, VORP, and wins to an 82 game season.\n\nMy initial MVP post used many of the above stats to predict vote share. The new models used in this post use fewer parameters, as several of the parameters in the previous post introduced collinearity. For example, having VORP, BPM, and MPG together is bad, as VORP adjusts BPM to MPG. For these models, I used only the following stats as parameters:\n\n| Counting stats | Advanced stats | Team stats |\n| ------------- | -------------- | ---------- |\n| PTS/G | VORP | Wins |\n| TRB/G | WS | Overall seed |\n| AST/G | | |\n| FG% | | |\n\nUsing these parameters to predict vote share, I created 4 models:\n\n1. Support vector regression (SVM)\n2. Random forest regression (RF)\n3. k-nearest neighbors regression (KNN)\n4. Deep neural network (DNN)\n\nUnlike the previous MVP post, the models were trained and tested using all data from the 1979-1980 season up until the 2017-2018 season. They then predict the MVP from this year's data. I predicted the MVP vote share for the top-10 players on NBA.com's January 11th MVP ladder.\n\n***\n\n#Where the models fall short\n\nLike we discussed in the previous MVP post, the MVP isn't determined only by who has the best stats. Because the models only know stats, they can't account for other factors that a media member considers when voting for MVP. These include:\n\n- Narrative\n- Expectations; the models don't know that the Nuggets weren't expected to be this good\n- Popularity; the models don't know that Giannis and Harden are much more popular players than Jokic\n- How someone scores their points; the models don't know that Harden shoots a lot of free throws\n- Triple doubles and other arbitrary thresholds\n\nGiven that the models can't account for these factors, one way we can think about these predictions is that I'm evaluating who has the most MVP-like stats out of the players.\n\n***\n\n#Understanding the data\n\nThe models predict the vote share for each of the players who were top-10 in MVP votes. It's important to note that most players will have a very low vote share, as there's usually only a few legitimate MVP contenders; the rest usually get some last place votes. To understand this distribution, I plotted a histogram of the vote share (see below).\n\nhttps://i.imgur.com/4KmOOgZ.png\n\nAs expected, the distribution is not normal. Most of the players had a vote share less than 0.2. This is important to consider, as a skewed dataset like this introduces more variance to the models.\n\n***\n\n#Regression analysis\n\n## Basic goodness-of-fit and cross-validation\n\nThe table below shows the r-squared and mean squared error for each of the four models. A higher r-squared and lower mean squared error indicate a more accurate model.\n\n| Model | r-squared | Mean squared error |\n| ----- | --------- | ------------------ |\n| SVM | 0.708 | 0.028 |\n| RF | 0.628 | 0.035 |\n| KNN | 0.633 | 0.035 |\n| DNN | 0.619 | 0.036 |\n\nAs with the previous MVP post, the models don't have a very high r-squared. For the most part, the models have a higher r-squared and lower mean squared error than the previous post's models, as they had more data. Though the r-squared isn't great, the mean squared is very low. In most MVP races, the winner had a vote share advantage over second place above 0.1. Therefore, because of the low mean squared error compared to the actual vote share difference, we can expect the models to be accurate in predicting the MVP.\n\nTo ensure the models aren't overfitting - or just learning the correct coefficients that yield the best results given the specific split - I performed k-fold cross-validation for r-squared. Ideally, the cross-validated r-squared will be close to the r-squared mentioned above. This would mean the models perform equally well when tested on a different split of the data. The table below shows the cross-validated r-squared scores and their 95% confidence intervals.\n\n| Model | CV r-squared | 95% confidence interval |\n| ----- | ------------ | ----------------------- |\n| SVM | 0.63 | +/- 0.10 |\n| RF | 0.50 | +/- 0.17 |\n| KNN | 0.53 | +/- 0.15 |\n| DNN | 0.57 | +/- 0.02 |\n\nAll the models have a cross-validated r-squared that's decently lower than the initial r-squared. Furthermore, the confidence intervals are wide. Therefore, it's possible the models are overfitting and may perform slightly worse on different data. However, even with these low r-squared values, the mean squared error on different datasets will not change drastically - it'll still be smaller than the usual difference between the MVP winner and second place.\n\n##Standardized residuals test\n\nA standardized residuals test analyzes the difference between the model's predicted and actual values on historical data. To pass the test, the models have at least 95% of their standardized residuals within 2 standard deviations of the mean and have no noticeable trend. Passing the standardized residuals test gives us a first indication that the models' errors are random.\n\nThe graph below shows the standardized residuals of all four models.\n\nhttps://i.imgur.com/GIpOQ9u.png\n\nOnly the RF fails the standardized residuals test. Furthermore, there is no noticeable trend. The only concerning result from the test is the high number of values greater than 2 and below -2. This indicates high variance in the models. However, it's important to note the skewed data likely contributes to this variance.\n\n##Q-Q plot\n\nWhile the standardized residuals test determines if the errors are random, a Q-Q (quantile-quantile) plot examines if the errors are normally distributed. Normally distributed errors are important because they indicate that the model will perform similarly across the entirety of a dataset. In making a Q-Q plot, we're looking for the models' residuals to be as close to a 45-degree (y = x) line as possible - that indicates a normal distribution.\n\nThe graph below is the Q-Q plot for all four models' residuals.\n\nhttps://i.imgur.com/UZ1n8CH.png\n\nThough all four models appear to have residuals pretty close to the red y = x line, there are some considerable jumps at the upper quantiles of the residuals. Each models' residuals appear to be slightly bow-shaped; they rise above the red line at the lower quantiles, fall below it in the middle, and rise again at the upper quantiles. Therefore, it's unlikely the residuals are normally distributed.\n\n##Shapiro-Wilk test\n\nTo truly determine that the residuals are normally distributed, I performed a Shapiro-Wilk test. While the Q-Q plots give a graphical representation of normality, the Shapiro-Wilk test - which returns a W-value between 0 and 1, with 1 meaning the sample is perfectly normal - gives a mathematical answer.\n\nIn addition to the W-value, the test returns a p-value. The null hypothesis of the test is that the data is normally distributed. Therefore, a p-value &lt; 0.05 means the data is not normally distributed, as we reject the null hypothesis when p &lt; 0.05.\n\nThe table below shows the results of the Shapiro-Wilk test.\n\n| Model | W-value | p-value |\n| ----- | ------- | ------- |\n| SVM | 0.94 | &lt; 0.01 |\n| RF | 0.88 | &lt; 0.01 |\n| KNN | 0.90 | &lt; 0.01 |\n| DNN | 0.97 | 0.04 |\n\nThe results confirm what we suspected from the Q-Q plot; no model returned normally distributed residuals. Though this is concerning, it doesn't invalidate the models.\n\n##Durbin-Watson test\n\nThe Durbin-Watson test examines whether the models' residuals have autocorrelation, meaning there is a self-repeating trned in the residuals. Essentially, if the models have significant autocorrelation, they're making the same mistake over and over. The test returns a value between 0 and 4, where a value of 2 indicates no autocorrelation. Values between 0 and 2 indicate positive autocorrelation, meaning if one point is higher than the previous, then the next point is likely to be even higher. Values between 2 and 4 indicate negative autocorrelation, meaning that the points are likely to have the opposite change from the previous points.\n\nThe table below shows the results of the Durbin-Watson test.\n\n| Model | DW-value |\n| ----- | -------- |\n| SVM | 1.77 |\n| RF | 1.81 |\n| KNN | 1.85 |\n| DNN | 1.69 |\n\nAll the DW-values are between 1.5 and 2, indicating there's minimal autocorrelation.\n\n##Would we benefit from more data?\n\nCurrently, the data has two limits. First, it only goes back to the 1979-80 season so that it only includes players in the 3-point era. Second, it only includes players top-10 in MVP votes, so we could gain a few more datapoints by including everyone who received MVP votes.\n\nI think the second limitation would hurt the models if removed, as it would further skew the distribution toward low vote shares. To examine if we'd benefit from more data, I plotted the learning curve for r-squared and mean squared error (MSE) for each model.\n\nhttps://i.imgur.com/cCy7ZFe.png\n\nhttps://i.imgur.com/N3Bnmch.png\n\nThe lines appear to get very close for the SVM and DNN, meaning more data is unlikely to help. However, for the KNN and RF, it's possible more data may increase the models' accuracy. Given the primary way to add data to this problem is to consider all players who received votes - which skews the data - adding more data probably won't help the models.\n\n***\n\n# Results\n\nThe 4 graphs below show each model's results. Each player's current rank in NBA.com's MVP ladder. Note that these predictions were made using data from 1/14 before the games were played.\n\nhttps://i.imgur.com/Vv1q7Fq.png\n\nhttps://i.imgur.com/3L6rZ3j.png\n\nhttps://i.imgur.com/xKj8G6e.png\n\nhttps://i.imgur.com/KDPPNw7.png\n\nAll four models have Giannis as the winner, and Harden as the runner-up. Two models have Jokic coming in third, and the other two models (which have KD and Anthony Davis in third) have Jokic in fourth.\n\nThe graph below is the average predicted vote share of the four models for each player.\n\nhttps://i.imgur.com/OsaEkpH.png\n\nThe average shows that the models have Giannis winning MVP by a decent margin. Harden also has a decent margin on Jokic.\n\n***\n\n#Conclusion\n\nThe models crown Giannis as the MVP half-way through the year. Note that the models can't account for narrative, expectations, or voter fatigue; it's purely a statistical view.\n\nThis may change soon, as Harden scored 57 points the night I ran this analysis. With Capela out for the foreseeable and the Rockets still missing key pieces in Chris Paul and Eric Gordon, it's possible Harden ramps up his already absurd scoring pace, making a strong case for MVP. I'll run the models again with new data around the All-Star break to see if Harden caught up.\n\n***\n\nThis is my newest post with my open-source basketball analytics blog, [Dribble Analytics](http://dribbleanalytics.blogspot.com). The GitHub for this project is [here](https://github.com/dribbleanalytics/ml-mvp-predict).\n\nYou can check out the original piece [here](http://dribbleanalytics.blogspot.com/2019/01/ml-mvp-predict-midseason.html).\n\n***\n\n**Tl;dr: table of results:**\n\n|Rank|NBA.com MVP ladder|SVM|RF|KNN|DNN|**Average prediction**|\n--:|:--|:--|:--|:--|:--|:--|\n|1|Giannis|Giannis|Giannis|Giannis|Giannis|**Giannis**|\n|2|Harden|Harden|Harden|Harden|Harden|**Harden**|\n|3|Curry|Jokic|Davis|Jokic|KD|**Jokic**|\n|4|Kawhi|Kawhi|Jokic|Curry|Jokic|**Kawhi**|\n|5|Jokic|KD|Curry|Kawhi|Kawhi|**KD**|\n|6|PG13|Curry|Embiid|KD|PG13|**Curry**|\n|7|Embiid|Davis|PG13|Embiid|Embiid|**Davis**|\n|8|LeBron|PG13|Kawhi|LeBron|Davis|**Embiid**|\n|9|KD|Embiid|KD|PG13|Curry|**PG13**|\n|10|Davis|LeBron|LeBron|Davis|Lebron|**LeBron**|", "relevance": 0}, {"search": 2, "content": "Let's confuse machine learning :) ", "relevance": 0}, {"search": 2, "content": "Wolverine will feature machine learning upscaling, possibly hinting at the PS5 Pro supporting this technology [**Source**](https://preview.redd.it/omhl7omm9y9c1.png?width=2100&amp;format=png&amp;auto=webp&amp;s=2493e1c47c328f038ff394fc2cf0afcdc4699bf4)\n\nThe original (potentially bogus) PS5 Pro rumor from Resetera [mentioned dedicated machine learning silicon for the purpose of AI upscaling.](https://www.resetera.com/threads/tom-henderson-ps5-pro-specs-and-release-window-details-codenamed-trinity-30wgps-18000mts-memory-speed-november-2024-target.744703/page-63?post=116078280#post-116078280) The base PS5 wouldn't be able to support AI upscaling (it lacks dedicated hardware plus it's missing the DP4a instructions found in vanilla RDNA2). \n\nThat being said, it could possibly mean neural-network texture upsampling, [which was featured in God of War: Ragnarok](https://www.gdcvault.com/play/1028824/Machine-Learning-Summit-Real-Time), but the word \"upscaling\" here seems very deliberate. I will flair this as a grain of salt regardless.", "relevance": 0}, {"search": 2, "content": "Machine Learning in a nutshell ", "relevance": 0}, {"search": 2, "content": "Upcoming ‘Machine Learning’ set - via @ShiinaBR ", "relevance": 0}, {"search": 2, "content": "Android 12 may use machine learning to fix the Back Gesture Problem ", "relevance": 0}, {"search": 2, "content": "Using Machine Learning to Find Modern Goalkeepers in Europe Last thursday's debacle appeared to be the nail in the coffin for David De Gea. At least from a fan's perspective. The reality is, we will never be able to reach the recent heights that Manchester City and Liverpool have reached, without a playmking goalkeeper.\n\nIt is extremely clear that ETH wants us to build from the back more, but this process is impeded by DDG's on the ball abilities. So I decided to use some simple machine learning algorithms to try to seeth through all the goalkeepers in the top 5 leagues, and identify viable, playmaking GK targets.\n\nAll data comes from: [https://fbref.com/en/comps/Big5/keepersadv/players/Big-5-European-Leagues-Stats](https://fbref.com/en/comps/Big5/keepersadv/players/Big-5-European-Leagues-Stats)\n\n## The Metrics\n\nBefore I go into the metrics used, let me clarify something. On all my charts, I want the high value to mean \"good.\" However, some values, like \"Avg Length of Pass\" are \"good\" when they're smallest - as this would indicate a GK's tendency to play shorter passes. So I've reversed those values on the charts so that a high value still means good. This is why some variables, (listed below) start with the prefix \"Rev.\" Note also that all values on the charts have been standardized (scaled to be between 0 and 1.)\n\nIf this is too confusing, just remember this - on the charts, the higher the value looks, the \"better\" it is for that metric for a playmaking GK.\n\nI will evaluate playmaking keepers based on 8 metrics, listed below. All stats per 90.\n\n* **Passes\\_Att**: The number of passes attempted, not including GK.\n* **Rev\\_Goal Kicks\\_AvgLen**: The average length of a Goal Kick pass.\n* **Rev\\_Goal Kicks\\_Launch%**: The percentage of Goal Kicks that were launched (passes greater than 40 yards).\n* **Rev\\_Passes\\_AvgLen**: The average length of a **Non** Goal Kick pass.\n* **Rev\\_Passes\\_Launch%**: The percentage of **Non** Goal Kicks passes that were launched (passes greater than 40 yards).\n* **Sweeper\\_AvgDist**: The average distance from goal in all defensive actions.\n* **Sweeper\\_#OPA**: Defensive actions outside of the penalty area.\n* **Crosses\\_Stp%**: Percentage of crosses in the penalty area that were successfully stopped by the GK.\n\n## The Problem\n\n## Far from the Elite\n\nSo let's see how DDG compares to two of the best playmaking goal keepers, Alisson and Ederson. Note that I'm not doing this to harp on DDG. I just want to show how these metrics really are reflective of playmaking GKs, and establish a foundation for what we need to look out for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p39rkwsgeava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=290ba99e6e2ff9bfc41485a4015c00f025c0b2b8\n\nTo the surprise of absolutely no one, Alisson and Ederson far outperform DDG in all metrics. They play more passes per game, shorter passes both from goal kicks and open play, launch a much smaller percentage of both goal kicks and open play passes (suggesting a higher tendency for short passes.) They are also both better sweeper keepers, although Alisson is a much better sweeper keeper than Ederson. But they both have very good command of their penalty box.\n\n## Inability to Build up from Goal Kicks\n\nNow, it feels a little unfair to compare him to two of the best playmaking GKs, so let's compare him to the average keeper across the top 5 leagues.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/uguu9tyheava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=171f157e6150c57e3231d2bed644701de23a63e3\n\nSo there are a lot of things that are bad here. Overall, he's basically worst than the average GK in all the top 5 leagues. But there are certain areas that are more important that others. He's slightly above average in open play passes, but when it comes to goal kicks, he's far worst than the rest.\n\nThis essentially means that we end up launching most of our goal kicks, which takes away from our inability to play from the back. Notice also how his passes attempted are very low, suggesting that he has very minimal involvement in the build up.\n\n## Takeaway\n\nOkay so, now, hopefully, you will trust that those metrics are indicative of playmaking GK. And understand what we are really missing with DDG. So time for the machine learning to come in.\n\n## Clustering Analysis.\n\nSo, we will use a very basic clustering analysis here, called K-means. I'm not going to go in the details of the algorithm or other steps that I took to run it, but at a high level, K-means is an algorithm that finds clusters of goalkeepers with similar abilities.\n\nThe goal is that one of those clusters comprises of goalkeepers with good playmaknig attributes, like Alisson and Ederson. And then, we can do a deep dive into goalkeepers within that cluster to find out who we should be targetting.\n\n## Visualizing Clusters\n\nThe analysis found 4 clusters in the data, i.e., 4 \"types\" of goal keepers based on their playmaking attributes. One way to visualize it is to use a method called PCA that can essentially reduce all of our 8 attributes into 2, and then visualize the groups by plotting the two newly created attributes:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1yrgy4sjeava1.png?width=571&amp;format=png&amp;auto=webp&amp;s=4ae9fa661b1e03729590b2bdbaa89489907c9295\n\nEach dot in the plot above represents a goalkeeper. The 2 axes are essentially a combination of the 8 variables we started with. So goalkeepers that are close together on both axes, are goalkeepers that share similar playmaking attributes. Here, we can see four groups that our clustering algorithm has identified.\n\n## Describing the Clusters\n\nNow, let's look at the individual goalkeepers within the clusters, and get an average of playmaking stats for each cluster. This will tell us what the clusters really represent.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zgo6yq2leava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=b07145c031bc03c3e51dc4c93bcddc7d4affe828\n\nThe chart above represents the average metric for each goalkeeper in a given cluster. Let's go through them one at a time\n\n* **Cluster 0**: This is the blue cluster that's barely visible because it is so small. This is essentially a cluster where all goalkeepers are bad playmakers on all front, and bad sweepers.\n* **Cluster 1**: The red cluster here is by far and away the best cluster. This is the group of goal keepers with the best playmaking abilities, and also goalkeepers with good sweeping abilities\n* **Cluster 2**: Good sweepers, bad playmakers. GKs in this cluster have good sweeping attributes, but are typically really bad playmakers.\n* **Cluster 3**: Average playmakers, bad sweepers. This is the one DDG is in, but he's a worst playmaker than most in that group.\n\n## Targets from Optimal Clusters\n\nThere is clearly one cluster that is optimal here, Cluster 1. So, I took a look at the GKs in cluster 1 and identified realistic targets. First, I removed any unrealistic GK. As you can imagine, Ederson and Alisson were in this group, so the likes of them are not considered realistic.\n\nI put a filter on age - seeing as we should be rebuilding for the future. I only consider GKs who are 30 years old or younger. Lastly, we also want our GK to be good shot stoppers, so I used the PSxGA metric, which is essentially a number that summarizes a GK ability to stop shots. Positive numbers suggest better luck or an above average ability to stop shots. So I filetered the cluster for only positive values of that metric. Below are the identified targets, including DDG as a reference point:\n\n||Player|Squad|Age|Expected\\_/90|Passes\\_Launch%|Passes\\_AvgLen|Goal Kicks\\_Launch%|Goal Kicks\\_AvgLen|Crosses\\_Stp%|Sweeper\\_#OPA|Sweeper\\_AvgDist|Passes\\_Att|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|27|Ivan Provedel|Lazio|29|0.12|28.8|33|35.4|34.7|4.1|1.51|16.6|29.9|\n|46|Brice Samba|Lens|29|0.12|34.3|32.7|26.2|29.3|7.3|1.23|16.7|29.2|\n|22|Gregor Kobel|Dortmund|26|0.09|21.7|29.4|42.5|37.8|4.9|1.57|17.3|32.7|\n|59|Alex Meret|Napoli|26|0.04|14.9|26.2|20.6|27.1|3.4|1.07|17|22|\n|75|David de Gea|Manchester Utd|33|\\-0.08|31.6|31.6|65.5|48.3|3|0.83|14.5|27.1|\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wg0ah87oeava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=80d629ac65c78ac643aa68fd27dc282003ce8002\n\nNow, I don't actually know anything about these goalkeepers, I'm just a numbers guy. That being said, they statistically look like better and more modern GKs than DDG. They all have far superior playmaking abilities and sweeping abilities.\n\n## Targets from Sub-Optimal Clusters\n\nWe're not done quite yet. There was one more cluster that I described as \"Decent playmakers, bad sweepers.\" Now, the cluster overall may be so, but some GKs in there might be on the upper end of the range in given metrics. They may be good playmakers and below average sweepers.\n\nI won't lie, this part of the analysis was a lot of eye balling, but nonetheless, here are 3 other GK who are better open play playmakers than DDG, but not necesasrily better sweepers:\n\n||Player|Squad|Age|Expected\\_/90|Passes\\_Launch%|Passes\\_AvgLen|Goal Kicks\\_Launch%|Goal Kicks\\_AvgLen|Crosses\\_Stp%|Sweeper\\_#OPA|Sweeper\\_AvgDist|Passes\\_Att|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|55|Yehvann Diouf|Reims|24|0.29|29.7|32.3|32.9|33.8|9.3|1.13|12.7|27.3|\n|101|Anthony Lopes|Lyon|33|0.08|32.2|32.4|31.1|32.4|5.5|0.58|12.7|24.6|\n|84|Michele Di Gregorio|Monza|26|0.05|30.5|32.4|35.3|33.4|3.1|0.72|12.4|32.8|\n|75|David de Gea|Manchester Utd|33|\\-0.08|31.6|31.6|65.5|48.3|3|0.83|14.5|27.1|\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l9muet1peava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=13f33e56a921520cbeafd01c326db0780cfd77a0", "relevance": 0}, {"search": 2, "content": "TikTok is now using machine learning for certain filters (e.g. \"Bold Glamour\") making them even harder to distinguish. ", "relevance": 0}, {"search": 2, "content": "Is machine learning really machine learning? I have been asked if machine learning is machine learning or machine learning is machine learning. I will take the view that there is no such thing as machine learning. \n\nMy point is, machine learning is a way of making machine learning. That is, machine learning is a very limited set of concepts. If you have machine learning or machine learning is machine learning then you have machine learning and machine learning are two different things. \n\nI am not saying machine learning is not machine learning, but it is not machine learning.", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning: Machine Learning, Machine Learning, Machine Learning ", "relevance": 0}, {"search": 2, "content": "forThatWeUsedANeuralNetworkButWhatIsMachineLearning ", "relevance": 0}, {"search": 2, "content": "Machine learning drugs ", "relevance": 0}, {"search": 2, "content": "/u/ptitz learns some hard truths about Machine Learning. ", "relevance": 0}, {"search": 2, "content": "I created a complete overview of machine learning concepts seen in 27 data science and machine learning interviews Hey everyone,\n\nDuring my last interview cycle, I did 27 machine learning and data science interviews at a bunch of companies (from Google to a \\~8-person YC-backed computer vision startup). Afterwards, I wrote an overview of all the concepts that showed up, presented as a series of tutorials along with practice questions at the end of each section.\n\nI hope you find it helpful! [ML Primer](https://www.confetti.ai/assets/ml-primer/ml_primer.pdf)", "relevance": 0}, {"search": 2, "content": "Realistic faces of Roman emperors recreated using machine learning by digital artist Daniel Voshart ", "relevance": 0}, {"search": 2, "content": "Machine learning went wrong? ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}]