[{"search": 0, "content": "r/politics being... Well, r/politics ", "relevance": 0}, {"search": 0, "content": "What non-political opinion gives away someone's politics? ", "relevance": 0}, {"search": 0, "content": "r/politics is f****** trash  \n\nI swear to god that sub is so toxic. They claim to be 'non-biased' and 'on the fence', While being the most biased people ever. Most popular posts consist of a misleading title, a dumb article, and the most biohazardous comment section ever. People on Reddit literally cannot hold a civil debate without screeching at each other. I also seemed to notice that they love downvoting other opinions to oblivion and even censoring them. It's the most 'orange man bad' sub I've ever seen. It's literally worse than actually dedicated subs. I know this will be downvoted to hell, but it's my opinion, so please respect it. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm sorry if the formatting is off, English isn't my first language.\n\nUpdate: holy shit my inbox’s Asshole is ripped. I just wanted to say that I’m not trying to take sides here. Both parties are guilty of being toxic. Also, I’m not even a trumpie. I should have written this better so it’s not misleading.", "relevance": 0}, {"search": 0, "content": "Politics in pods I am only on ep 3 but I had to chuckle to myself when Jeramey asked Sarah Ann where she stood on politics. After last season with JP, the topic of couples discussing politics came up a lot in this sub, and it was noted how it’s never actually shown on the episodes, but of course, we could assume those things were discussed before marriage. I just thought it was funny it was shown this season. We see you lurking, LIB producers 👀 👋🏼", "relevance": 0}, {"search": 0, "content": "CMV: R/Politics Should Be Renamed  The default political sub, [r/politics](https://www.reddit.com/r/politics/), should be renamed to something to demonstrate the political bias of the sub. It is not a sub for politics, it is a sub for one side of politics. There is not legitimate political discourse because the subreddit is significantly biased, as are the moderators, and they moderate based on said bias. I have no problem with political subs existing with a specific bias. I just take issue that the sub advertised as the subreddit of default politics does not allow discussion of broad politics-only discussion of broad politics from one side.", "relevance": 0}, {"search": 0, "content": "How do honest people navigate office politics? After 2.5 years of this crap, I'm finally on the verge of being fired/laid off or whatever the next step is before that. I can tell it from how my manager has been treating me the past few months or so (I have not had any 1-on-1's with him for several months now AND hes been excluding me from trainings that all other team members who've been with the company under 2 years are being explicitly mentioned to be invited to). The team leader directly leading me on my immediate team hardly assigns me work anymore and minimizes his interactions with me specifically just to receive updates. Outside of my team, other coworkers don't really interact with me. I'm not really invited to meetings outside of team meetings. With the other engineers who are in the same YOE as I am, they're typically very passive aggressive towards me, saying stuff like \"wow, see &lt;other coworker's name&gt;, I told you that &lt;my name&gt; was doing important work. Wow, very cool!\" and the other coworker would interject with another snide comment and they're using a sarcastic tone of voice. I can recall MANY instances in our internal team meetings where my manager or another manager or even my team lead is saying \"hey, lets not be open about certain details/issues when we have our meetings with other people from departments\". And I'm someone who sort of let it slide.\n\nWhen I recall the internship I did before this job, it was even more toxic. Coworkers who weren't afraid to show me that they hated me, would immediately act nice and helpful when management was around and observing. I could recall that I was used for other people's benefit, whether that was my former manager trying to manipulate one of my coworkers or a coworker trying to look like he was being helpful to me when he offered his contact information during my exit out of my internship. Theres so many toxic people in the professional world.\n\nI hate not being honest especially around the issues at work. Its really tiring. When I reflect on how my dad, who is a retired mechanic, transitioned from working under other people in their auto shops to renting out his own autoshop and working as an independent mechanic, it kind of makes sense. My dad is a really honest guy who genuinely likes helping other people. But, the fucking work industry is full of snakes who bully/sabotage other people to get ahead. Really, theres no place for people like me here. I am at my most peaceful when I'm alone.", "relevance": 0}, {"search": 0, "content": "What is the best/biggest office politics lesson you have learned in life? I learnt to always get things in writing to be on the safer side, and never trust your line manager with your issues as they might use them against you.", "relevance": 0}, {"search": 0, "content": "What is/what are some examples of office politics/drama? I never understood this.  I have always never intimated any drama/negative talk about employees at work and played neutral at jobs/was positive to everyone.  \nI would like to hear about some real life stories and examples that seem minor, but happen frequently.  I feel naive to this world at 28f having never really experiencing it and have had many different jobs.", "relevance": 0}, {"search": 0, "content": "“Politics” ", "relevance": 0}, {"search": 0, "content": "Helldivers getting political ", "relevance": 0}, {"search": 0, "content": "Political trolley ", "relevance": 0}, {"search": 0, "content": "Was told not to put my political beliefs on my resume. Is this political? I  just failed a job interview yesterday. The guy seemed a bit hostile and basically took all my responses in the worst light. I've seen that before. He already picked who he wanted but was obligated to finish the rest of the interviews. Fine, whatever, I've dealt with that before.\n\nBut what gets me is that going over my resume, he gets to the point where I say that I am fully vaccinated against covid-19.  This is for a retail position so I feel it's relevant.  But he gets there and tells me 'Here's a tip, don't announce your political leanings on your resume. No-one with any sense will hire you if you announce it.' (Paraphrasing I don't recall the exact wording)\n\nAgain it's a retail job, it seems to me like very relevant information.  But just in case should I remove that from my resume?\n\nEDIT: Thanks for all the answers y'all. I have removed the detail from my resume as the majority reccomends, and I'm glad many understand why I had it on there in the first place.  Got another interview at another place nearby shortly after I posted this and that interview went much better.  Closer place too, still waiting on background check but they basically hired me on the spot.\n\nThanks for the advice everyone!", "relevance": 0}, {"search": 0, "content": "Flags not politics ", "relevance": 0}, {"search": 0, "content": "Politics Guy 🪱 ", "relevance": 0}, {"search": 0, "content": "Plantation politics ", "relevance": 0}, {"search": 0, "content": "Politics ", "relevance": 0}, {"search": 0, "content": "Political statement  ", "relevance": 0}, {"search": 0, "content": "Politics? I don't see any politics. Do you see any politics? ", "relevance": 0}, {"search": 0, "content": "Conservative Politics ", "relevance": 0}, {"search": 0, "content": "Polite catcalling ", "relevance": 0}, {"search": 0, "content": "anime political dub ", "relevance": 0}, {"search": 0, "content": "Brave Enough for Politics vs Ignorance of Political Definitions ", "relevance": 0}, {"search": 0, "content": "Something is wrong with American politics ", "relevance": 0}, {"search": 0, "content": "Something non political ", "relevance": 0}, {"search": 0, "content": "A Polite Douchebag? So I'm somewhat new to shopping, been doing it about 2 months now and this is the first bad interaction I've had, was just wondering if I was being condescending or rude in any capacity so I can talk to customers better.\n\nIm missing one screenshot of the conversation but I informed the customer they were out of this certain deli cut I'm unfamiliar with so I asked an associate and he reccomended these two items(first picture) as he said he can't get what the customer requested. This was at 11:38am so I could give the customer plenty of time to respond as they preferred text.\n\nThis is where in wondering if I was in the wrong, I go through the entire order and never hear back and usually when that happens I just continue on with my order and I did so. At 12:20pm when I was delivering the order she then responded(40min after my text) said the replacement was fine and to contact her. I informed her I already delivered the items and left the store about 15 minutes prior to her text.\n\nShe then immediately says she's pissed, asked for a number for management, and then called me polite and a douchebag at the same time after trying to inform her on prefer text/call.\n\nCould I have done anything different? I immediately contacted the support so I could keep the tip and dodge an incoming bad rating which did get removed.", "relevance": 0}, {"search": 0, "content": "“Politics before country” Problem with this is if you focus on politics too much you end up with no country", "relevance": 0}, {"search": 0, "content": "“Politics.” ", "relevance": 0}, {"search": 0, "content": "Punk is too political ", "relevance": 0}, {"search": 0, "content": "non political political meme ", "relevance": 0}, {"search": 0, "content": "DON CHEADLE POLITICAL?! ", "relevance": 0}, {"search": 0, "content": "Politely beaten ", "relevance": 0}, {"search": 0, "content": "Global politics are in good hands ", "relevance": 0}, {"search": 0, "content": "It's all politics ", "relevance": 0}, {"search": 0, "content": "American Politics are cool ", "relevance": 0}, {"search": 0, "content": "The American Politics Trolley Problem ", "relevance": 0}, {"search": 0, "content": "Gender politics ", "relevance": 0}, {"search": 0, "content": "US politics ", "relevance": 0}, {"search": 0, "content": "Punk Has Always Besn Political, SMH ", "relevance": 0}, {"search": 0, "content": "Elder Scrolls Politics &gt; Real Life Politics ", "relevance": 0}, {"search": 0, "content": "Political tattoos, definitely a good idea. ", "relevance": 0}, {"search": 0, "content": "Political Journey[OC] ", "relevance": 0}, {"search": 0, "content": "Neocon now uncomfortable with religion in politics. ", "relevance": 0}, {"search": 0, "content": "Political Discourse ", "relevance": 0}, {"search": 0, "content": "reasons why religion and politics need to be seperated ", "relevance": 0}, {"search": 0, "content": "to use political influence ", "relevance": 0}, {"search": 0, "content": "No politics on this sub ", "relevance": 0}, {"search": 0, "content": "Unsurprisingly, the whole border fiasco is cynical politics at play. ", "relevance": 0}, {"search": 0, "content": "political pizza ", "relevance": 0}, {"search": 0, "content": "video games are political now smh ", "relevance": 0}, {"search": 0, "content": "anime political dub ", "relevance": 0}, {"search": 0, "content": "Legally protected political satire! ", "relevance": 0}, {"search": 0, "content": "Politics shouldn't be team sports ", "relevance": 0}, {"search": 0, "content": "Fuck /r/politics, all my homies hate /r/politics ", "relevance": 0}, {"search": 0, "content": "cursed political statement ", "relevance": 0}, {"search": 0, "content": "political dub ", "relevance": 0}, {"search": 0, "content": "VIRGIN U.S politics 🤢🤢🤢 vs CHAD Indian politics 😎👍😎👌 ", "relevance": 0}, {"search": 0, "content": "anon figures out American politics ", "relevance": 0}, {"search": 0, "content": "Neil Gaiman on political correctness ", "relevance": 0}, {"search": 0, "content": "MAGA: Punk is political? ", "relevance": 0}, {"search": 0, "content": "Actually,politics is a good thing and politics i don't like is agenda😤 ", "relevance": 0}, {"search": 0, "content": "Politics of Unchilding https://www.tumblr.com/veetuku-ponum/742568085613051904?source=share", "relevance": 0}, {"search": 0, "content": "American political victory ", "relevance": 0}, {"search": 0, "content": "Political Compass Political Compass ", "relevance": 0}, {"search": 0, "content": "American Politics ", "relevance": 0}, {"search": 0, "content": "Politics Politics Politics Roggies is the man, but I haven't been able to listen to a full episode since covid. I've never posted or commented about it and I just thought it's not my cup of tea anymore and he can do what he wants, it's a free podcast after all and he never tells anyone to listen or promotes it which is fair. \n\nI just wanted to see if anyone shares my sentiment? I do sincerely think that he wasn't a political guy before and he was genuinely curious but as the cast got bigger, I think politics found him and he has since become quite bullish on his ideas. Since the Bernie episode + Covid + moving to Texas + money I think the gravity around him got too dense and I don't blame him. \n\nI do remember his point on politics before was 'It's a weird system anyway no one can be trusted, and no one person should be running the country it should be a team of people'. I always liked this take because I felt it was a genuine idea and he never tied himself to a side (being true to the comedian who just likes to talk about cool shit). and the point would last 2-5 minutes and then conversation would flow again.  After covid he started complaining of sides and then clearly picked one, I think he has unknowingly become what he is complaining about before. He preaches on episodes, Biden is worked into every episode, and he clearly gets off talking about cancel culture, I think he would be more upset if cancel culture went away because he wouldn't have anything to talk about (he literally just does the same thing but on the other side and repeats his points non-stop). \n\nIdk, I just wanted to see if I'm the only one because he is clearly still the number 1 podcast in the world and every episode is marked as 'most shared'. Obviously, people change (I've been listening since episode 300) so I don't mind growth, but the episodes have not been fun to listen too... Tell me why I'm wrong though I'd love your opinions. ", "relevance": 0}, {"search": 0, "content": "When politics = personality….. ", "relevance": 0}, {"search": 0, "content": "Getting political ", "relevance": 0}, {"search": 0, "content": "Russian Politics = U.S. Republican Politics in 2024 ", "relevance": 0}, {"search": 0, "content": "Very polite slaps ", "relevance": 0}, {"search": 0, "content": "Finnish political cartoon ", "relevance": 0}, {"search": 0, "content": "Friendship beats politics ", "relevance": 0}, {"search": 0, "content": "Far Political Leanings ", "relevance": 0}, {"search": 0, "content": "keep your modern politics away uj/ don't remake it but for a far sinister reason also quina my beloved", "relevance": 0}, {"search": 0, "content": "Politics. Politics never changes. ", "relevance": 0}, {"search": 0, "content": "to think American Idiot was not about politics. ", "relevance": 0}, {"search": 0, "content": "Science v Politics v Religion ", "relevance": 0}, {"search": 0, "content": "Rich mids with political power ", "relevance": 0}, {"search": 0, "content": "I don't care about politics. Me after drinking a cup: ", "relevance": 0}, {"search": 0, "content": "The English are polite, not nice ", "relevance": 0}, {"search": 0, "content": "Political ", "relevance": 0}, {"search": 0, "content": "Everything is political persecution ", "relevance": 0}, {"search": 0, "content": "The good old days of 2008 before politics was invented  ", "relevance": 0}, {"search": 0, "content": "US politics explained ", "relevance": 0}, {"search": 0, "content": "A rarity in politics ", "relevance": 0}, {"search": 0, "content": "Conservative Politics ", "relevance": 0}, {"search": 0, "content": "Demonic Politics. ", "relevance": 0}, {"search": 0, "content": "A recent political cartoon ", "relevance": 0}, {"search": 0, "content": "bit ooc for me to post america politics but ", "relevance": 0}, {"search": 0, "content": "Egypt political compass ", "relevance": 0}, {"search": 0, "content": "Politically-engaged Redditors tend to be more toxic -- even in non-political subreddits ", "relevance": 0}, {"search": 0, "content": "Put aside politics, Christ is risen! ", "relevance": 0}, {"search": 0, "content": "Colorado politics? ", "relevance": 0}, {"search": 0, "content": "Political compass on satire ", "relevance": 0}, {"search": 0, "content": "Politics rule ", "relevance": 0}, {"search": 0, "content": "Two genders: Male and political. Two races: White and political. Two sexual orientations: Straight and political. You get the idea. ", "relevance": 0}, {"search": 0, "content": "I'm not big into politics but why man ", "relevance": 0}, {"search": 0, "content": "Trans candidate for Transphobic Political Party surprised to find Political Party is Transphobic ", "relevance": 0}, {"search": 0, "content": "Western Europe Political Compass ", "relevance": 0}, {"search": 0, "content": "Too political? ", "relevance": 0}, {"search": 0, "content": "Gender politics is getting way out of hand. In California there is a bill that that would allow cps to take children away from their parents in the case of custody disputes if they do not affirm the child's gender. That bill is [abs-957](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB957)\n\nIn Texas there is a bill that defines allowing your children to receive gender affirming care as child abuse. The governor has directed cps to investigate parents who offer it. That bill is [sb-1646](https://capitol.texas.gov/tlodocs/87R/billtext/pdf/SB01646I.pdf#navpanes=0)\n\nThis is insanity and politicians from both sides should be ashamed at playing with people's families like this over their own politics. I personally think it's a horrible idea in most cases to transition children but in a small amount of cases it may be the right thing to do. Only the parents can adequately make this distinction.\n\nGender politics doesn't give you the right to break up families. It doesn't matter if you're right or left.", "relevance": 0}, {"search": 1, "content": "SolanaFloor becomes the top Solana News source online 14,000,000 🚀\n\nSolanaFloor hit 14 million social impressions in January making it the top Solana news source online. \n\nJust the beginning - more insights ahead. Big thanks to our Solana family🌟\n\nTwitter: https://x.com/solanafloor/status/1753494826476089849?s=46\n\nWebsite: https://solanafloor.com/", "relevance": 0}, {"search": 1, "content": "¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡SOLANA NEWS CRYPTOS¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ Do you know of any website where the projects that are going to be created in solana can be seen in real time?", "relevance": 0}, {"search": 1, "content": "Breaking news: Solana having a partnership with McDonalds ", "relevance": 0}, {"search": 1, "content": "Solana News: WEN JUP, Token Extensions, Solana Mobile Two, Magic Eden Rewards ", "relevance": 0}, {"search": 1, "content": "Solana News: $122 Million in Solana Projected to be Sold as Part of the Dump has been Staked ", "relevance": 0}, {"search": 1, "content": "Introducing Crypto Reddit on Solana ($CR) - Your Go-To Destination for Solana News and Memes!  \n\nHey Solana enthusiasts and crypto lovers!\n\nWe're thrilled to announce the launch of a brand-new community dedicated solely to the Solana ecosystem - **Crypto Reddit on Solana ($CR)**. As we navigate through the ever-evolving world of cryptocurrency, Solana has emerged as a powerhouse, and it's high time we had a space focused on celebrating and sharing everything Solana.\n\n**What Can You Expect?**\n\n* **Exclusive Solana Memes:** Laughter is key to enjoying the crypto journey, and what better way to share a laugh than through memes? Dive into a treasure trove of Solana-related memes that will keep you entertained and informed.\n* **Latest Solana News:** Stay up-to-date with the latest happenings in the Solana ecosystem. Whether it's project launches, updates, or critical discussions, you'll find it all here.\n* **A Vibrant Community:** Join fellow Solana supporters in discussing developments, sharing insights, and exploring the potential of Solana. Whether you're a seasoned investor or new to the scene, there's a place for you here.\n* **$CR Token:** Unique to our community, the $CR token represents more than just membership. It's an opportunity to be part of something bigger, offering benefits and rewards within our ecosystem.\n\n**Why Join Us?**\n\nCrypto Reddit on Solana ($CR) isn't just another crypto community. It's a space crafted with the passion for Solana at its core, designed to foster engagement, knowledge sharing, and a bit of fun along the way. Whether you're here for the memes, the news, or the discussions, you'll find a welcoming community ready to embark on this Solana journey together.\n\n**How to Get Involved?**\n\nJoining is easy! Just subscribe to our community, participate in the discussions, and don't forget to share your favorite Solana memes. We're also keen to hear your ideas on how to grow this community and make it your go-to Solana hub.\n\n&amp;#x200B;\n\nTG: [https://twitter.com/CRSolana](https://twitter.com/CRSolana)\n\n&amp;#x200B;\n\nLet's make Crypto Reddit on Solana ($CR) the ultimate destination for Solana enthusiasts. See you there!", "relevance": 0}, {"search": 1, "content": "Week in Solana News: February 4th - 10th, 2024 ", "relevance": 0}, {"search": 1, "content": "Huge News For Solana! ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 7-13, 2024 ", "relevance": 0}, {"search": 1, "content": "Solana News Rewind: The Biggest Moments in 2023 Explore the transformative year of SOL in our Solana news rewind, witnessing a renaissance marked by Bonk (BONK) mania, the rise of Solana DeFi 2.0, and more. \n\n[https://blockchainreporter.net/solana-news-rewind-the-biggest-moments-in-2023/](https://blockchainreporter.net/solana-news-rewind-the-biggest-moments-in-2023/)\n\nhttps://preview.redd.it/hw5zux47t79c1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=89707f95c5b9ca065111b50a2ce28e29009a03b0", "relevance": 0}, {"search": 1, "content": "SolanaNews.org - Weekly News from December 17 - 23, 2023 ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "Phantom featured in \"Week in Solana News\" ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 1 - 6, 2024 ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "SOLANA Crypto | What are the Reasons of Solana`s unstoppable RISE !? Solana NEWS &amp; Price Prediction ", "relevance": 0}, {"search": 1, "content": "All Solana News from the Week in One Video ", "relevance": 0}, {"search": 1, "content": "Today's Solana News * Bitcoin's Uptime and Solana's Outages: Analyzing Their Impact on Adoption\n   * [https://solanafloor.com/news/bitcoins-uptime-and-solanas-outages-analyzing-their-impact-on-adoption](https://solanafloor.com/news/bitcoins-uptime-and-solanas-outages-analyzing-their-impact-on-adoption)\n* Top Coins to Stake on Solana: Exploring the Best Options for High Yields\n   * [https://solanafloor.com/news/the-best-coins-to-stake-on-solana](https://solanafloor.com/news/the-best-coins-to-stake-on-solana)\n* ETH User Spends $120k For Gas on One Transaction: Not Possible on Solana\n   * [https://solanafloor.com/news/eth-user-spends-120k-on-gas](https://solanafloor.com/news/eth-user-spends-120k-on-gas)\n* Firedancer Unveils fd\\_quic: A High-Performance Implementation of QUIC and Solana Transaction Ingest Network Protocols\n   * [https://solanafloor.com/news/firedancer-unveils-fd\\_quic-a-high-performance-implementation-of-quic-and-solana-transaction-ingest-network-protocols](https://solanafloor.com/news/firedancer-unveils-fd_quic-a-high-performance-implementation-of-quic-and-solana-transaction-ingest-network-protocols)\n* Meme Coin Trading Volume Skyrockets, Reaching Two-Year High\n   * [https://solanafloor.com/news/meme-coin-trading-volume-skyrockets-reaching-two-year-high](https://solanafloor.com/news/meme-coin-trading-volume-skyrockets-reaching-two-year-high)\n* Bitcoin Active Addresses Plummet to Two-Year Low as Solana Outperforms\n   * [https://solanafloor.com/news/bitcoin-active-addresses-plummet-to-two-year-low-as-solana-outperforms](https://solanafloor.com/news/bitcoin-active-addresses-plummet-to-two-year-low-as-solana-outperforms)", "relevance": 0}, {"search": 1, "content": "Exciting Updates From Xen Crypto: Pulsechain Daytona Finance &amp; Solana News ", "relevance": 0}, {"search": 1, "content": "Lighthouse seeks to stop wallet drains on Solana #News #Technology #Tech #Grafa ", "relevance": 0}, {"search": 1, "content": "Today's Solana News * Helium Foundation Offers Grant Program for Proposals on Understanding Network Performance with Solana Migration\n   * [https://solanafloor.com/news/helium-foundation-offers-grant-program-for-proposals-on-understanding-network-performance-with-solana-migration](https://solanafloor.com/news/helium-foundation-offers-grant-program-for-proposals-on-understanding-network-performance-with-solana-migration) \n* Solana Saga Mobile Phone Now Available for Public Orders: A New Era of Web3.0 Adoption\n   * [https://solanafloor.com/news/solana-saga-mobile-phone-now-available-for-public-orders-a-new-era-of-web3-0-adoption](https://solanafloor.com/news/solana-saga-mobile-phone-now-available-for-public-orders-a-new-era-of-web3-0-adoption)\n* Conjure Your Masterpiece: Tomb Stoned's AI Art Generation Tool\n   * [https://solanafloor.com/news/conjure-your-masterpiece-tomb-stoneds-ai-art-generation-tool](https://solanafloor.com/news/conjure-your-masterpiece-tomb-stoneds-ai-art-generation-tool)\n* ANS Protocol: A New Name Service Revolutionizing Domain Creation on Solana\n   * [https://solanafloor.com/news/ans-protocol-a-new-name-service-revolutionizing-domain-creation-on-solana](https://solanafloor.com/news/ans-protocol-a-new-name-service-revolutionizing-domain-creation-on-solana)", "relevance": 0}, {"search": 1, "content": "Week in Solana News - November 19-25, 2023 ", "relevance": 0}, {"search": 1, "content": "🌬 Brand New Solana Token: SOL100 | Stealth Sale | Collectible 🧸 | Rare | BSC tokens are old news, Solana is the future 📣 Ok anon,\n\n[**Today we're going to learn about SOL100.**](https://sol100.io)\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\n[SOL100 is a Solana token, and not a BSC token. This is rare on reddit due to the \"monkey see, monkey do\" hive mind - particularly surrounding BSC. It's a BSC meme coin circlejerk around here.](https://sol100.io)\n\n[The way of the future is tokens on platforms like Solana, Cardano, Polkadot, etc.](https://sol100.io)\n\n[Not necessarily BSC.](https://sol100.io)\n\n[One such brand new Solana Token is SOL100. Here's some info.](https://sol100.io)\n\n\\------------------------------------\n\n✨ Collectible &amp; Rare\n\n✨ Only 100 token created\n\n✨ No new tokens can be minted\n\n✨ Fair launch by a western team\n\n✨ IDO nearly sold out\n\n✨ Only $5,700 worth of IDO priced tokens ($1k/SOL100) remain at the time of writing\n\n\\------------------------------------\n\nWebsite: [https://sol100.io](https://sol100.io) (Which you may have noticed, as this entire post is a link.)\n\nTelegram: [https://t.me/sol100token](https://t.me/sol100token) and [https://t.me/sol100trading](https://t.me/sol100trading)\n\n\\------------------------------------\n\nHere is some misc. information from the website.\n\n[Introducing SOL100 - a scarcity token powered by the Solana blockchain. Inflationary cryptocurrencies and crypto-fiats stray from Bitcoin and from long-term sustainability. SOL100 is more or less a clone of 42-coin, an old proof-of-work project, but with much more practicality and usability.](https://sol100.io)\n\n[Pushing upwards of 50,000 transactions per second, Solana provides a sandbox enabling SOL100 the longevity necessary for it to become a mainstream store of value.](https://sol100.io)\n\n[We are a team of programmers and venture capitalists from across the world. With over 300 years of combined experience. We anticipate witnessing decentralized, community fostered growth of the SOL100 ecosystem.](https://sol100.io)\n\n\\------------------------------------\n\n🌕 Moon Fundamentals 🌕\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\n🚀 70% of tokens sold to the public\n\n🚀 Each token sold at $1,000 a piece\n\n🚀 Only a $100k initial market cap\n\n🚀 Almost sold out (Only $5,700 worth left at the time of writing)\n\n🚀 20x - 100x potential\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)\n\nTL;DR HODL SOL100 or die in hopeless poverty. This one is an absolute gem. 20x - 100x potential easily. Solana tokens are the next trend, and SOL100 appeals to NFT psychology. This one is going up in price - A lot - Guaranteed. Chat with the team on telegram now [https://t.me/sol100token](https://t.me/sol100token) and [https://t.me/sol100trading](https://t.me/sol100trading)\n\n[**Click Here to Buy SOL100**](https://sol100.io/how-to-buy.html)", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: November 26 - December 2nd, 2023 ", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 ", "relevance": 0}, {"search": 1, "content": "🔥 Week in Solana News: December 10 - 16, 2023 🔥 ", "relevance": 0}, {"search": 1, "content": "Trending Solana News 🤓 ", "relevance": 0}, {"search": 1, "content": "Top Solana News of The Week \\- Bitcoin and Ethereum face network congestion as Solana sails smoothly   \n\\- [$SWTS](https://twitter.com/search?q=%24SWTS&amp;src=cashtag_click) sets new ATH as meme coin frenzy continues   \n\\- [$GUAC](https://twitter.com/search?q=%24GUAC&amp;src=cashtag_click) pumped +39,000% in just one day    \n\n\nand more! Subscribe to our newsletter for weekly updates:   \n[https://solanafloor.substack.com/p/top-solana-news-of-the-week-may-10](https://t.co/4Xz5qeRqG8)", "relevance": 0}, {"search": 1, "content": "Weekly Solana News: SOL investment thesis, growing TVL, points system &amp; more! ", "relevance": 0}, {"search": 1, "content": "Solana News: Colosseum, Anza Agave Client, Unibot, Helius Galleria, Google BigQuery and more! ", "relevance": 0}, {"search": 1, "content": "Weekly Solana News: SOL investment thesis, growing TVL, points system &amp; more! ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! ", "relevance": 0}, {"search": 1, "content": "Exploring free AI-based trading software for Bitcoin and Solana #News #Bitcoin #cryptocurrency #Grafa ", "relevance": 0}, {"search": 1, "content": "Circle launches EURC stablecoin on Solana #News #Finance #cryptocurrency #BlockChain #Blockchain ", "relevance": 0}, {"search": 1, "content": "Week in Solana News - Genesis Edition - November 19-25, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana News! Sam Says? | Vs. Google | $350 SOL Bear Trap ", "relevance": 0}, {"search": 1, "content": "Solana News: DePin, Squads Protocol, SOL MEV, Metaplex MPLX, Developer Report &amp; MORE! ", "relevance": 0}, {"search": 1, "content": "Profit-taking and Ethereum's ascent drive 20% drop in Solana #News #Ethereum #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2023 | Solana Crypto | Solana News Today | Solan... ", "relevance": 0}, {"search": 1, "content": "Top Solana News of The Week! ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction| Solana News | Solana News Today |Solana today | 23/March/2022| ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! ", "relevance": 0}, {"search": 1, "content": "All the hottest Solana news, in one location! (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Week in Solana News: January 1 - 6, 2024 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Cardano leader denies reports of struggling ad campaign vs. Solana #News #Twitter #crypto #Strategy #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana News: Dymension launch, Unibot, Bonk on Kamino, JUP launch, Marinade, Layer 2's &amp; MORE! ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction| Solana News | Solana News Today |Solana today | 25/March/2022| ", "relevance": 0}, {"search": 1, "content": "Solana News More upside??   \n\n\n  \n[https://www.msn.com/en-us/news/technology/solana-co-founder-sees-upside-from-ethereum-e2-80-99s-merge-saga-web-3-mobile/ar-AA11N4RP](https://www.msn.com/en-us/news/technology/solana-co-founder-sees-upside-from-ethereum-e2-80-99s-merge-saga-web-3-mobile/ar-AA11N4RP)", "relevance": 0}, {"search": 1, "content": "r/TopSolanaNews Lounge A place for members of r/TopSolanaNews to chat with each other", "relevance": 0}, {"search": 1, "content": "Solana News - Saga Phone, Phantom Wallet, Metaplex NFT, Jupiter DEX, Meme Coins, Breakpoint &amp; MORE ", "relevance": 0}, {"search": 1, "content": "Eclipse unveils Ethereum rollup powered by Solana #News #Ethereum #Markets #Grafa ", "relevance": 0}, {"search": 1, "content": "Week in Solana News - November 19-25, 2023 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "🔥Top Solana News Of The Week!🔥  ✨Lily/Lotus gang releases the \"cropinator\", a tool to perfectly crop and edit your JPEGs.\n\nhttps://preview.redd.it/lvktoa99bsxa1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=c52b0aa6cc4afa64eb96dd39a3700f5d22b581d4\n\n✨Underground society hint at a major partnership with the most famous subDAO in all of Solana\n\n✨Oogy teases at the final five which is set to begin tomorrow\n\n✨The fracture release a new IXARUS art sneak peek\n\n✨Doge capital announce the release of their ordinal BTC collection - 69 Doges\n\nWhich of these news has the highest impact on the Solana market?🤔", "relevance": 0}, {"search": 1, "content": "Massive Cardano News and Crypto News - BTC, Filecoin, Solana, Karate ", "relevance": 0}, {"search": 1, "content": "🔥Top Solana news of the week!🔥 Thanks to Gimzo353 for putting this together.👏\n\nhttps://preview.redd.it/fngbczvcgswa1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=dc5f600d4f1590d1e022baf59b9fb33e55e3dd73\n\n✨Taiyo Robotics announce a partnership with Hello Moon to deliver \"World Beating Products  \n✨The Fracture releases a new IXARUS sneak peek 'EVE'  \n✨Doge Capital releases a VIP Kenl Ticket airdrop - Ticket grants access to exclusive raffles.   \n✨Portals announce their Island templates are now live  \n✨Oogy mentions in the recent announcement that their explorer will be live within a few days\n\nWhich of these news has the most impact on the market? Key us know in the comment section!", "relevance": 0}, {"search": 1, "content": "Solana News: Kamino Points, Drift Points, Saga Phone 2, Aave NEON EVM, MarginFi and ATOM vs SOL ", "relevance": 0}, {"search": 1, "content": "Solana News - Saga Phone, Phantom Wallet, Metaplex NFT, Jupiter DEX, Meme Coins, Breakpoint &amp; MORE ", "relevance": 0}, {"search": 1, "content": "Recent altcoin trends highlight distinct market dynamics of Ethereum and Solana #News #Bitcoin #crypto #BlockChain #Blockchain ", "relevance": 0}, {"search": 1, "content": "Solana News: $122 Million in Solana Projected to be Sold as Part of the Dump has been Staked (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Solana News - Solana NFT ", "relevance": 0}, {"search": 1, "content": "SolanaNews.org Newsletter - Week of December 24-30, 2023 (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "Solana News: Attack &amp; Recovery + Solana NFTs in Exodus | Crypto News Today ", "relevance": 0}, {"search": 1, "content": "Solana News - Solana NFT ", "relevance": 0}, {"search": 1, "content": "TOP 4 Solana ALTCOINS - SOLANA DeFi Projects - Solana Ecosystem - Solana News ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - May 17, 2023 ", "relevance": 0}, {"search": 1, "content": "Finally some good news on Solana. ", "relevance": 0}, {"search": 1, "content": "Top Solana news of the last week!🔥 📍An address named \"Dumpoor Nexus\" deposited 900K $SOL to Coinbase on 14th April.\n\nhttps://preview.redd.it/5dzzonk45fua1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=41bc359fffb742e8798d5ed0a4aedc9e89142b80\n\n📍Solana NFTs show confirmation of the beginning of a long-term trend where both USD and $SOL value increase.\n\n📍Helium to migrate to Solana on 18th April.\n\nSource: StepDataInsight on Twitter \n\nWhich of these news has the biggest impact on the market this week? Share your thoughts!👇", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin |Solana News Today| Solana Crypto News, Solana Coin In Hindi ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin | Solana News Today | Solana Crypto News | Solana Coin ", "relevance": 0}, {"search": 1, "content": "solana new update | solana crypto | solana news ", "relevance": 0}, {"search": 1, "content": "solana price prediction | solana news today | solana coin | solana crypto news today ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - February 27, 2023 ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - May 3, 2023 ", "relevance": 0}, {"search": 1, "content": "Evan Deutsch on boosting non-native token liquidity with cloned assets on Solana #News #cryptocurrency #BlockChain #Blockchain #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana meme coins surge in value #News #Grafa ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 | Sol Coin |Solana News Today| Solana Crypto News, Solana Coin In Hindi ", "relevance": 0}, {"search": 1, "content": "Solana(Sol) price Prediction ! Solana news to day ! solana coin ! solana Crypto news ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 26, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana Breakpoint Insights: news &amp; updates ", "relevance": 0}, {"search": 1, "content": "Solana Price Prediction 2022 |SOLANA NEW UPDATE|| MASSIVE Solana News! ", "relevance": 0}, {"search": 1, "content": "Solana News Today || Solana Price Prediction! Solana Today Update ", "relevance": 0}, {"search": 1, "content": "Robinhood lists Solana meme coin WIF #News #crypto #Grafa ", "relevance": 0}, {"search": 1, "content": "Exciting News! $ROGER, the utility token on Solana  Exciting News! $ROGER, the utility token on Solana, is launching its own 'Roger Launchpad'! With 1 billion max supply, Mint and Freeze Authority revoked, and a SAFU-certified dev, this project is set to revolutionize Solana's crypto space. 🌐\n\n\\#Crypto #Solana #Launchpad\" ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 19, 2023 ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "Solana news I hold a little bag of Solana, and though I’ve been researching, this puts everything into perspective, as far as the massive uptick in interest and price. Who’s holding?\n\nhttps://cointelegraph.com/news/solana-hits-record-high-with-sol-price-up-over-218-in-six-weeks-what-s-behind-the-rally", "relevance": 0}, {"search": 1, "content": "Good News | Solana news today in Hindi | solana price prediction 2022| Solana nft | #Solana #Solcoin ", "relevance": 0}, {"search": 1, "content": "solana news today | solana | solana crypto news today | crypto adda | crypto currency news in hindi ", "relevance": 0}, {"search": 1, "content": "TOP 4 Solana ALTCOINS - SOLANA DeFi Projects - Solana Ecosystem - Solana News ", "relevance": 0}, {"search": 1, "content": "Exciting News in Crypto! Introducing $ROGER on Solana  Exciting News in Crypto! Introducing $ROGER on Solana – the utility token for the upcoming Roger Launchpad. Max supply: 1B, Mint and Freeze authorities revoked. SAFU-certified Dev and CFG NINJA audit ensure security. Holders enjoy unique RevShare! ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "Top Solana News of the Week - April 5, 2023 ", "relevance": 0}, {"search": 1, "content": "Solana News: NEON EVM, Marinade Finance, Squads Multisig, Injective INJ, Jupiter DEX, and MORE! (x-post from /r/Cryptocurrency) ", "relevance": 0}, {"search": 1, "content": "SOLANA - THIS IS THE MOMENT!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 1, "content": "SOLANA - CAUTION!!! EXPLOSIVE MOVE INBOUND!! Solana Price Prediction 2022! Solana News! ", "relevance": 0}, {"search": 2, "content": "Ahh yes. Machine learning is \"average\" difficulty ", "relevance": 0}, {"search": 2, "content": "machine learning math Question: How well do OpenAI executives understand the math?   \n\nSam Altman dropped out of Stanford after 2 years as a CS major, to run Loopt (Wikipedia). Greg Brockman dropped out of Harvard first, and then from MIT, to join Stripe (Wikipedia).   \n\nMira Murati has a BS in MechEng from a low-ranking university (not in the same level as Stanford or MIT).   \nIlya Sutskever got a PhD under Geoffrey Hinton. He's clearly a scientist.     \n\nNow, Sam and Greg are obviously smart, since they got into top colleges. But, do they understand the math behind AI? Or they just focus on the business side and delegate the math to Ilya?    \n\nFor reference, Zuckerberg also became a millionaire after dropping out, but his startup was just a website, a social network, it was not cutting-edge research, as OpenAI seems to be doing. Also, Demis Hassabis does have a PhD.     \n\nI understand this is a math sub, so feel free to make the discussion as mathematical as possible.", "relevance": 0}, {"search": 2, "content": "How to learn Machine Learning? My Roadmap Hello! Machine learning sparked my interest, and I'm ready to dive in. I have some previous programming knowledge but I basically start at zero in data science. So naturally, I don't really know where to begin this journey. I've researched for resources and roadmaps to learn machine learning and created my own basic roadmap just to get started.\n\n**Math - 107 hours**\n\n* [Single-Variable Calculus - MIT](https://www.youtube.com/playlist?list=PLE2215608E2574180) \\~ 29 hours\n* [Multi-Variable Calculus - MIT](https://www.youtube.com/playlist?list=PL4C4C8A7D06566F38) \\~ 29 hours\n* [Linear Algebra - MIT](https://www.youtube.com/playlist?list=PLE7DDD91010BC51F8) \\~ 28 hours\n* [Statistics &amp; Probability - MIT](https://www.youtube.com/playlist?list=PLl8XY7QVSa4aUyZAtL2Hlf_mx3LaSix9B) \\~ 21 hours\n\n**Programming - 135 hours**\n\n* [Introduction to Computer Science and Programming Using Python](https://www.edx.org/course/introduction-to-computer-science-and-programming-7) \\~ 135 hours\n\n**Machine Learning - 200+ hours**\n\n* [Machine Learning Specialization (Andrew Ng)](https://www.deeplearning.ai/program/machine-learning-specialization/) (release June)\n* [Deep Learning Specialization (Andrew Ng)](https://www.coursera.org/learn/neural-networks-deep-learning?specialization=deep-learning&amp;irclickid=Xa1wyCQHuzYeRMESFSRiQXN3UkGXVIyn4RCEVk0&amp;irgwc=1) \\~ 142 hours\n\nPlease give comments on it and or advice on better/more efficient ways to learn. Thanks!", "relevance": 0}, {"search": 2, "content": "[D] A Super Harsh Guide to Machine Learning First, read fucking Hastie, Tibshirani, and whoever. Chapters 1-4 and 7-8. If you don't understand it, keep reading it until you do. \n\nYou can read the rest of the book if you want. You probably should, but I'll assume you know all of it. \n\nTake Andrew Ng's Coursera. Do all the exercises in python and R. Make sure you get the same answers with all of them. \n\nNow forget all of that and read the deep learning book. Put tensorflow and pytorch on a Linux box and run examples until you get it. Do stuff with CNNs and RNNs and just feed forward NNs.\n\nOnce you do all of that, go on arXiv and read the most recent useful papers. The literature changes every few months, so keep up. \n\nThere. Now you can probably be hired most places. If you need resume filler, so some Kaggle competitions. If you have debugging questions, use StackOverflow. If you have math questions, read more. If you have life questions, I have no idea.", "relevance": 0}, {"search": 2, "content": "Is it too late to join machine learning? As title says.\n\n\\- Many more people joining the CS field. Lots of people struggling to get jobs.\n\n\\- Now CS skill feels useless as even ChatGPT can just do any code you ask it.\n\n\\- Machine learning skills seem only in demand at the top? The pioneers?\n\nIt is worth it for someone to even start learning machine learning skills? If not, what should they do?\n\nSerious replies only please. Looking for career advice.", "relevance": 0}, {"search": 2, "content": "How to become a Machine Learning Engineer I am currently working as a Data Scientist but I would like to start learning the skills I need to become a MLE. I understand that a MLE does not work only with the sexy machine learning models part, but also with all the CI/CD, migration to production, ML pipelines and all things related to automating the running of the model and training. What are the skills, platforms, softwares and other technical skills I need to learn to start moving towards that role?", "relevance": 0}, {"search": 2, "content": "Machine Learning Engineer Early Career Roles I have anecdotally seen fewer early career/new grad machine learning engineer positions open since the downturn in the software engineering industry and the layoffs. \n\nThis parallels the paucity of early career SWE positions in the wider software engineering industry. Any insight as to whether this is transient, or companies going forward may be less inclined to hire early career ML engineers in the future and make do with their current ML engineers?", "relevance": 0}, {"search": 2, "content": "How much of stats and math do we REALLY need for Machine learning engineer? Hello,\n\nI am asking about the MLE that create models and also deploy then. \n\nIn my team we have two type of data scientists:\n- one that is very good in kaggle but don't know stats and math deeply.\n- other that has a deep understanding in maths and stats. \n\nBoth can create good models. \n\nI am asking about MLE because, most companies that has this name instead of DS looks like to have more mature in data science culture. \n\nWhat's your opinion about this?\n\nEdit: I am talk about the MLE/DS that in majory percent of time create models and not do analysis like: which features cause the trend (causal inference example)", "relevance": 0}, {"search": 2, "content": "Do you think AI/machine learning is a very important field to get into for future relevance? I am just starting to learn about it this week and thinking it is really going to be integral in the years to come right?\n\nPerhaps as important if not more than the information age we are in now. More probably when skynet goes online and the war between humans/ai begins.\n\nSo, good to get onboard now.\n\nI think my last great decision was learning coding around 2016 and this is going to be another great one in terms of time management and where to focus your efforts.\n\nNot only yes but interested to hear what fields it will be relevant in? All?\n\nEDIT: seems this is going off what I intended. I am not actually looking for a new career path. I am more just interested in knowing what future implementations will/might be as it becomes more ubiquitous, just speculating what that might be.", "relevance": 0}, {"search": 2, "content": "jrDevVsMachineLearning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Magic. ", "relevance": 0}, {"search": 2, "content": "Machine learning... ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Machine learning ", "relevance": 0}, {"search": 2, "content": "Garbage in/Garbage out as they say with machine learning algorithms ", "relevance": 0}, {"search": 2, "content": "From Hello world to directly Machine Learning? ", "relevance": 0}, {"search": 2, "content": "Machine learning generated images animation ", "relevance": 0}, {"search": 2, "content": "Actually, I am machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Battlestation ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "How to bully machine learning training ", "relevance": 0}, {"search": 2, "content": "QAnon founder may have been identified thanks to machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Did Anyone Say ✨Machine Learning?✨ ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}, {"search": 2, "content": "Authright explores machine learning ", "relevance": 0}, {"search": 2, "content": "How Machine Learning \"Learns\" Using Loss Minimization ", "relevance": 0}, {"search": 2, "content": "Machine learning generated visuals ", "relevance": 0}, {"search": 2, "content": "Machine learning algorithms are easily defeated ", "relevance": 0}, {"search": 2, "content": "Powerful antibiotic discovered using machine learning for first time ", "relevance": 0}, {"search": 2, "content": "How Do Machines Learn? ", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "How to bully machine learning training ", "relevance": 0}, {"search": 2, "content": "Math + Algorithms = Machine Learning ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}, {"search": 2, "content": "machineLearnMoneyEarn ", "relevance": 0}, {"search": 2, "content": "I started working at this company with machine learning but what actually am I? A machine teacher? ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "Machine Learning Helped Scientists Create an Enzyme That Breaks Down Plastic at Warp Speed ", "relevance": 0}, {"search": 2, "content": "How does machine learning work? ", "relevance": 0}, {"search": 2, "content": "Hololive Myth portrait created with Artbreeder (machine learning) by Hea ", "relevance": 0}, {"search": 2, "content": "Machine learning engineers ", "relevance": 0}, {"search": 2, "content": "New map made with a machine learning algorithm - Botnik Studios ", "relevance": 0}, {"search": 2, "content": "Machine Learning Applied To Art ", "relevance": 0}, {"search": 2, "content": "machine learning ", "relevance": 0}, {"search": 2, "content": "New MIT machine learning model shows relaxing quarantine rules will spike COVID-19 cases ", "relevance": 0}, {"search": 2, "content": "Some of our countries Royals from history 'brought to life' using machine learning. ", "relevance": 0}, {"search": 2, "content": "A machine learning algorithm walked into a bar. ", "relevance": 0}, {"search": 2, "content": "[D] The machine learning community has a toxicity problem It is omnipresent!\n\n**First** of all, the peer-review process is *broken*. Every fourth NeurIPS submission is put on arXiv. There are DeepMind researchers publicly going after reviewers who are criticizing their ICLR submission. On top of that, papers by well-known institutes that were put on arXiv are accepted at top conferences, despite the reviewers agreeing on rejection. In contrast, vice versa, some papers with a majority of accepts are overruled by the AC. (I don't want to call any names, just have a look the openreview page of this year's ICRL).\n\n**Secondly,** there is a *reproducibility crisis*. Tuning hyperparameters on the test set seem to be the standard practice nowadays. Papers that do not beat the current state-of-the-art method have a zero chance of getting accepted at a good conference. As a result, hyperparameters get tuned and subtle tricks implemented to observe a gain in performance where there isn't any.\n\n**Thirdly,** there is a *worshiping* problem. Every paper with a Stanford or DeepMind affiliation gets praised like a breakthrough. For instance, BERT has seven times more citations than ULMfit. The Google affiliation gives so much credibility and visibility to a paper. At every ICML conference, there is a crowd of people in front of every DeepMind poster, regardless of the content of the work. The same story happened with the Zoom meetings at the virtual ICLR 2020. Moreover, NeurIPS 2020 had twice as many submissions as ICML, even though both are top-tier ML conferences. Why? Why is the name \"neural\" praised so much? Next, Bengio, Hinton, and LeCun are truly deep learning pioneers but calling them the \"godfathers\" of AI is insane. It has reached the level of a cult.\n\n**Fourthly**, the way Yann LeCun talked about biases and fairness topics was insensitive. However, the *toxicity* and backlash that he received are beyond any reasonable quantity. Getting rid of LeCun and silencing people won't solve any issue.\n\n**Fifthly**, machine learning, and computer science in general, have a huge *diversity problem*. At our CS faculty, only 30% of undergrads and 15% of the professors are women. Going on parental leave during a PhD or post-doc usually means the end of an academic career. However, this lack of diversity is often abused as an excuse to shield certain people from any form of criticism.  Reducing every negative comment in a scientific discussion to race and gender creates a toxic environment. People are becoming afraid to engage in fear of being called a racist or sexist, which in turn reinforces the diversity problem.\n\n**Sixthly**, moral and ethics are set *arbitrarily*. The U.S. domestic politics dominate every discussion. At this very moment, thousands of Uyghurs are put into concentration camps based on computer vision algorithms invented by this community, and nobody seems even remotely to care. Adding a \"broader impact\" section at the end of every people will not make this stop. There are huge shitstorms because a researcher wasn't mentioned in an article. Meanwhile, the 1-billion+ people continent of Africa is virtually excluded from any meaningful ML discussion (besides a few Indaba workshops).\n\n**Seventhly**, there is a cut-throat publish-or-perish *mentality*. If you don't publish 5+ NeurIPS/ICML papers per year, you are a looser. Research groups have become so large that the PI does not even know the name of every PhD student anymore. Certain people submit 50+ papers per year to NeurIPS. The sole purpose of writing a paper has become to having one more NeurIPS paper in your CV. Quality is secondary; passing the peer-preview stage has become the primary objective.\n\n**Finally**, discussions have become *disrespectful*. Schmidhuber calls Hinton a thief, Gebru calls LeCun a white supremacist, Anandkumar calls Marcus a sexist, everybody is under attack, but nothing is improved.\n\nAlbert Einstein was opposing the theory of [quantum mechanics](https://en.wikipedia.org/wiki/Albert_Einstein#Einstein's_objections_to_quantum_mechanics). Can we please stop demonizing those who do not share our exact views. We are allowed to disagree without going for the jugular. \n\nThe moment we start silencing people because of their opinion is the moment scientific and societal progress dies. \n\nBest intentions, Yusuf", "relevance": 0}, {"search": 2, "content": "Machine learning is getting smarter than ever before ", "relevance": 0}, {"search": 2, "content": "sometimes machine learning algorithms are very funny ", "relevance": 0}, {"search": 2, "content": "A machine learning joke (credits to u/z0ltan_x) ", "relevance": 0}, {"search": 2, "content": "Machine learning much? (Repost from r/HolUp) ", "relevance": 0}, {"search": 2, "content": "How Do Machines Learn? ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "How to confuse your machine learning... ", "relevance": 0}, {"search": 2, "content": "NYC Bans Students and Teachers from Using ChatGPT | The machine learning chatbot is inaccessible on school networks and devices, due to \"concerns about negative impacts on student learning,\" a spokesperson said. ", "relevance": 0}, {"search": 2, "content": "XKCD Comic does machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning Pipelines ", "relevance": 0}, {"search": 2, "content": "Machine-learning algorithm beats 20 lawyers in NDA legal analysis ", "relevance": 0}, {"search": 2, "content": "Hyper Text Machine Learning ", "relevance": 0}, {"search": 2, "content": "US national lab is using machine learning to detect rogue nuclear threats ", "relevance": 0}, {"search": 2, "content": "Should r/MachineLearning join the reddit blackout to protest changes to their API? Hello there, r/MachineLearning,\n\nRecently, Reddit has announced some [changes to their API](https://www.reddit.com/r/modnews/comments/13wshdp/api_update_continued_access_to_our_api_for/) that may have pretty serious impact on many of it's users.\n\n[You may have already seen quite a few posts like these](https://www.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/) across some of the other subreddits that you browse, so we're just going to cut to the chase.\n\n# What's Happening\n\nThird Party Reddit apps (such as Apollo, Reddit is Fun and others) are going to become ludicrously more expensive for it's developers to run, which will in turn either kill the apps, or result in a monthly fee to the users if they choose to use one of those apps to browse. Put simply, each request to Reddit within these mobile apps will cost the developer money. The developers of Apollo [were quoted around $2 million per month](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) for the current rate of usage. The only way for these apps to continue to be viable for the developer is if you (the user) pay a monthly fee, and realistically, this is most likely going to just outright kill them. **Put simply: If you use a third party app to browse Reddit, you will most likely no longer be able to do so, or be charged a monthly fee to keep it viable.**\n\nIn lieu of what's happening, [an open letter](https://www.reddit.com/r/ModCoord/comments/13xh1e7/an_open_letter_on_the_state_of_affairs_regarding/) has been released by the broader moderation community. Part of this initiative includes a potential subreddit blackout (meaning, the subreddit will be privatized) on June 12th, lasting 24-48 hours or longer. On one hand, this is great to hopefully make enough of an impact to influence Reddit to change their minds on this. On the other hand, we usually stay out of these blackouts, and we would rather not negatively impact usage of the subreddit.\n\nWe would like to give the community a voice in this. Is this an important enough matter that r/machinelearning should fully support the protest and blackout the subreddit on June 12th? Feel free to leave your thoughts and opinions below. \n\nAlso, please use up/downvotes for this submission to make yourself heard: upvote: r/ML should join the protest, downvote: r/ML should not join the protest.", "relevance": 0}, {"search": 2, "content": "Fake YouTube comments using machine learning ", "relevance": 0}, {"search": 2, "content": "Machine learning means repetitive behaviour ", "relevance": 0}, {"search": 2, "content": "My SOTA machine learning model. ", "relevance": 0}, {"search": 2, "content": "Nexto, a community machine learning Rocket League bot, even understands our most important rule. ", "relevance": 0}, {"search": 2, "content": "Machine Learning Algorithms in a nutshell ", "relevance": 0}, {"search": 2, "content": "Such Machine Learning Much Wow ", "relevance": 0}, {"search": 2, "content": "Experiments in the Smooth Transition of Zoom, Rotation, Pan, and Learning Rate in Text-to-Image Machine Learning Imagery [15,000 frames] ", "relevance": 0}, {"search": 2, "content": "Ian Goodfellow, Apple's Director of Machine Learning, Inventor of GAN, Resigns Due to Apple's Return to Office Work ", "relevance": 0}, {"search": 2, "content": "Supervised machine learning ", "relevance": 0}, {"search": 2, "content": "machineLearningChad ", "relevance": 0}, {"search": 2, "content": "For some reason, nobody uses R for machine learning ", "relevance": 0}, {"search": 2, "content": "[OC] Using machine learning to predict All-Stars from the 2019 draft This post has a few graphs. If you don't want to click on each one individually, they're all in an imgur album [here](https://imgur.com/a/5nkFTu4).\n\nThere is a tl;dr at the end of the post.\n\n***\n\n#Introduction\n\nWhen picking in the top-10 of a draft, teams have one goal: select a franchise-altering player with star potential. Though some teams draft for need and prefer to select more NBA-ready players, in general, GMs do their best to select a player who may become a star.\n\nThis is very challenging. Many factors affect a player’s ability to become a star. Along with college performance, factors like athleticism, intangibles, injuries, coaching, and more change a player’s star potential.\n\nAs fans on the outside looking in, we have limited information on most of these factors except one: college performance. Though even the college performance of many players needs context (such as Cam Reddish’s low volume stats due to playing with Zion Williamson and R.J. Barrett), it’s one of the only quantifiable factors we can use. So, let’s try to use college stats to predict All-Stars in the top-10 of the 2019 draft.\n\n***\n\n#Methods\n\nFirst, I created a database of every top-10 pick from the 1990-2015 NBA drafts. We use 1990 as the limit because it ensures every player played their entire college career with a 3-point line. The 2015 draft was set as an upper limit so that all players played the entirety of their rookie contract, giving them some chance to make an All-Star team.\n\nIn addition to collecting their college stats, I marked whether the prospect made an All-Star team. There is no consideration for whether the player became an All-Star while on the team that drafted him, how long it took him to get there, etc. All data was collected from Sports-Reference.\n\nPlayers who made an All-Star team at some point in their career earned a “1” in the All-Star column. Meanwhile, players who failed to make an All-Star team earned a “0.”\n\nThis represents a binary classification problem. There are two classes we’re looking at: All-Star and not All-Star. The models try to match each player to one of the two classes. We’ll also look at the prediction probability (probability for the player to be in the class) the models give each player.\n\nTo create the models, we used the following stats as inputs:\n\n|Counting stats|Efficiency|Other|\n:--|:--|:--|\n|PPG|TS%|Pick|\n|TRB|3PAr|SOS|\n|AST|FTr||\n|STL|||\n|BLK|||\n\nNote that win shares, box plus/minus, and other holistic advanced stats that are excluded. College BPM data is available only from the 2011 draft, and college WS data is available only from the 1996 draft. Therefore, using BPM restricts the data set massively. Though adding WS only excludes 6 years of drafts, the models were significantly less accurate when including WS.\n\nThe models predicted whether the player made an All-Star team (the 1s or 0s described above).\n\nWe collected the same set of stats for the top-10 picks in the 2019 draft. When using the models to All-Stars out of the 2019 draft, we’ll look primarily at the prediction probabilities of the positive class. A prediction probability of 0.75 indicates that the model is 75% certain the player will fall into class 1 (All-Star). Therefore, every player with a prediction probability above 0.5 would be predicted as a 1 if we just used the models to predict classes instead of probability.\n\nGiven that about 31% of top-10 picks since 1990, the prediction probabilities give us more information about the predictions. If we’d just predict the classes, we’d likely get 2-4 1s, and the rest be 0s. However, with the prediction probabilities, we can see whether a player has a higher All-Star probability than others drafted at his pick historically, making him a seemingly good value.\n\nNote that unlike other problems like predicting All-NBA teams – where voters have general tendencies making the problem easy to predict accurately – predicting All-Stars is incredibly difficult. Players develop differently, and college stats alone are not nearly enough to accurately project a player’s All-Star potential. We don’t expect the models to incredibly accurate. After all, if they were, teams would use better models higher quality data to make predictions that would help them always pick All-Stars.\n\nIn total, we made four models:\n\n1. Logistic classifier (LOG)\n2. Support vector classifier (SVC)\n3. Random forest classifier (RF)\n4. Gradient boosting classifier (GBC)\n\n***\n\n#Comparing All-Star and not All-Star stats\n\nLet’s compare some college stats between All-Stars and not All-Stars. This will illustrate just how difficult it is to differentiate the two groups based off just their college stats.\n\nBefore diving into the differences (or lack thereof), let’s first establish how to read these plots. This type of graph is called a boxplot. The yellow line represents the median or middle value in each group. The top of the box signifies the 75th percentile, while the bottom of the box signifies the 25th percentile. So, the 25th-50th percentile can be seen between the bottom of the box and the yellow line. From the yellow line to the top of the box represents the 50th-75th percentile. The full box represents the 25th-75th percentile of the data.\n\nThe lines flowing out of the box are called “whiskers.” The top of the whisker, or the “T” shape, represents the greatest value, excluding outliers. The bottom whisker represents the opposite (the lowest value excluding outliers). From the top of the box to the top of the whisker represents the 75th-100th percentile. The bottom of the box to the bottom of the whisker represents the 0th-25th percentile. Therefore, the top of the box also represents the median of the upper half of the data set.\n\nThe dots above or below the whiskers represent outliers. Outliers above the whiskers represent points that are greater than the upper quartile (top of the box) + 1.5 times then interquartile range (top of the box – bottom of the box). Outliers below the whiskers represent points that are less than the lower quartile (bottom of the box) – 1.5 times then interquartile range (top of the box – bottom of the box).\n\nFirst, let’s look at their points per game.\n\nhttps://i.imgur.com/W344Rfe.png\n\nThough the All-Stars have a marginally higher median PPG, the not All-Stars have a higher upper quartile PPG (top of the whisker). Therefore, there’s no clear difference here between the two groups, especially given that the bottom whiskers extend similarly for both groups.\n\nNext, let’s look at rebounds and assists. Because big men will get more rebounds, and guards will get more assists, All-Stars and not All-Stars seems to be an odd comparison. However, we’re just looking for differences in basic counting stats.\n\nhttps://i.imgur.com/P9vayUu.png\n\nhttps://i.imgur.com/GoSlUqV.png\n\nFor rebounds, there’s practically no difference yet again. Both groups show a nearly identical median and very similar ranges. For assists, the All-Stars have a higher median assist total, and the 25th-75th percentile range stretches higher. Therefore, there’s a small difference between the two.\n\nLet’s look at the difference in strength of schedule (SOS).\n\nhttps://i.imgur.com/ejj28M6.png\n\nYet again, there’s a minimal difference. The medians are almost equal. Though the All-Stars range is higher than the not All-Stars range, there are multiple low outliers for the All-Stars.\n\nLastly, let’s look at the difference in picks.\n\nhttps://i.imgur.com/D95LjtS.png\n\nThis is the first pronounced difference. The median pick of an All-Star is much lower than that of a not All-Star. Because no other stats showed any significant difference between the two groups, we can expect pick to be the most important feature in the models. Furthermore, this difference shows that NBA GMs are generally pretty good at drafting.\n\n\n***\n\n#Model analysis\n\n##Model creation: data transformation\n\nAfter creating the four models described above and testing their accuracy with basic metrics (discussed later), I did two things.\n\nFirst, I tried manipulating the data. To make the models, I initially used the raw data. Sometimes, normalizing the data may lead to better performance. Normalizing the data means scaling each individual stat so that the highest value is 1 and the lowest value is 0. This can be done across the entire data set (the player with the highest college PPG would have a PPG input to the models of 1) or to each draft year (the player with the highest college PPG in each draft year would have a PPG input to the models of 1). Neither of these methods increased performance.\n\nNext, I tried transforming the data into ranks. Instead of giving raw or normalized stats, we can simply rank all the players by their stats. Like normalization, this gives us some method to compare the players. However, ranking each stat for neither the entire data set nor each draft year improved performance.\n\nAfter all, we’ll use the usual, raw data we got from Sports Reference.\n\n##Model creation: hyperparameter tuning\n\nEvery model has certain characteristics that determine how the model fits the data. These characteristics, or hyperparameters, make the model’s architecture. For example, if we were using an exponential model, the degree (quadratic, cubic, quartic, etc.) would be a hyperparameter. Hyperparameters impact the model’s performance.\n\nIn previous posts, I used nice round numbers for the model hyperparameters and played around with them randomly until I found a mix that yielded a strong model. However, this is not scientific.\n\nFor a scientific hyperparameter tuning, we can use a method called grid search. Grid search takes a grid of possible values for hyperparameters we want to test, creates a model for each possible combination, evaluates the model’s accuracy, and returns the “best” model. In this case, we want to find the model that has the best recall (a metric we’ll discuss soon).\n\nThe SVC, RF, and GBC saw their performance improve with the hyperparameters from the grid search. So, for those models, we used the best parameters found by the grid search. For the LOG, we used the parameters we set before the grid search (in this case, the default).\n\n##Basic goodness-of-fit\n\nWe measure the performance of classification models in several ways. The simplest metric is accuracy, which measures the percentage of predictions the model made correctly. Essentially, it takes the list of predictions and finds how many values in the list were perfect matches to the list of results.\n\nBecause this is the simplest classification metric, it has its flaws. Accuracy only measures correct predictions, so it may be misleading in some cases. For example, if we’re predicting something very rare, then almost all the results will be 0s. Therefore, a model that exclusively predicts 0s will have a high accuracy even if it has no predictive power.\n\nGiven that there are more not All-Stars than All-Stars, accuracy is not the best metric in this case. 30% of the testing set consists of All-Stars, meaning a model could achieve 70% accuracy by predicting all 0s (that no one will be an All-Star). However, because picking correct All-Stars at the expense of picking some incorrect All-Stars is better than picking no All-Stars at all, it’s fine to have an accuracy less than 70%.\n\nTo understand the next few classification metrics, we must first establish some terms. A true positive occurs when the model predicts a 1, and the actual value is a 1 (meaning the model correctly predicted an All-Star). A true negative is the opposite; the model correctly predicts a 0. False positives occur when the model predicts a 1 where the actual value is 0, and false negatives occur when the model predicts a 0 where the actual value is 1.\n\nRecall measures a model’s ability to predict the positive class. In this case, it’s the model’s ability to find all the All-Stars (true positives). Recall = TP / (TP + FN), meaning that a “perfect” model that predicts every positive class correctly will have a recall of 1. Recall is arguably the most important metric here.\n\nPrecision measures how many of the returned predicted All-Stars were true. It penalizes the model for incorrectly predicting a bunch of All-Stars. Precision = TP / (TP + FP), meaning that a “perfect” model will have a precision of 1. Notice that there is typically a trade-off between precision and recall given that recall measures ability to find true positives, while precision measures ability to limit false positives.\n\nTo combine the two metrics, we can use F1. F1 = 2(precision * recall) / (precision + recall). By combining precision and recall, F1 lets us compare two models with different precisions and recalls. Like recall and precision, F1 values are between 0 and 1, with 1 being the best.\n\nNow that we’re familiar with some classification metrics, let’s examine the models’ performance. The table below shows the scores of all four models on the previously mentioned metrics.\n\n|Model|Accuracy|Recall|Precision|F1|\n:--|--:|--:|--:|--:|\n|LOG|0.746|0.316|0.667|0.429|\n|SVC|0.762|0.263|0.833|0.4|\n|RF|0.746|0.368|0.636|0.467|\n|GBC|0.73|0.368|0.583|0.452|\n\nThe RF and GBC had the highest recall, though the RF had higher precision and accuracy than the GBC. Although the SVC had the highest precision and accuracy, we’re most concerned with recall, meaning the other models are stronger. The LOG appears slightly weaker than the RF and GBC, though it’s still a strong model.\n\nAs mentioned before, we’re not expecting dazzling performance from the models. After all, if models using publicly available data could predict All-Stars, NBA teams with full analytics staffs would have no problem finding them. Therefore, though these metrics are not encouraging by themselves, they show that the models have some predictive power.\n\n##Improvement over random\n\nTo show that the models are stronger than randomly predicting All-Stars, I made a dummy classifier. The dummy classifier randomly predicts players to be a 1 or 0 with respect to the training set’s class distribution. Given that the training set had 32% All-Stars (the testing set had 30% as mentioned earlier), the dummy classifier will randomly predict 32% of the testing set to be All-Stars.\n\nThe table below shows the dummy classifier’s performance.\n\n|Model|Accuracy|Recall|Precision|F1|\n:--|--:|--:|--:|--:|\n|Dummy|0.556|0.316|0.286|0.3|\n\nEach of our four models has higher accuracy, precision, and F1 scores than the dummy classifier. It is slightly concerning that the dummy classifier has equal recall to the LOG and higher recall than the SVC. Nevertheless, the LOG and SVC were much better at getting their All-Star predictions correct when they did predict them (higher precision).\n\n##Confusion matrices\n\nTo help visualize a model’s accuracy, we can use a confusion matrix. A confusion matrix shows the predicted vs. actual classes in the test set for each model. It plots each model’s true positives (bottom right), true negatives (top left), false positive (top right), and false negatives (bottom left) in a square.\n\nThe testing set was small; it had only 63 data points. Below are the confusion matrices for all four models.\n\nhttps://i.imgur.com/H1DeMjc.png\n\nhttps://i.imgur.com/kTgdOrV.png\n\nhttps://i.imgur.com/jgQmTDV.png\n\nhttps://i.imgur.com/NjcmZW9.png\n\n##Cross-validation\n\nAs we do in other machine learning posts, we want to cross-validate our models. This will ensure that they didn’t “memorize” the correct weights for this specific split of data, meaning they overfit.\n\nIn classification problems, it’s important to see that the class balance is close to even between the training and testing set. This could influence cross-validation, given that a different split of the data might have a large imbalance. Our training set had 32% All-Stars while our testing set had 30% All-Stars, making this a non-factor.\n\nThe table below shows the cross-validated accuracy (k = 3) and the scores’ 95% confidence interval.\n\n|Model|CV accuracy|95% confidence interval|\n:--|--:|:--|\n|LOG|0.665|+/- 0.096|\n|SVC|0.683|+/- 0.027|\n|RF|0.746|+/- 0.136|\n|GBC|0.633|+/- 0.135|\n\nEvery model has a cross-validated accuracy score that’s close to its real accuracy score.\n\n##Log loss and ROC curves\n\nThe final metrics we’ll use are log loss and ROC curves.\n\nLog loss is essentially like accuracy with prediction probabilities instead of predicted classes. Lower log loss is better. Because we’re interested in the prediction probabilities, log loss is an important metric here. Though log loss isn’t exactly simple to interpret by itself, it’s useful for comparing models.\n\nThe table below shows the four models’ log loss values.\n\n|Model|Log loss|\n:--|--:|\n|LOG|0.546|\n|SVC|0.56|\n|RF|0.556|\n|GBC|1.028|\n\nThe biggest takeaway from the log loss is that the GBC may not be as strong as we initially thought, given that all the other models have significantly lower log loss scores.\n\nThe second to last metric we’ll look at is the receiver operating characteristics (ROC) curve and the area under it. The curve shows the “separation” between true positives and true negatives by plotting them against each other. The area gives us a numerical value for this separation.\n\nA model with no overlap in probability between TP and TN (perfect) would have a right-angled ROC curve and an area under the curve of 1. As the overlap increases (meaning the model is worse) the curve gets closer to the line y = x.\n\nThe ROC curves and the area under the curve for each model is below.\n\nhttps://i.imgur.com/kmGla77.png\n\nEach model has a similar ROC curve and area under the curve.\n\n***\n\n#Why do the models predict what they do?\n\nBefore going into the results, the last thing we’ll want to look at is what the models find important in predicting All-Stars. There are a couple ways to do this.\n\nFirst, we’ll look at the model coefficients and feature importances. The LOG and SVC have coefficients, while the RF and GBC have feature importances. Coefficients are different from feature importances in that the coefficients are used to express the model in an equation. Higher coefficients do not mean the feature is more important, they just mean the model scaled that feature differently. On their own, they don’t have much meaning for us, but for comparison purposes, we can see which model scales a certain factor more.\n\nThe graph below shows the coefficients of the LOG and SVC.\n\nhttps://i.imgur.com/MjISg1X.png\n\nThe two models have very similar coefficients for the most part. The two main differences are in the steals and blocks coefficients. While the LOG gives blocks a negative coefficient, the SVC gives it a positive coefficient. Furthermore, the LOG gives steals a much higher coefficient than the SVC.\n\nNext, let’s look at feature importances. Feature importance shows how much the model relies on a feature by measuring how much the model’s error increases without it. Higher feature importance indicates more reliance on the feature.\n\nThe graph below shows the feature importances of the RF and GBC.\n\nhttps://i.imgur.com/mNUa0SW.png\n\nAs we would expect, pick was the most important feature for both models (the GBC point covers the RF point). Interestingly, SOS was almost as important to the GBC as pick.\n\n##Shapley values\n\nTo get a more detailed view of how each feature impacted each model, we can use a more advanced model explanation metric called Shapley values.\n\nShapley value is defined as the “average marginal contribution of a feature value over all possible coalitions.” It tests every prediction for an instance using every combo of our inputs. This along with other similar methods gives us more information about how much each individual feature affects each model in each case.\n\nFirst, we’ll look at the mean SHAP value, or average impact of each feature on each of the four models. A higher value indicates a more important feature.\n\nThe four graphs below show the mean SHAP values for each of the four models (in order of LOG, SVC, RF, GBC).\n\nhttps://i.imgur.com/2zv7BGd.png\n\nhttps://i.imgur.com/ysMmlhg.png\n\nhttps://i.imgur.com/GqRoVj7.png\n\nhttps://i.imgur.com/51GcrlK.png\n\nThe LOG, RF, and GBC all have pick as the most important feature, as expected. Steals being the second most important feature is surprising. The three models all have pick, steals, rebounds, and assists in their top-5 most important features.\n\nThe SVC has odd results, as pick was only the third most important feature behind rebounds and assists.\n\nTo get a more detailed and individualized view of the feature impacts, we can look at the SHAP value for each point.\n\nIn the graphs below, the x-axis represents the SHAP value. The higher the magnitude on the x-axis (very positive or very negative), the more the feature impacts the model. The color indicates the feature value, with red being high values and blue being low values. So, a blue point for pick indicates the player was picked early.\n\nWith these plots, we can make conclusions like “pick is very important to the models when its value is low but becomes less important as players are picked later.”\n\nThe four graphs below show the individual point SHAP and feature values.\n\nhttps://i.imgur.com/FbarVSw.png\n\nhttps://i.imgur.com/HKheCGM.png\n\nhttps://i.imgur.com/CUSmVbd.png\n\nhttps://i.imgur.com/puJObd8.png\n\nFor the LOG, pick mattered a lot when its value was low. As players were picked later, it had less of an impact on model output. The SVC was more affected by high assists, rebounds, and steal values than low pick values, unlike other models.\n\nRebounds had minimal impact on the RF except for cases where the player’s rebound total was very low. The opposite is true for TS% in both the RF and GBC; generally, TS% had minimal impact on the model except for the highest TS% values. For the GBC, the highest SOS values had a very high impact on model output.\n\n***\n\n#Results\n\nTo make predictions for the 2019 draft, we looked at prediction probabilities instead of predicted classes. This gives us each model’s probability that the player makes an All-Star team.\n\nThe four graphs below show each model’s predictions.\n\nhttps://i.imgur.com/RohPa4F.png\n\nhttps://i.imgur.com/mIlxG9X.png\n\nhttps://i.imgur.com/HqmnVoc.png\n\nhttps://i.imgur.com/9wKvXAY.png\n\nEvery model gives Zion the highest All-Star probability. The LOG and SVC’s top-3 in All-Star probability mimic the draft’s top-3. However, the RF and GBC love Jaxson Hayes; both models gave him the second-highest All-Star probability, just above Ja Morant. Both the RF and GBC also dislike DeAndre Hunter, giving him the lowest All-Star probability.\n\nThe graph below shows the average prediction of the four models.\n\nhttps://i.imgur.com/c9JSRWj.png\n\nThe RF and GBC propel Jaxson Hayes to the fourth-highest average predicted All-Star probability.\n\nThe table below shows each model's predictions and the average of the predictions.\n\n|Pick|Player|LOG|SVC|RF|GBC|Average|\n--:|:--|--:|--:|--:|--:|--:|\n|1|Zion Williamson|0.71|0.63|0.80|1.00|0.78|\n|2|Ja Morant|0.65|0.49|0.58|0.91|0.66|\n|3|RJ Barrett|0.37|0.49|0.53|0.62|0.50|\n|4|DeAndre Hunter|0.22|0.23|0.16|0.00|0.15|\n|5|Darius Garland|0.19|0.24|0.42|0.10|0.23|\n|6|Jarrett Culver|0.25|0.30|0.48|0.47|0.37|\n|7|Coby White|0.15|0.27|0.31|0.16|0.22|\n|8|Jaxson Hayes|0.08|0.17|0.61|0.94|0.45|\n|9|Rui Hachimura|0.07|0.11|0.17|0.00|0.09|\n|10|Cam Reddish|0.10|0.20|0.35|0.28|0.23|\n\nTo determine the best value picks according to the models, we can compare each player’s predicted All-Star probability to the percent of players drafted in his slot that made an All-Star team in our data set (1990-2015 drafts). So, if a first pick and a tenth pick both have 80% All-Star probability, the tenth pick will be a better relative value because many more first picks make All-Star teams.\n\nThe graph below shows the All-Star probability minus the percent of players drafted in the slot that make an All-Star team for each player.\n\nhttps://i.imgur.com/Akivph3.png\n\nThe graph below sorts the difference from greatest to least.\n\nhttps://i.imgur.com/IySAp4R.png\n\nThe models love Ja Morant and Jaxson Hayes as great values. Meanwhile, the models dislike the #4 and #5 picks – DeAndre Hunter and Darius Garland.\n\nPart of the reason Morant has such a large difference is that #2 picks have an unusually low All-Star total. The table below shows the difference in All-Star probability. Notice that only 40% of #2 picks in our data set made an All-Star team, while 56% of #3 picks made one.\n\n|Pick|Player|All-Star % at pick # since 1990|Average prediction|Difference|\n--:|:--|--:|--:|--:|\n|1|Zion Williamson|0.64|0.78|0.14|\n|2|Ja Morant|0.4|0.66|0.26|\n|3|RJ Barrett|0.56|0.50|-0.06|\n|4|DeAndre Hunter|0.32|0.15|-0.17|\n|5|Darius Garland|0.4|0.23|-0.17|\n|6|Jarrett Culver|0.24|0.37|0.13|\n|7|Coby White|0.08|0.22|0.14|\n|8|Jaxson Hayes|0.2|0.45|0.25|\n|9|Rui Hachimura|0.16|0.09|-0.07|\n|10|Cam Reddish|0.12|0.23|0.11|\n\n***\n\n#Conclusion\n\nBecause predicting All-Stars is difficult and depends on more than just college stats, our models are not objectively accurate. Nevertheless, they can provide insight into the All-Star probabilities of the top-10 picks of this year’s draft.\n\nEach of the four models predicts Zion is the most likely player to make an All-Star team. Two of the models give the second spot to Morant, while two of the models give the spot to Jaxson Hayes. Relative to historical All-Stars drafted at each slot, Morant and Hayes appear to be great values, while Hunter and Garland appear poor values.\n\n***\n\n**TL;DR**: [Average predictions graph](https://i.imgur.com/c9JSRWj.png), [value above average All-Star percentage graph](https://i.imgur.com/IySAp4R.png). To see the individual values of these graphs, look at the two tables above.\n\n***\n\nThis is my newest post on my open-source basketball analytics blog, [Dribble Analytics](https://dribbleanalytics.blog).\n\nThe GitHub for the this project is [here](https://github.com/dribbleanalytics/2019-draft-ml).\n\nYou can check out the original piece [here](https://dribbleanalytics.blog/2019/07/2019-draft-ml-all-stars/).", "relevance": 0}, {"search": 2, "content": "Free web app that removes objects/people/text from photos using machine learning ", "relevance": 0}, {"search": 2, "content": "Nicolas Cage Can Now Be Put Into Any Movie in History Thanks to A Machine-Learning Algorithm ", "relevance": 0}, {"search": 2, "content": "Halo 3: Believe (Upscaled to 1080p via AI Machine Learning) ", "relevance": 0}, {"search": 2, "content": "Learn Machine Learning with machine learning.net ", "relevance": 0}, {"search": 2, "content": "[D] Types of Machine Learning Papers ", "relevance": 0}, {"search": 2, "content": "CK3 should use CK2 portraits with machine learning animation. ", "relevance": 0}, {"search": 2, "content": "[OC] Using machine learning to predict the 2019 MVP: mid-season predictions This post has a lot of graphs. If you don't want to click on each one individually, they're all in an imgur album [here](https://imgur.com/a/7SG7dQ4).\n\nThere is a tl;dr at the very end.\n\n***\n\n# Introduction\n\nWith James Harden's recent stretch, the Nuggets' success despite their injuries, and the Bucks maintaining the second seed in the NBA, Harden, Jokic, and Giannis all have strong cases for MVP this year. Though Harden hasn't had the same team success as Jokic and Giannis, he's been averaging an absurd 34.2 PPG - almost 5 PPG more than second place Steph Curry. On the other hand, Jokic has been leading an injury-riddled Nuggets team to the first seed in the West. Along the way, he's had numerous incredible all-around performances, such as Monday's 40/10/8 game against the Trail Blazers. Jokic averages the 9th most assists per game in the league, an unprecedented figure for a center. Meanwhile, Giannis has been posting a hyper-efficient 27/12/6 while leading the Bucks to the NBA's second best record. In addition to these players, Curry and Kawhi have legitimate arguments for MVP, as they've played very well for the best teams in the league.\n\nFor much of the beginning of the season, many saw Giannis as the MVP favorite. However, the race seems tighter now than ever.\n\nTo predict who will win MVP now that we're just past the season's midway point, I created various models that try to predict this year's MVP.\n\n***\n\n#Methods\n\nThis post uses very similar methods to [my post that analyzed the least and most deserving MVPs of the past decade](https://dribbleanalytics.blogspot.com/2018/08/least-most-deserving-mvps.html). Like the initial MVP post, I use a database of all players who placed top-10 in MVP voting since the 1979-1980 season (when the 3-point line was introduced). I measured the following stats for these players:\n\n| Counting stats | Advanced stats| MVP votes | Team stats |\n| ------------- | ------------- | ------------- | -------- |\n| G | WS | MVP votes won | Wins |\n| MPG | WS/48 | Maximum MVP votes | Overall seed |\n| PTS/G | VORP | Share of MVP votes* |  |\n| TRB/G | BPM | |\n| AST/G | | |\n| STL/G | | |\n| BLK/G | | |\n| FG% | | |\n| 3P% | | |\n| FT% | | |\n\n*Share of MVP votes = % of maximum votes received (so Curry's unanimous MVP is a vote share of 1).\n\nFor both this season and lockout seasons, I scaled up win shares, VORP, and wins to an 82 game season.\n\nMy initial MVP post used many of the above stats to predict vote share. The new models used in this post use fewer parameters, as several of the parameters in the previous post introduced collinearity. For example, having VORP, BPM, and MPG together is bad, as VORP adjusts BPM to MPG. For these models, I used only the following stats as parameters:\n\n| Counting stats | Advanced stats | Team stats |\n| ------------- | -------------- | ---------- |\n| PTS/G | VORP | Wins |\n| TRB/G | WS | Overall seed |\n| AST/G | | |\n| FG% | | |\n\nUsing these parameters to predict vote share, I created 4 models:\n\n1. Support vector regression (SVM)\n2. Random forest regression (RF)\n3. k-nearest neighbors regression (KNN)\n4. Deep neural network (DNN)\n\nUnlike the previous MVP post, the models were trained and tested using all data from the 1979-1980 season up until the 2017-2018 season. They then predict the MVP from this year's data. I predicted the MVP vote share for the top-10 players on NBA.com's January 11th MVP ladder.\n\n***\n\n#Where the models fall short\n\nLike we discussed in the previous MVP post, the MVP isn't determined only by who has the best stats. Because the models only know stats, they can't account for other factors that a media member considers when voting for MVP. These include:\n\n- Narrative\n- Expectations; the models don't know that the Nuggets weren't expected to be this good\n- Popularity; the models don't know that Giannis and Harden are much more popular players than Jokic\n- How someone scores their points; the models don't know that Harden shoots a lot of free throws\n- Triple doubles and other arbitrary thresholds\n\nGiven that the models can't account for these factors, one way we can think about these predictions is that I'm evaluating who has the most MVP-like stats out of the players.\n\n***\n\n#Understanding the data\n\nThe models predict the vote share for each of the players who were top-10 in MVP votes. It's important to note that most players will have a very low vote share, as there's usually only a few legitimate MVP contenders; the rest usually get some last place votes. To understand this distribution, I plotted a histogram of the vote share (see below).\n\nhttps://i.imgur.com/4KmOOgZ.png\n\nAs expected, the distribution is not normal. Most of the players had a vote share less than 0.2. This is important to consider, as a skewed dataset like this introduces more variance to the models.\n\n***\n\n#Regression analysis\n\n## Basic goodness-of-fit and cross-validation\n\nThe table below shows the r-squared and mean squared error for each of the four models. A higher r-squared and lower mean squared error indicate a more accurate model.\n\n| Model | r-squared | Mean squared error |\n| ----- | --------- | ------------------ |\n| SVM | 0.708 | 0.028 |\n| RF | 0.628 | 0.035 |\n| KNN | 0.633 | 0.035 |\n| DNN | 0.619 | 0.036 |\n\nAs with the previous MVP post, the models don't have a very high r-squared. For the most part, the models have a higher r-squared and lower mean squared error than the previous post's models, as they had more data. Though the r-squared isn't great, the mean squared is very low. In most MVP races, the winner had a vote share advantage over second place above 0.1. Therefore, because of the low mean squared error compared to the actual vote share difference, we can expect the models to be accurate in predicting the MVP.\n\nTo ensure the models aren't overfitting - or just learning the correct coefficients that yield the best results given the specific split - I performed k-fold cross-validation for r-squared. Ideally, the cross-validated r-squared will be close to the r-squared mentioned above. This would mean the models perform equally well when tested on a different split of the data. The table below shows the cross-validated r-squared scores and their 95% confidence intervals.\n\n| Model | CV r-squared | 95% confidence interval |\n| ----- | ------------ | ----------------------- |\n| SVM | 0.63 | +/- 0.10 |\n| RF | 0.50 | +/- 0.17 |\n| KNN | 0.53 | +/- 0.15 |\n| DNN | 0.57 | +/- 0.02 |\n\nAll the models have a cross-validated r-squared that's decently lower than the initial r-squared. Furthermore, the confidence intervals are wide. Therefore, it's possible the models are overfitting and may perform slightly worse on different data. However, even with these low r-squared values, the mean squared error on different datasets will not change drastically - it'll still be smaller than the usual difference between the MVP winner and second place.\n\n##Standardized residuals test\n\nA standardized residuals test analyzes the difference between the model's predicted and actual values on historical data. To pass the test, the models have at least 95% of their standardized residuals within 2 standard deviations of the mean and have no noticeable trend. Passing the standardized residuals test gives us a first indication that the models' errors are random.\n\nThe graph below shows the standardized residuals of all four models.\n\nhttps://i.imgur.com/GIpOQ9u.png\n\nOnly the RF fails the standardized residuals test. Furthermore, there is no noticeable trend. The only concerning result from the test is the high number of values greater than 2 and below -2. This indicates high variance in the models. However, it's important to note the skewed data likely contributes to this variance.\n\n##Q-Q plot\n\nWhile the standardized residuals test determines if the errors are random, a Q-Q (quantile-quantile) plot examines if the errors are normally distributed. Normally distributed errors are important because they indicate that the model will perform similarly across the entirety of a dataset. In making a Q-Q plot, we're looking for the models' residuals to be as close to a 45-degree (y = x) line as possible - that indicates a normal distribution.\n\nThe graph below is the Q-Q plot for all four models' residuals.\n\nhttps://i.imgur.com/UZ1n8CH.png\n\nThough all four models appear to have residuals pretty close to the red y = x line, there are some considerable jumps at the upper quantiles of the residuals. Each models' residuals appear to be slightly bow-shaped; they rise above the red line at the lower quantiles, fall below it in the middle, and rise again at the upper quantiles. Therefore, it's unlikely the residuals are normally distributed.\n\n##Shapiro-Wilk test\n\nTo truly determine that the residuals are normally distributed, I performed a Shapiro-Wilk test. While the Q-Q plots give a graphical representation of normality, the Shapiro-Wilk test - which returns a W-value between 0 and 1, with 1 meaning the sample is perfectly normal - gives a mathematical answer.\n\nIn addition to the W-value, the test returns a p-value. The null hypothesis of the test is that the data is normally distributed. Therefore, a p-value &lt; 0.05 means the data is not normally distributed, as we reject the null hypothesis when p &lt; 0.05.\n\nThe table below shows the results of the Shapiro-Wilk test.\n\n| Model | W-value | p-value |\n| ----- | ------- | ------- |\n| SVM | 0.94 | &lt; 0.01 |\n| RF | 0.88 | &lt; 0.01 |\n| KNN | 0.90 | &lt; 0.01 |\n| DNN | 0.97 | 0.04 |\n\nThe results confirm what we suspected from the Q-Q plot; no model returned normally distributed residuals. Though this is concerning, it doesn't invalidate the models.\n\n##Durbin-Watson test\n\nThe Durbin-Watson test examines whether the models' residuals have autocorrelation, meaning there is a self-repeating trned in the residuals. Essentially, if the models have significant autocorrelation, they're making the same mistake over and over. The test returns a value between 0 and 4, where a value of 2 indicates no autocorrelation. Values between 0 and 2 indicate positive autocorrelation, meaning if one point is higher than the previous, then the next point is likely to be even higher. Values between 2 and 4 indicate negative autocorrelation, meaning that the points are likely to have the opposite change from the previous points.\n\nThe table below shows the results of the Durbin-Watson test.\n\n| Model | DW-value |\n| ----- | -------- |\n| SVM | 1.77 |\n| RF | 1.81 |\n| KNN | 1.85 |\n| DNN | 1.69 |\n\nAll the DW-values are between 1.5 and 2, indicating there's minimal autocorrelation.\n\n##Would we benefit from more data?\n\nCurrently, the data has two limits. First, it only goes back to the 1979-80 season so that it only includes players in the 3-point era. Second, it only includes players top-10 in MVP votes, so we could gain a few more datapoints by including everyone who received MVP votes.\n\nI think the second limitation would hurt the models if removed, as it would further skew the distribution toward low vote shares. To examine if we'd benefit from more data, I plotted the learning curve for r-squared and mean squared error (MSE) for each model.\n\nhttps://i.imgur.com/cCy7ZFe.png\n\nhttps://i.imgur.com/N3Bnmch.png\n\nThe lines appear to get very close for the SVM and DNN, meaning more data is unlikely to help. However, for the KNN and RF, it's possible more data may increase the models' accuracy. Given the primary way to add data to this problem is to consider all players who received votes - which skews the data - adding more data probably won't help the models.\n\n***\n\n# Results\n\nThe 4 graphs below show each model's results. Each player's current rank in NBA.com's MVP ladder. Note that these predictions were made using data from 1/14 before the games were played.\n\nhttps://i.imgur.com/Vv1q7Fq.png\n\nhttps://i.imgur.com/3L6rZ3j.png\n\nhttps://i.imgur.com/xKj8G6e.png\n\nhttps://i.imgur.com/KDPPNw7.png\n\nAll four models have Giannis as the winner, and Harden as the runner-up. Two models have Jokic coming in third, and the other two models (which have KD and Anthony Davis in third) have Jokic in fourth.\n\nThe graph below is the average predicted vote share of the four models for each player.\n\nhttps://i.imgur.com/OsaEkpH.png\n\nThe average shows that the models have Giannis winning MVP by a decent margin. Harden also has a decent margin on Jokic.\n\n***\n\n#Conclusion\n\nThe models crown Giannis as the MVP half-way through the year. Note that the models can't account for narrative, expectations, or voter fatigue; it's purely a statistical view.\n\nThis may change soon, as Harden scored 57 points the night I ran this analysis. With Capela out for the foreseeable and the Rockets still missing key pieces in Chris Paul and Eric Gordon, it's possible Harden ramps up his already absurd scoring pace, making a strong case for MVP. I'll run the models again with new data around the All-Star break to see if Harden caught up.\n\n***\n\nThis is my newest post with my open-source basketball analytics blog, [Dribble Analytics](http://dribbleanalytics.blogspot.com). The GitHub for this project is [here](https://github.com/dribbleanalytics/ml-mvp-predict).\n\nYou can check out the original piece [here](http://dribbleanalytics.blogspot.com/2019/01/ml-mvp-predict-midseason.html).\n\n***\n\n**Tl;dr: table of results:**\n\n|Rank|NBA.com MVP ladder|SVM|RF|KNN|DNN|**Average prediction**|\n--:|:--|:--|:--|:--|:--|:--|\n|1|Giannis|Giannis|Giannis|Giannis|Giannis|**Giannis**|\n|2|Harden|Harden|Harden|Harden|Harden|**Harden**|\n|3|Curry|Jokic|Davis|Jokic|KD|**Jokic**|\n|4|Kawhi|Kawhi|Jokic|Curry|Jokic|**Kawhi**|\n|5|Jokic|KD|Curry|Kawhi|Kawhi|**KD**|\n|6|PG13|Curry|Embiid|KD|PG13|**Curry**|\n|7|Embiid|Davis|PG13|Embiid|Embiid|**Davis**|\n|8|LeBron|PG13|Kawhi|LeBron|Davis|**Embiid**|\n|9|KD|Embiid|KD|PG13|Curry|**PG13**|\n|10|Davis|LeBron|LeBron|Davis|Lebron|**LeBron**|", "relevance": 0}, {"search": 2, "content": "Let's confuse machine learning :) ", "relevance": 0}, {"search": 2, "content": "Wolverine will feature machine learning upscaling, possibly hinting at the PS5 Pro supporting this technology [**Source**](https://preview.redd.it/omhl7omm9y9c1.png?width=2100&amp;format=png&amp;auto=webp&amp;s=2493e1c47c328f038ff394fc2cf0afcdc4699bf4)\n\nThe original (potentially bogus) PS5 Pro rumor from Resetera [mentioned dedicated machine learning silicon for the purpose of AI upscaling.](https://www.resetera.com/threads/tom-henderson-ps5-pro-specs-and-release-window-details-codenamed-trinity-30wgps-18000mts-memory-speed-november-2024-target.744703/page-63?post=116078280#post-116078280) The base PS5 wouldn't be able to support AI upscaling (it lacks dedicated hardware plus it's missing the DP4a instructions found in vanilla RDNA2). \n\nThat being said, it could possibly mean neural-network texture upsampling, [which was featured in God of War: Ragnarok](https://www.gdcvault.com/play/1028824/Machine-Learning-Summit-Real-Time), but the word \"upscaling\" here seems very deliberate. I will flair this as a grain of salt regardless.", "relevance": 0}, {"search": 2, "content": "Machine Learning in a nutshell ", "relevance": 0}, {"search": 2, "content": "Upcoming ‘Machine Learning’ set - via @ShiinaBR ", "relevance": 0}, {"search": 2, "content": "Android 12 may use machine learning to fix the Back Gesture Problem ", "relevance": 0}, {"search": 2, "content": "Using Machine Learning to Find Modern Goalkeepers in Europe Last thursday's debacle appeared to be the nail in the coffin for David De Gea. At least from a fan's perspective. The reality is, we will never be able to reach the recent heights that Manchester City and Liverpool have reached, without a playmking goalkeeper.\n\nIt is extremely clear that ETH wants us to build from the back more, but this process is impeded by DDG's on the ball abilities. So I decided to use some simple machine learning algorithms to try to seeth through all the goalkeepers in the top 5 leagues, and identify viable, playmaking GK targets.\n\nAll data comes from: [https://fbref.com/en/comps/Big5/keepersadv/players/Big-5-European-Leagues-Stats](https://fbref.com/en/comps/Big5/keepersadv/players/Big-5-European-Leagues-Stats)\n\n## The Metrics\n\nBefore I go into the metrics used, let me clarify something. On all my charts, I want the high value to mean \"good.\" However, some values, like \"Avg Length of Pass\" are \"good\" when they're smallest - as this would indicate a GK's tendency to play shorter passes. So I've reversed those values on the charts so that a high value still means good. This is why some variables, (listed below) start with the prefix \"Rev.\" Note also that all values on the charts have been standardized (scaled to be between 0 and 1.)\n\nIf this is too confusing, just remember this - on the charts, the higher the value looks, the \"better\" it is for that metric for a playmaking GK.\n\nI will evaluate playmaking keepers based on 8 metrics, listed below. All stats per 90.\n\n* **Passes\\_Att**: The number of passes attempted, not including GK.\n* **Rev\\_Goal Kicks\\_AvgLen**: The average length of a Goal Kick pass.\n* **Rev\\_Goal Kicks\\_Launch%**: The percentage of Goal Kicks that were launched (passes greater than 40 yards).\n* **Rev\\_Passes\\_AvgLen**: The average length of a **Non** Goal Kick pass.\n* **Rev\\_Passes\\_Launch%**: The percentage of **Non** Goal Kicks passes that were launched (passes greater than 40 yards).\n* **Sweeper\\_AvgDist**: The average distance from goal in all defensive actions.\n* **Sweeper\\_#OPA**: Defensive actions outside of the penalty area.\n* **Crosses\\_Stp%**: Percentage of crosses in the penalty area that were successfully stopped by the GK.\n\n## The Problem\n\n## Far from the Elite\n\nSo let's see how DDG compares to two of the best playmaking goal keepers, Alisson and Ederson. Note that I'm not doing this to harp on DDG. I just want to show how these metrics really are reflective of playmaking GKs, and establish a foundation for what we need to look out for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p39rkwsgeava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=290ba99e6e2ff9bfc41485a4015c00f025c0b2b8\n\nTo the surprise of absolutely no one, Alisson and Ederson far outperform DDG in all metrics. They play more passes per game, shorter passes both from goal kicks and open play, launch a much smaller percentage of both goal kicks and open play passes (suggesting a higher tendency for short passes.) They are also both better sweeper keepers, although Alisson is a much better sweeper keeper than Ederson. But they both have very good command of their penalty box.\n\n## Inability to Build up from Goal Kicks\n\nNow, it feels a little unfair to compare him to two of the best playmaking GKs, so let's compare him to the average keeper across the top 5 leagues.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/uguu9tyheava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=171f157e6150c57e3231d2bed644701de23a63e3\n\nSo there are a lot of things that are bad here. Overall, he's basically worst than the average GK in all the top 5 leagues. But there are certain areas that are more important that others. He's slightly above average in open play passes, but when it comes to goal kicks, he's far worst than the rest.\n\nThis essentially means that we end up launching most of our goal kicks, which takes away from our inability to play from the back. Notice also how his passes attempted are very low, suggesting that he has very minimal involvement in the build up.\n\n## Takeaway\n\nOkay so, now, hopefully, you will trust that those metrics are indicative of playmaking GK. And understand what we are really missing with DDG. So time for the machine learning to come in.\n\n## Clustering Analysis.\n\nSo, we will use a very basic clustering analysis here, called K-means. I'm not going to go in the details of the algorithm or other steps that I took to run it, but at a high level, K-means is an algorithm that finds clusters of goalkeepers with similar abilities.\n\nThe goal is that one of those clusters comprises of goalkeepers with good playmaknig attributes, like Alisson and Ederson. And then, we can do a deep dive into goalkeepers within that cluster to find out who we should be targetting.\n\n## Visualizing Clusters\n\nThe analysis found 4 clusters in the data, i.e., 4 \"types\" of goal keepers based on their playmaking attributes. One way to visualize it is to use a method called PCA that can essentially reduce all of our 8 attributes into 2, and then visualize the groups by plotting the two newly created attributes:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1yrgy4sjeava1.png?width=571&amp;format=png&amp;auto=webp&amp;s=4ae9fa661b1e03729590b2bdbaa89489907c9295\n\nEach dot in the plot above represents a goalkeeper. The 2 axes are essentially a combination of the 8 variables we started with. So goalkeepers that are close together on both axes, are goalkeepers that share similar playmaking attributes. Here, we can see four groups that our clustering algorithm has identified.\n\n## Describing the Clusters\n\nNow, let's look at the individual goalkeepers within the clusters, and get an average of playmaking stats for each cluster. This will tell us what the clusters really represent.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zgo6yq2leava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=b07145c031bc03c3e51dc4c93bcddc7d4affe828\n\nThe chart above represents the average metric for each goalkeeper in a given cluster. Let's go through them one at a time\n\n* **Cluster 0**: This is the blue cluster that's barely visible because it is so small. This is essentially a cluster where all goalkeepers are bad playmakers on all front, and bad sweepers.\n* **Cluster 1**: The red cluster here is by far and away the best cluster. This is the group of goal keepers with the best playmaking abilities, and also goalkeepers with good sweeping abilities\n* **Cluster 2**: Good sweepers, bad playmakers. GKs in this cluster have good sweeping attributes, but are typically really bad playmakers.\n* **Cluster 3**: Average playmakers, bad sweepers. This is the one DDG is in, but he's a worst playmaker than most in that group.\n\n## Targets from Optimal Clusters\n\nThere is clearly one cluster that is optimal here, Cluster 1. So, I took a look at the GKs in cluster 1 and identified realistic targets. First, I removed any unrealistic GK. As you can imagine, Ederson and Alisson were in this group, so the likes of them are not considered realistic.\n\nI put a filter on age - seeing as we should be rebuilding for the future. I only consider GKs who are 30 years old or younger. Lastly, we also want our GK to be good shot stoppers, so I used the PSxGA metric, which is essentially a number that summarizes a GK ability to stop shots. Positive numbers suggest better luck or an above average ability to stop shots. So I filetered the cluster for only positive values of that metric. Below are the identified targets, including DDG as a reference point:\n\n||Player|Squad|Age|Expected\\_/90|Passes\\_Launch%|Passes\\_AvgLen|Goal Kicks\\_Launch%|Goal Kicks\\_AvgLen|Crosses\\_Stp%|Sweeper\\_#OPA|Sweeper\\_AvgDist|Passes\\_Att|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|27|Ivan Provedel|Lazio|29|0.12|28.8|33|35.4|34.7|4.1|1.51|16.6|29.9|\n|46|Brice Samba|Lens|29|0.12|34.3|32.7|26.2|29.3|7.3|1.23|16.7|29.2|\n|22|Gregor Kobel|Dortmund|26|0.09|21.7|29.4|42.5|37.8|4.9|1.57|17.3|32.7|\n|59|Alex Meret|Napoli|26|0.04|14.9|26.2|20.6|27.1|3.4|1.07|17|22|\n|75|David de Gea|Manchester Utd|33|\\-0.08|31.6|31.6|65.5|48.3|3|0.83|14.5|27.1|\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wg0ah87oeava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=80d629ac65c78ac643aa68fd27dc282003ce8002\n\nNow, I don't actually know anything about these goalkeepers, I'm just a numbers guy. That being said, they statistically look like better and more modern GKs than DDG. They all have far superior playmaking abilities and sweeping abilities.\n\n## Targets from Sub-Optimal Clusters\n\nWe're not done quite yet. There was one more cluster that I described as \"Decent playmakers, bad sweepers.\" Now, the cluster overall may be so, but some GKs in there might be on the upper end of the range in given metrics. They may be good playmakers and below average sweepers.\n\nI won't lie, this part of the analysis was a lot of eye balling, but nonetheless, here are 3 other GK who are better open play playmakers than DDG, but not necesasrily better sweepers:\n\n||Player|Squad|Age|Expected\\_/90|Passes\\_Launch%|Passes\\_AvgLen|Goal Kicks\\_Launch%|Goal Kicks\\_AvgLen|Crosses\\_Stp%|Sweeper\\_#OPA|Sweeper\\_AvgDist|Passes\\_Att|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|55|Yehvann Diouf|Reims|24|0.29|29.7|32.3|32.9|33.8|9.3|1.13|12.7|27.3|\n|101|Anthony Lopes|Lyon|33|0.08|32.2|32.4|31.1|32.4|5.5|0.58|12.7|24.6|\n|84|Michele Di Gregorio|Monza|26|0.05|30.5|32.4|35.3|33.4|3.1|0.72|12.4|32.8|\n|75|David de Gea|Manchester Utd|33|\\-0.08|31.6|31.6|65.5|48.3|3|0.83|14.5|27.1|\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l9muet1peava1.png?width=800&amp;format=png&amp;auto=webp&amp;s=13f33e56a921520cbeafd01c326db0780cfd77a0", "relevance": 0}, {"search": 2, "content": "TikTok is now using machine learning for certain filters (e.g. \"Bold Glamour\") making them even harder to distinguish. ", "relevance": 0}, {"search": 2, "content": "Is machine learning really machine learning? I have been asked if machine learning is machine learning or machine learning is machine learning. I will take the view that there is no such thing as machine learning. \n\nMy point is, machine learning is a way of making machine learning. That is, machine learning is a very limited set of concepts. If you have machine learning or machine learning is machine learning then you have machine learning and machine learning are two different things. \n\nI am not saying machine learning is not machine learning, but it is not machine learning.", "relevance": 0}, {"search": 2, "content": "Machine Learning ", "relevance": 0}, {"search": 2, "content": "Machine learning ", "relevance": 0}, {"search": 2, "content": "Machine Learning: Machine Learning, Machine Learning, Machine Learning ", "relevance": 0}, {"search": 2, "content": "forThatWeUsedANeuralNetworkButWhatIsMachineLearning ", "relevance": 0}, {"search": 2, "content": "Machine learning drugs ", "relevance": 0}, {"search": 2, "content": "/u/ptitz learns some hard truths about Machine Learning. ", "relevance": 0}, {"search": 2, "content": "I created a complete overview of machine learning concepts seen in 27 data science and machine learning interviews Hey everyone,\n\nDuring my last interview cycle, I did 27 machine learning and data science interviews at a bunch of companies (from Google to a \\~8-person YC-backed computer vision startup). Afterwards, I wrote an overview of all the concepts that showed up, presented as a series of tutorials along with practice questions at the end of each section.\n\nI hope you find it helpful! [ML Primer](https://www.confetti.ai/assets/ml-primer/ml_primer.pdf)", "relevance": 0}, {"search": 2, "content": "Realistic faces of Roman emperors recreated using machine learning by digital artist Daniel Voshart ", "relevance": 0}, {"search": 2, "content": "Machine learning went wrong? ", "relevance": 0}, {"search": 2, "content": "Apple's Director of Machine Learning Resigns Due to Return to Office Work ", "relevance": 0}, {"search": 3, "content": "[D] Is Computer Vision dead? - “Quo Vadis, Computer Vision?” In ICCV23, several top notch researchers [shared their insights](https://tenyks.docsend.com/view/rzim7ah3h5hbaqs4) (in a workshop called “Quo Vadis, Computer Vision?”) wrt the current state of Computer Vision, especially in light of the meteoric raise of LLMs. Has CV stalled? Is CV dead?\n\nE.g.MIT’s professor Bill Freeman, has some interesting points on foundation models: “FM aren’t fundamental, therefore not stable\". Jitendra Malik argues \"video can describe the world better than text.\"", "relevance": 0}, {"search": 3, "content": "Computer vision has been solved internally ", "relevance": 0}, {"search": 3, "content": "How hard is computer vision as a field? Hello folks.\n\nI had some questions about the field. A little bit of background. One of my friends is persuing her PhD from a well known American University in CV. She tells me that the field is extremely hard to do research in as it is extremely saturated. She sees that older PhD are working upto 18 hours a day, and not even going back home during the weekdays. She also mentions that after PhD, a job in the industry will result in the same lifestyle. Is there any truth to these statements?\n\nThanks in advance", "relevance": 0}, {"search": 3, "content": "The hitchhikers guide to computer vision Hey there,\n\nThis is my first blog post ever - it is a summary of all the good knowledge that I have in the computer vision area. It is not a tutorial or how-to-use-something post, but rather a set of links, tips, lifehacks. Covers data governance, mlops, tools, courses. I tried to make it practical and useful. Link to the origin: [The Hitchhiker's guide to computer vision](https://irregularadel.substack.com/p/the-hitchhikers-guide-to-computer-21-04-28?r=l7n3m&amp;utm_campaign=post&amp;utm_medium=web&amp;utm_source=copy)\n\nSo, are you tired of this towardsdatascience/medium tutorials and posts about deep learning? Don’t panic. © Take another one.\n\n&amp;#x200B;\n\n[I was thinking to add some DL meme at the beginning and my friend come up with this. Adel is me, by the way \\( ͡❛ ᴥ ͡❛\\) ](https://preview.redd.it/jmhcpovghyv61.jpg?width=1076&amp;format=pjpg&amp;auto=webp&amp;s=eedf09c31fc497682b4dffed470f60efbb4a1617)\n\nSo, as I said, there are so many educational resources around the deep learning area that at some point I found myself lost in all that mess. There are tons of towardsdatascience/medium tutorials on how to use something, and most of them are on a beginner’s level (although I enjoined some of the articles).\n\nI felt that there should be something higher than “piece of cake” or “bring it on” levels. Like “hardcore” or even “nightmare”. In the end, I want resources that will bring value, and not something I already know. I don’t need detailed tutorials (well, usually), instead, I want to see directions. Some reference points from where I can start my own path. And it may be the case, that I can write such an article for others, who feel the same way.\n\nSo I came to the idea of a short “how-to-and-how-not-to” post on the computer vision area (mostly from DL perspective). Some links, tips, lifehacks. Hope it will create adding value for someone. And hope it won’t be yet another boring tutorial.\n\nFinally, a small disclaimer: these are my personal beliefs and feelings, they are not necessarily true. Moreover, I feel that some of the points are not optimal solutions, and I would be happy if someone will propose a better option.\n\nEnjoy!\n\n## Now, let’s start with the tools and infrastructure, for your CV research.\n\nIn general, several areas should be presented in your projects. There are a huge number of options in each area, and you can easily get lost. I believe that you should just choose one sample from each area and stick to it. These areas are:\n\n* Starting from simple. **Language** — without doubts, python. Others are way below. (Sorry R and [Matlab ](https://pics.me.me/pytorch-tensorflow-matlab-source-unknown-deep-learning-frameworks-war-52460350.png)users).\n* **IDE** — what IDE you will use? I personally use PyCharm, but know a lot of people who use VS Code. I know that there are Jupyter notebooks, google colabs. [Deepnote ](https://deepnote.com/)is quite a good tool as well. In fact, they all are nice, but not for proper R&amp;D nowadays. Don’t get me wrong, I love Jupyter notebook and use it a lot, but let’s be honest, it is not IDE, but rather a research prototyping environment. A combination of jupyter notebooks and proper IDE will boost your projects a lot.\n* **Frameworks** — today there are only two main players in this area: Pytorch and Tensorflow. There are hundreds of comparison articles, and both frameworks are great (some [fresh discussion](https://www.reddit.com/r/MachineLearning/comments/k6n8m5/d_revisiting_the_tensorflow_vs_pytorch/) on Reddit). Again, just choose what you like the most and never regret it. My choice is Pytorch — like it as hell. There also wrappers of these frameworks, I use[ Pytorch Lightning](https://www.pytorchlightning.ai/) — amazing stuff. There is a good [ecosystem around Pytroch](https://pytorch.org/ecosystem/) and sometimes I found something interesting and new there. Probably there is a similar thing for Tensorflow (sorry, too lazy to check)\n* **Data management** — very important and undeservedly ignored by the majority of people. There are amazing speeches of Andrej Karpathy about data importance, very inspiring — highly recommend ([this](https://slideslive.com/38917690/multitask-learning-in-the-wilderness) and [this](https://www.youtube.com/watch?v=hx7BXih7zx8) — they are about a lot of things, tbh, but also about the importance of data). This is one of his slides that tells a lot. I use [DVC](https://dvc.org/) for data version control — we also created a [data registry](https://dvc.org/doc/use-cases/data-registries) in our team. We keep track of all the changes in original raw data there (adding new data, reannotations, changes). Enjoying it a lot. Nice developing is happening in Activeloop: [Hub](https://github.com/activeloopai/Hub) is interesting solution and worth attention. Important thing: metadata is highly valuable as well. Never underestimate its importance. Data labeling could be a separate chapter, but I decided to put it here. Again, tons of image annotation tools on the market: choose the one that fits your need. We use [supervisely](https://supervise.ly/) at the moment, super convenient in distributed labeling. In general, be prepared to spend a lot of time on data: structuring, cleaning, labeling, visualizations, etc. — all that is, in my opinion, way more important than actual straight ML/DL stuff. This is just something you should deal with. So keep calm, and spent time on data. More about data management is [here](https://fullstackdeeplearning.com/spring2021/lecture-8/).\n\n&amp;#x200B;\n\n[ I a bit remade the image to make text more visible. ](https://preview.redd.it/byx7dmxjhyv61.png?width=1988&amp;format=png&amp;auto=webp&amp;s=3d9391cd22b23f87d15dd5134d337dae1ce89557)\n\n* **MLOps** — something that everyone starts to talk about. To simplify: this is DevOps in the ML area. Probably, DVC can be related here as well. MLops is everything you will need to create a nice infrastructure for your ML projects. That includes experiments tracking, comparing, reproduction, models saving/tracking, CI/CD stuff that you can use. The market is full of free and paid packages. We use [MLFlow](https://mlflow.org/) and like it a lot. We have an MLFlow server with a minio backend, we store all our team experiments there. At the same time, we have [a Model registry](https://mlflow.org/docs/latest/model-registry.html), that helps a lot in production. It gives us version control over the models and an easy way to load them. MLflow is not the only solution, of course. Take a look at others: [W &amp; B](https://wandb.ai/site), [comet](https://www.comet.ml/site/), [neptune](https://neptune.ai/). Also, nice free book: [Introducing MLOps](https://pages.dataiku.com/oreilly-introducing-mlops) from O’Reilly &amp; DataikuPlus some combination of this and previous bullet points: MLOps: From [Model-centric to Data-centric AI](https://www.youtube.com/watch?v=06-AZXmwHjo) lecture from Andrew Ng.\n\n## Let’s go to the methods and algorithms.\n\nCV is the most advanced field in DL (sorry NLP enthusiasts) and that causes the large variety of cool models/methods. On the other hand, each freaking day there is something new. Still, there are some classical constants that barely change. (in fact, if you are not into fundamental research, you can just choose some proven techniques and they will work. Well, most likely.)\n\n* There are always some SOTA back-bone architectures, and they are quite constant. Resnets are a good baseline, se\\_resnexts are usually way better. Efficient nets are also awesome. Unets are a solid choice for segmentation. FasterRCNN, yolos — for detection. MaskRCNN for instance segmentation (but usually you want a separate classification part).\n* A lot of nice Github repos on models mentioned above. Just google it, and find the one you like (or the one that fits in the current situation). For example, I enjoy this [pytorch segmentation repo](https://github.com/qubvel/segmentation_models.pytorch). Or this [efficient-net package](https://github.com/lukemelas/EfficientNet-PyTorch).\n* Resources — first of all, [ml in reddit](https://www.reddit.com/r/MachineLearning/). All cool stuff ends up being posted there anyway, so this is a must-read resource. Then, Twitter (sorry). I am subscribed to guys like mentioned earlier Andrej Karpathy. Find the ones you respect and believe in and follow them. You can also subscribe to official Pytorch/Tensorflow/You-name-it accounts, they announce and retweet a lot of cool stuff as well. Best courses I’ve seen: from [fast.ai](https://www.fast.ai/) (good DL for coders + SOTA algorithms discussed), [Full Stack Deep Learning](https://fullstackdeeplearning.com/) — just the best practical course I’ve seen. [Basics of conv nets](http://cs231n.stanford.edu/) from Stanford — classic. Kaggle is the perfect way to follow on development of the best tricks and techniques (crazy augmentations like mix up, cutmix, tricky loss functions, multi-head networks etc.). The creativeness of sportsmen (and people there are real sportsmen imho) never stops to surprise me. Plus there are usually winning solution blog post, so keep an eye on them\n\nSome words about GPUs\n\nMiners blow the market and GPUs costs like spaceship now. But anyway, there are different options you can use, either you buy your own GPUs or borrow them in the cloud. It is relatively easy to come up with some AWS or Google cloud solutions. Also, in my experience, for most of the tasks, a few 10\\*\\*/20\\*\\* are already a solid choice at the beginning. Of course, that depends on the task and data, but most likely you can survive with smaller scales for a while.\n\n&amp;#x200B;\n\n[ But, boi, how satisfactory is it to work with big GPUs. ](https://preview.redd.it/22x8zmplhyv61.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=b97920502a4f036490192e38e89d12c80d318b22)\n\nHope I didn’t forget anything important!\n\nI wish that could help someone in this crazy world of computer vision.\n\nGood luck!", "relevance": 0}, {"search": 3, "content": "Is it worth to learn computer vision? Hello all!  \nI am currently learning and trying to find some work in the field of web development.  \nIn the mean time, I was wondering if I could get into another field of computer science that's you know a bit interesting and one could do some great work.  \nI have studied a bit what computer vision is and have worked on some pretty projects. But I am not sure if I should get into this field. Because I couldn't really find that many jobs for this field and most of them required pretty good university degrees!  \n\n\nDo you people think I should continue studying in this field or should I look into another field?", "relevance": 0}, {"search": 3, "content": "How is computer vision now? Haven't heard many updates about it. Although there were many scary stories about CV, some people like me who wishes to specialize in computational perception and robotics may need to attend the course. \n\nI looked at the omscentr and tried to search reviews on reddit, but it seems the reviews are actually really difficult to find. The latest review on the omcentral is from like May, which is like half a year ago..\n\nIs it still horrific? Is the way of running the course still far from ideal? Let me know how CV is in recent terms.", "relevance": 0}, {"search": 3, "content": "[D] Has Computer Vision become oversaturated? Are there even any unsolved problems left? With things like Stable Diffusion, image processing pipelines on phones that incorporate SOTA super resolution, low-light enhancement, segmentation papers that one would only have dreamt of even a few years ago, and with research appearing increasingly incremental rather than definitive and new, it feels like the entire space of computer vision, image signal processing and computational photography has essentially got saturated, and at this point, the only thing that people care about is how to make their personal Anime character in Midjourney or how close the latest Samsung (or other Android brand's) flagship phone's photo- (and video-) graphy is to the latest iPhone.\n\nIs it just me, or has the entire field saturated to the point that it's probably not worth even trying to do anything new and to probably just make incremental updates to things like Super Resolution, Low Light Enhancement, and Denoising algorithms for the rest of eternity?\n\nI've been working on reimplementing the Real-ESRGAN paper, and it took me a huge amount of time, but I only ended up getting results subpar to it, and even then, the sheer amount of processing it requires is so daunting that it doesn't feel worth trying to train it on a completely new dataset...\n\nAre there any unsolved problems left that are worth cracking, that would actually make people's lives easier in this field?", "relevance": 0}, {"search": 3, "content": "How to pursue a career in AI/Computer Vision? Hey, I'm a 4th year Computer Engineering student, graduating next semester and I've recently picked up an interest in both AI and Computer Vision. I don't have any coursework in these two fields but I do have an adequate background in software. \n\n&amp;#x200B;\n\nWhat kind of online courses/certificates/etc would you recommend to help me build up my resume to apply for internships and eventually jobs in these fields? I was thinking of doing some courses on Coursera and would really appreciate some feedback or advice that you may have. Thanks", "relevance": 0}, {"search": 3, "content": "Feeling hopeless about possible computer vision syndrome I work a lot on computers for my job (and in my free time) and started experiencing frequent eye strain (headaches, dry eyes, fatigue) about 1.5 years ago.\n\nMy original prescription was:\n\nOS -5.75 -0.5 1.75 (SPH CYL AXIS)\n\nOD -7.50 -0.5 1.75 (SPH CYL AXIS)\n\nI talked to my \"primary\" optometrist, he lowered my prescription 0.5 diopters on an old pair of frames I had. I kept experiencing symptoms so we lowered them another 0.5 diopters (ending up at -4.75/-6.50).\n\nSome of the traditional eye strain symptoms decreased, but I started having other symptoms like dizziness, nausea, and \"foggy-headedness\" instead. I saw an opthamologist, he said my eyes were fine and to talk to my optometrist again. I talked to my primary care physician, he said there was nothing else wrong with me.\n\nI talked to a different optometrist who is a little more knowledgeable about eye strain. He prescribed me even weaker lenses (about a 1.25 diopters less from my original prescription) and added prism and astigmatism correction:\n\nOD -4.50 -0.50 x10 1.5BI\n\nOS -6.25 -0.75 x25 1.5BI\n\nI've been wearing these lenses for a month or two now and I'm still getting the same symptoms, but to a slightly less severe degree.\n\nIt's pretty frustrating because I've tried making all sorts of changes to my work environment as well (e.g. lighting, posture, using eye drops, taking frequent breaks), but nothing seems to be getting rid of this problem for good. Am I just going to have to learn cope for the rest of my life?", "relevance": 0}, {"search": 3, "content": "My friend was working at a computer vision company trying to detect nudity ", "relevance": 0}, {"search": 3, "content": "AI Punch Stats using Computer Vision and Deep Learning. WDYT? ", "relevance": 0}, {"search": 3, "content": "Tesla Achieved The Accuracy Of Lidar With Its Advanced Computer Vision Tech ", "relevance": 0}, {"search": 3, "content": "computer vision ", "relevance": 0}, {"search": 3, "content": "Computer vision park assist is sh*t ", "relevance": 0}, {"search": 3, "content": "Tesla computer vision reminds me the way terminator see the world ", "relevance": 0}, {"search": 3, "content": "Google develops computer vision accurate enough to solve its own CAPTCHAs ", "relevance": 0}, {"search": 3, "content": "Making €6,147,455 Overnight in in-game currency using Computer Vision # A Python bot used to play the game 'City Island'\n\nGameplay:\n\nhttps://reddit.com/link/z8qstu/video/596siu9n533a1/player\n\n[For example: Closing a popup](https://i.redd.it/tdeex2b3333a1.gif)\n\n# Why?\n\nI've been playing strategy + city building + simulation? games like **TownsMen 6**, **Clash of the Clans**, and SimCity for the last 10 years.\n\nOn trying out **City Island 5** I found it mildly irritating that my collectables could not accumulate while I was outside the game. I might have had the best businesses, strategy, etc but I had to be in the game to ensure I collect the cash/keys/gold over time. For example, if my bakery makes €100 per minute I would only earn €100 after leaving the game and coming back 24 hours later.\n\nThis became especially tiresome while trying to accumulate €5,000,000 required to buy the island shown below. This would take me roughly two weeks of gameplay if I don't spend any money - it's not worth it.\n\n&amp;#x200B;\n\n[Island I wanted to buy](https://preview.redd.it/6x6t11ig333a1.png?width=1990&amp;format=png&amp;auto=webp&amp;s=a836a96daa48ab5649edcfef8eb94baf5a2d4738)\n\n&amp;#x200B;\n\nThis is a problem that can be solved using one of the greatest tools in my tool belt - programming.\n\nI decided to create a Python bot used to play the game using computer vision and image processing techniques. The bot should be able to play the game without any human intervention.\n\n\\---\n\n# Results after running overnight\n\nI started the game with €316,415:\n\nhttps://preview.redd.it/he8i7q9y433a1.png?width=3360&amp;format=png&amp;auto=webp&amp;s=b809f95311c59055abcc267841a94eb5a79882d9\n\nThe following morning I had €6,463,870:\n\nhttps://preview.redd.it/t1w46e9d433a1.png?width=3360&amp;format=png&amp;auto=webp&amp;s=4e8f9b901bd85897220e5f67d5bfdb1f6263e33c\n\nI made €6,147,455 overnight!\n\nI then proceeded to buy the Island I wanted:\n\nhttps://preview.redd.it/h4fd7ehf433a1.png?width=3360&amp;format=png&amp;auto=webp&amp;s=aefc5ce2c53d4395f4b871752b5a6df901ef689f\n\n# Source code &amp; guide\n\nA basic guide on how I achieved it - [https://paulonteri.com/thoughts/play-game-with-computer-vision](https://paulonteri.com/thoughts/play-game-with-computer-vision)\n\nSource code - [https://github.com/paulonteri/play-game-with-computer-vision](https://github.com/paulonteri/play-game-with-computer-vision)", "relevance": 0}, {"search": 3, "content": "I programmed a computer vision application to solve algebra ", "relevance": 0}, {"search": 3, "content": "My job search with a Master's in Computer Vision and AI AMA", "relevance": 0}, {"search": 3, "content": "Computer vision in action! This ingenious system understands the cube's current status and offers a hint on what the next move should be ", "relevance": 0}, {"search": 3, "content": "Made a computer vision basketball referee ", "relevance": 0}, {"search": 3, "content": "Computer Vision Engineer Hey there I am a grad student interested in computer Vision. Can someone help me out what does the industry demand from a new grad. Is there any algorithms I need to learn or etc.", "relevance": 0}, {"search": 3, "content": "Apple Vision Pro review: This is the future of computing and entertainment ", "relevance": 0}, {"search": 3, "content": "Zapo — Computer Vision ", "relevance": 0}, {"search": 3, "content": "1979 Atari's vision of a computer programmer ", "relevance": 0}, {"search": 3, "content": "A.I. Punch Stats using Computer Vision [Throwback Thursday] #6 ", "relevance": 0}, {"search": 3, "content": "A.I. Punch Stats using Computer Vision [Throwback Thursday] #9 ", "relevance": 0}, {"search": 3, "content": "Defect Detection using Computer Vision Hello,\n\nNewbies here. \nI'm currently doing my FYP which requires me to develop a vision system to detect a defect in plastic chip carrier.\n\nMy question is, what is the best pre-train model that I can use for this kind of product and is it possible for me to use Jetson Nano development kit for this project?\n\nThanks", "relevance": 0}, {"search": 3, "content": "Computer Vision  Let us say I detect a bunch of corners of an object in multiple images , I am trying to reproject to find the 3D world coordinate I have the camera intrinsically like camera position, fx , fy ox oy etc how can I better estimate the 3 D point which algorithm should I use for this? ", "relevance": 0}, {"search": 3, "content": "Viseron 2.0.0 - Self-hosted, local only NVR and AI Computer Vision software. Viseron is a self-hosted NVR deployed via Docker, which utilizes machine learning to detect objects and start recordings.\n\n**v2.0.0 was just released which features a lot of improvements, including a fresh new frontend interface**\n\nCheck out the release notes: [https://github.com/roflcoopter/viseron/releases/tag/v2.0.0](https://github.com/roflcoopter/viseron/releases/tag/v2.0.0)\n\nViserons features include, but not limited to the following:\n\n* Object detection via:\n   * YOLOv3, YOLOv4 and YOLOv7 Darknet using OpenCV\n   * Tensorflow via Google Coral EdgeTPU\n   * [DeepStack](https://docs.deepstack.cc/)\n* Motion detection\n* Face recognition via:\n   * dlib\n   * [DeepStack](https://docs.deepstack.cc/)\n   * CompreFace\n* Image Classification\n* Responsive, mobile friendly Web UI written in TypeScript React\n* MQTT support\n* [Home Assistant](https://home-assistant.io) MQTT Discovery\n* Lookback, buffers frames to record before the event actually happened\n* Supports hardware acceleration on different platforms\n   * CUDA for systems with a supported GPU\n   * OpenCL\n   * OpenMax and MMAL on the RaspberryPi 3B+\n   * video4linux on the RaspberryPi 4\n   * Intel QuickSync with VA-API\n   * NVIDIA video4linux2 on Jetson Nano\n* Multiplatform, should support any amd64, aarch64 or armhf machine running Linux. Specific images are built to support:\n   * RaspberryPi 3B+\n   * RaspberryPi 4\n   * NVIDIA Jetson Nano\n* Zones to limit detection to a particular area to reduce false positives\n* Masks to limit where object and motion detection occurs\n* Stop/start cameras on-demand over MQTT\n\nCheck out the documentation here: [https://viseron.netlify.app/](https://viseron.netlify.app/)\n\n[https://github.com/roflcoopter/viseron](https://github.com/roflcoopter/viseron)\n\n I am really interested in feedback and features that you would like to see implemented. I respond to all comments here on Reddit, the Home Assistant forum thread or GitHub issues. \n\nI hope you'll find this useful!\n\nSome screenshots:\n\n&amp;#x200B;\n\n[Cameras](https://preview.redd.it/6khu1ynrqu6a1.png?width=919&amp;format=png&amp;auto=webp&amp;s=a3a64e3da3611019f976a33eaa3cde536b2a266e)\n\n[Recordings](https://preview.redd.it/vu6q6extqu6a1.png?width=919&amp;format=png&amp;auto=webp&amp;s=fc52aa903d7afa9934f9cb6f7f16aa5004ca08ed)\n\n[Built in Configuration editor](https://preview.redd.it/rmb77axuqu6a1.png?width=919&amp;format=png&amp;auto=webp&amp;s=ba5750bbdac8412461517478de90eb3e5f12ae67)", "relevance": 0}, {"search": 3, "content": "GDPR in Computer Vision project Hello, I'm an Italian engineering student. I've developed a computer vision project intended for permanent installation in a public space. This project utilizes a webcam for real-time data processing without storing any information.\n\nMy question pertains to GDPR compliance: Does the absence of data storage in the project violate GDPR regulations? Should I still provide informational transparency to users or visitors, despite no data being stored", "relevance": 0}, {"search": 3, "content": "Help with computer vision Alright, so we got a problem. I have a video of clinical ICU monitor that displays the ECG, and i would like to mark the time stamp when the changes occur in \n\n1. Height of QRS complex (the amplitude)\n2. Distance between two consecutive QRS complexes (Essentially the wavelength)\n\nHow do I go about it? any input anyone??", "relevance": 0}, {"search": 3, "content": "Mathematics for computer vision Hi everyone,\nAs the title says, what are some important topics from mathematics needed for computer vision?\n(apart from the usual algebra, calculus etc.)", "relevance": 0}, {"search": 3, "content": "Open problems in Computer Vision Looking for ideas/research problems to implement as part of a computer vision course. I don't have access to high-end GPUs, just whatever is available online for free (Colab, Azure 300$ credits, etc). Please suggest some open problems in CV that I can work on for about 3 months and later on expand if I want to.", "relevance": 0}, {"search": 3, "content": "Computer Vision As a fresher who is just starting out what would you suggest I do to get a high paying job in CV? I have done some good projects and internships but when I look at job description I sometimes feel that this I don’t etc … and what are the most important concepts the interview wants to know for a role of a CV engineer? ", "relevance": 0}, {"search": 3, "content": "ShareVision PC3000 by Creative Labs demonstrated on \"The Computer Chronicles,\" 1994. ", "relevance": 0}, {"search": 3, "content": "Saturation in computer vision I am a graduate student in ML, my interest in pursuing a graduate study in ML piqued due to the breakthrough cv models beating human level  errors. But ever since the launch of open AI's GPT 3, I think everyone is talking about LLMs only with a less emphasis on computer vision advancements.\nIt made me feel that only LLMs are cool and powerful and have bigger potential as compared to the CV models..\n\nHas the research community completely diverted their focus on developing large language models only? Has computer vision research reached to its saturation? Is there less possibility of novel breakthrough invention in computer vision research now?", "relevance": 0}, {"search": 3, "content": "[Tim Cook] The era of spatial computing has arrived! Apple Vision Pro is available in the US on February 2. ", "relevance": 0}, {"search": 3, "content": "Made a program that in real time creates a PGN from a physical board using computer vision and AI. Requires nothing more than a mobile camera and a tripod. ", "relevance": 0}, {"search": 3, "content": "I tried teaching a computer to play Valorant using computer vision ", "relevance": 0}, {"search": 3, "content": "Cámara para computer vision Hola gente! Les pido disculpas si estoy preguntando una huevada que no va acá (\\*), soy virgen de reddit y no conozco los subforos. Cuestión que tengo que hacer un laburito de detección de fallas en un taller: quiero poner una cámara que le apunte a una mesa desde arriba (\\~50 cm) y el flow que me gustaría que tuviese es que la persona apoya la pieza sobre la mesa para revisarla, un modelo detecta presencia de objeto y le saca la foto, luego la persona la saca y pone otra, etc. Por una cuestión de espacio me gustaría que la cámara esté conectada a un servidorcito aparte, digamos habitación contigua o en el piso de arriba.\n\nLa parte algorítmica no es problema, pero sí me importa de la cámara que:\n\n1. En lo posible no cueste un huevo\n2. Poder enviar la orden de disparar la foto en forma remota o algo así (desde el sv)\n3. La resolución debería ser decente para poder pasar las fotos por object detection después (no tengo idea cuánto, asumo mínimo 8-10 MP)\n4. Si se puede conectar por red en vez de wifi mejor, sino no importa\n\nY el problema es que no tengo la más mínima idea de cámaras, no sé ni marcas ni qué se usa. Un amigo me recomendó mandarle una raspberry pi con el módulo de la cámara, pero lo veo medio rebuscado, siento que tiene que haber algo tipo lo que yo digo que no cueste una locura. Cualquier sugerencia se agradece!\n\n(\\*) Si no va acá también se agradece si me tiran tips de dónde preguntar\n\n&amp;#x200B;\n\nUpdates:\n\n1) Muchas gracias por la ayuda a la gente que va comentando!\n\n2) Ya hay un chabón que mira medio rápido a ver si tiene fallitas la pieza (no me dejan hablar mucho de la naturaleza de la cuestión, digamos es de 20x10 cm), no son grandes las fallas (menos de 1 x 1, a veces menos de 0.5x0.5) pero suelen ser de diferente color y forma notoria. El problema es que está comprobado que tienen MUY baja eficacia y le quieren poner un detector en paralelo, de ahí el tema de la cámara.\n\n3) El rate es el del operario que va poniendo las cosas en la mesa y luego sacando, no los vi trabajando en vivo pero hay tiempo suficiente de que la cámara obture/haga foco y todo eso. La cámara no estaría sacando más de 1 foto por segundo ni en pedo, aunque tampoco estaría bueno que tarde 1 seg en hacer foco.", "relevance": 0}, {"search": 3, "content": "Computer vision deployment help Hello everyone,\n\nI'm currently working on a computer vision project, specifically smart PPE detection, with the aim of deploying it at a construction site. The model is built using YOLO NAS and trained on data from Roboflow.\n\nNow, I'm looking to deploy the model on a frontend. My goal is to adopt a plug-and-play approach, making it easy for customers to configure their CCTV cameras seamlessly.\n\nI've successfully implemented smart PPE detection, but I'm keen on incorporating fall detection with alerts and danger zone detection. I want to send alerts if someone is within the danger zone (the construction site) without the correct PPE. How can I achieve multiple real-time inferences?\n\nI'm seeking advice on tools, technologies, and resources to accomplish this. If anyone has experience with a similar project, I'd greatly appreciate insights and recommendations.", "relevance": 0}, {"search": 3, "content": "YOLO-NAS is a new object detection model that has taken the computer vision community by storm. ", "relevance": 0}, {"search": 3, "content": "Computer Vision Software Development | Hire Computer Vision Developer ", "relevance": 0}, {"search": 3, "content": "Computer vision ", "relevance": 0}, {"search": 3, "content": "Computer vision engineer Hello everyone\nI am a senior computer vision engineer in Egypt and have worked with multiple startups to build solutions like AutoML (no/low-code computer vision), auto annotation pipelines, medical imaging .. etc \n\nI am wondering about \n- the possibility of working in Germany without getting a master's degree in AI as per my search, I found the easiest way to get a job there \n\n- Also, what are the best other countries to work there as a computer vision engineer \n\nThanks ", "relevance": 0}, {"search": 3, "content": "computer vision thesis anyone here can help me with my thesis? message me please.", "relevance": 0}, {"search": 3, "content": "Computer Vision Job Hi! So I'm working on computer vision for quite a while now and build projects in general also. Now I'm looking for an internship to get experience to start my career as a Computer Vision Engineer.\nCan any of you tell me how do you guys started your career in this field?\nI've looked on the famous job posting places but haven't got anywhere.", "relevance": 0}, {"search": 3, "content": "WFH Computer Vision Engineer UK pocket dump ", "relevance": 0}, {"search": 3, "content": "computer vision implementation I am trying to learn computer vision. I'm learning theoretical stuffs but how to learn to implement those stuffs. Despite giving so much time, i feels like I am not doing any progress learning all theoretical things. \n\nPlease suggest me how shall I learn. Thanks! ", "relevance": 0}, {"search": 3, "content": "Computer Vision Based Indoor Positioning System Hello everyone, \n\nDoes anyone worked or know if there is a system that does indoor positioning with camera? Because bluetooth based systems have limited range. Idea is like this:  \nTo train a model with images of building inside. So if a user takes a photo of random place of building inside, the model will know where is taken, and it will place a dot maybe on map. Map will be ready because user will download the 2D plan of that floor or building. Of course there will be maybe problem with duplicated objects, but still it will help for orientation in large buildings. Or is there any indoor positioning systems that can work for large buildings?  \n\n\nThank you...", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "GPT4 wins at computer vision I submitted this photo to GPT4 and Gemini Advanced and asked “what’s this?”. Wild difference", "relevance": 0}, {"search": 3, "content": "Deep Learning/ Computer Vision [P] I've been an ML engineer working with networks for the past decade, routing optimisation and such, so I know a thing or two about ML and DL, but I haven't had anything to do with computer vision since I was a grad student. \n\nA friend who runs a disability group approached me to ask if it would be possible to use a camera + link it with some kind of ML computer vision system that recognises obstacles and distances + headphones for people who can't afford seeing eye dogs and are stuck with a cane, to allow them some more information about their surroundings. The idea would be short sentences like \"street in ten meters\", \"tree straight ahead\". \n\nShe asked me to look into this and I'm a little overwhelmed with finding a good entry point into the whole topic. I assume that this would need a bluetooth camera, some kind of real time operating system + portable? computing hardware. I assume it shouldn't be totally impossible as autonomous driving would require a far higher degree of accuracy, but whatever's been done in that field is probably propietary?\n\nThere's also not really a budget for this except for a sponsor who would be willing to pay the hardware, so any open source stuff would be great.\n\nI'm reading OpenCV a lot, but are there any other libraries or tools I should know about when I start googling? Yeah, so basically just any thoughts and intro to CV+ML information would be assume: any good articles I should check out? Has this already been done and I can just download it somewhere :) ? Is it totally undoable? ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Math book for Computer Vision Hi everyone I am looking for a book that gives an introduction to neccesary math for computer vision. It might be a whole book that was written for it or it can also be a computer vision book with chapters for mathematics introduction that is necessary. \n\nAny suggestions would be greatly appreciated.", "relevance": 0}, {"search": 3, "content": "How closely related are computer graphics and computer vision? I’ve noticed that a lot of computer graphics faculty at my school conduct some amount of computer vision research as well, even teaching CompViz courses at the undergraduate and graduate level. Graphics and Vision are also frequently mentioned together and grouped together as subjects at schools and when looking for learning resources. How closely related are the two fields? Close enough that it’s not too uncommon for experts in one field to be able to make meaningful contributions to the other? What fundamental knowledge is shared between them and what skillsets and knowledge sets them apart?", "relevance": 0}, {"search": 3, "content": "Button Computer Vision I am in batch 6. Can anyone tell me if I need to hold the button while using the camera? Eg if I want to use the rabbit to help with a task and continue using it hands free. Is that possible at this time?", "relevance": 0}, {"search": 3, "content": "Computer vision + translation app: feasible? I'd like to make an app that can scan the visual field of my Vision Pro, find objects, and display their name in some other language, to help with language learning --- so e.g. if I'm looking at a cup, and I'm trying to learn Japanese, the app would put the Japanese word for \"cup\" over the cup.\n\nI understand that the camera feed is not accessible by API and may not ever be due to the privacy policy. Is there another way to do what I want using ARKit / RealityKit? I don't even intend to put this on the app store, if that helps.", "relevance": 0}, {"search": 3, "content": "Mojo for Computer vision  Is mojo a good programming language to pursue for computer vision as I'm pursuing in master's in computer science and i'm choosing computer vision for thesis research. I'm choosing mojo because it's a new langugage and faster than python. or i should choose python over mojo", "relevance": 0}, {"search": 3, "content": "Meta Computer Vision Interview I want to prepare myself for this process, for a position in AR/VR. Currently I practice leetcode and general ML design interviews. What else can I do? Any technologies I should familiarize myself with? Anyone did it before?", "relevance": 0}, {"search": 3, "content": "Computer Vision Take-Home assessment Hi Everyone,\n\nI'd be super appreciative if anyone has ever gone through a computer vision take home assessment for candidacy for a job role. I honestly have no idea what to expect. Any insight would be incredibly helpful. \n\nCheers!", "relevance": 0}, {"search": 3, "content": "Job in computer vision How did you get a job in computer vision? I studied computer vision at university, but when I am looking for job opportunities, there is very few.  And when I try to apply, they usually respond, that they want someone with experience. But how I am supposed to get experince without a job in the field?", "relevance": 0}, {"search": 3, "content": "Menzy.io - AI-based computer vision for Move2Earn (Train2Earn?) in both the metaverse and digitally [**Menzy.io**](https://Menzy.io) **- AI-based computer vision for Move2Earn (Train2Earn?) in both the metaverse and mobile with a pedometer/camera**\n\nCan see this project growing 10x as the initial FUDdy Duds have left - Move2Earn/Train2Earn/FitFi (whatever you want to call it) is still in it's growing phase. Overall, I think the project has great potential if they avail the over $1m they've raised.\n\n**Pros:** \n\n* The code behind the software is pretty unique. \n* The Team: Ammar the tech lead worked on self-driving cars for 6 years after graduating from Cambridge University's Graduate program for Electrical Engineering and the computer vision + MENZYverse are both very interesting concepts. Humza is the Director of a Biometric Suite. Abdul is a programmer/data scientist. Zeeshan has been involved in crypto for some time.\n* They're backed by some heavy-hitting Launchpads - Poolz, Seedify and Blokpad, have some decent advisors from Vincent Wu from Coinbase and Dan Glaser the Footballer (Soccer player) and are supposed to announce more this week.\n* The current marketcap is abysmally low in terms of value (\\~$16M) but they have potential to moon once their alpha product + NFTs launch later this month. \n* Low cost barrier to entry (NFT will be sub $100 for lifetime). Also, it doesn't degrade like Stepn so you don't have to repeat buy to keep getting paid to train. \n* Total Telegram users across all communities = 150K \n* Twitter - 50K (not sure of how many bots, probably need to ask Elon about that  [😂](https://emojipedia.org/face-with-tears-of-joy/)), but they have pretty decent engagement.\n* Team tokens are locked for a year.\n* Can farm tokens through Tokenfarm as well. \n* The token will be able to mined (train2earned) more greatly in the initial period as it decreases with the amount of tokens sent out in an exponential pattern.  \n\n\n**Potential Pro -** If it can actually get people to lead more active lifestyles, it can decrease CO2 emissions, increase life expectancy, decrease healthcare expenditures in countries and it's been shown in studies that money is the greatest motivator for exercise - [https://www.nytimes.com/2021/12/08/well/move/exercise-motivation-study.html](https://www.nytimes.com/2021/12/08/well/move/exercise-motivation-study.html) / [https://www.nature.com/articles/s41586-021-04128-4](https://www.nature.com/articles/s41586-021-04128-4)\n\n&amp;#x200B;\n\n* **Cons:** \n* Currently, only listed on ByBit and PancakeSwap. Need to add Gate/KuCoin/BitStamp/Binance to get more momentum. \n* Kazuki Takahashi isn't well-known outside of Japan and Bulgaria, they need to add more A-list fitness influencers, UFC fighters, boxers, etc. \n* Need a clear and concise roadmap for continuous growth. \n* Discord was just added a day ago.\n* Lack of diversity on the team - they need more divergence of opinion. \n* Need to create a more detailed marketing plan and show more videos of the AI working.\n* Create communities for other languages\n* Need more partnerships with other up and comers in and outside of crypto.\n\n**Links:**   \n**Coinmarketcap -** [**https://coinmarketcap.com/currencies/menzy/**](https://coinmarketcap.com/currencies/menzy/)  \n**CoinGecko -** [**https://www.coingecko.com/en/coins/menzy**](https://www.coingecko.com/en/coins/menzy)  \n**Telegram - Announcements** [**https://t.me/menzyofficial**](https://t.me/menzyofficial)  **- Community -** [**https://t.me/menzy\\_official**](https://t.me/menzy_official) **- Russian speakers** [**https://t.me/Menzy\\_CIS**](https://t.me/Menzy_CIS) **-**   \n**Discord -** [**https://discord.gg/g4SZ52ZfF**](https://discord.gg/g4SZ52ZfFc)\n\n**E-mail:**   \n[Support@Menzy.io](mailto:Support@Menzy.io)\n\n&amp;#x200B;\n\n**Links from their Telegram -** \n\n🔷Trade on PancakeSwap(DEX) : PancakeSwap Link ([https://pancakeswap.finance/swap?outputCurrency=0x861f1E1397daD68289e8f6a09a2ebb567f1B895C](https://pancakeswap.finance/swap?outputCurrency=0x861f1E1397daD68289e8f6a09a2ebb567f1B895C))\n\n&amp;#x200B;\n\n🔶Trade on ByBit(CEX) : ByBit Link ([https://www.bybit.com/en-US/trade/spot/MNZ/USDT](https://www.bybit.com/en-US/trade/spot/MNZ/USDT))\n\n&amp;#x200B;\n\nIf you don’t have a ByBit account then please create your account here ([https://www.bybit.com/en-US/invite?ref=KO55GN](https://www.bybit.com/en-US/invite?ref=KO55GN))\n\nYou will get $20 bonus for free if you use our link :)\n\n## Disclaimer: I'm interested in joining the team myself so that's why I've been researching so heavily.\n\nTL:DR - I think it has the potential to moon 10-100x but they have to show how their differentiation will not be able to be copied by others.", "relevance": 0}, {"search": 3, "content": "Learning Computer Vision Basics I'm looking to get up to speed on computer vision for work. I did a PhD in dynamics and control and  since finishing grad school my jobs have been focused on applying optimal control techniques to aerospace and robotics problems.   \n\n\nMy motivation is that I need to be able to specify sensing requirements for a control system to perform adequately.   \n\n\nI have found these videos by [Andreas Geiger](https://uni-tuebingen.de/fakultaeten/mathematisch-naturwissenschaftliche-fakultaet/fachbereiche/informatik/lehrstuehle/autonomous-vision/team/) and Shree Nayar.\n\n\\-[https://uni-tuebingen.de/fakultaeten/mathematisch-naturwissenschaftliche-fakultaet/fachbereiche/informatik/lehrstuehle/autonomous-vision/lectures/computer-vision/](https://uni-tuebingen.de/fakultaeten/mathematisch-naturwissenschaftliche-fakultaet/fachbereiche/informatik/lehrstuehle/autonomous-vision/lectures/computer-vision/)  \n\\-[https://fpcv.cs.columbia.edu/](https://fpcv.cs.columbia.edu/)  \n\n\nOn Andreas' course page, the links to exercises just point to lecture notes. Does anyone know if these are available anywhere else? I would really like to find focused excercises to learn the material. I know If I just watch these without the hands on part I won't learn much.  \n\n\nAny suggestions or feedback is appreciated.", "relevance": 0}, {"search": 3, "content": "Computer vision camera Any one here work in terminal ports and applied computers vision camera to track workers on vessels  or on quay to alarm when speader be close to them to prevent accidents it will be good project especially im new there so it will be good idea ?", "relevance": 0}, {"search": 3, "content": "Machine Vision vs Computer Vision Hello I am an Electrical Engineering student who is interested in Computer Vision. I have the option to take an elective called \"Machine Vision\". Would this be a good class to take to learn about the field? What is the difference between these two? Thank you.", "relevance": 0}, {"search": 3, "content": "Using machine learning, computer vision, and automation to rethink waste sorting. ", "relevance": 0}, {"search": 3, "content": "What are \"embeddings\" in computer vision ? I've been doing some research about ReID, and come across to a sentence:\n\n&gt;The goal behind this demo is to show how to implement ReID in a simple way, for this to work in a real scenario a good embedding is required along with a good embedding distance function.\n\nSo what does embedding actually mean ? What is an embedding distance function ? I will drop the actual code that this repo's owner is using to calculate embedding distance function.\n\n    def embedding_distance(matched_not_init_trackers, unmatched_trackers):\n        snd_embedding = unmatched_trackers.last_detection.embedding\n    \n        if snd_embedding is None:\n            for detection in reversed(unmatched_trackers.past_detections):\n                if detection.embedding is not None:\n                    snd_embedding = detection.embedding\n                    break\n            else:\n                return 1\n    \n        for detection_fst in matched_not_init_trackers.past_detections:\n            if detection_fst.embedding is None:\n                continue\n    \n            distance = 1 - cv2.compareHist(\n                snd_embedding, detection_fst.embedding, cv2.HISTCMP_CORREL\n            )\n            if distance &lt; 0.5:\n                return distance\n        return 1\n\n&amp;#x200B;", "relevance": 0}, {"search": 3, "content": "Microcontrollers for computer vision Hi all, I was wondering what's the most cost efficient but capable microcontroller (with a camera) that's capable of doing image processing in real time? I'm working on a project where I plan to do some infrared eye tracking, so I'm open to suggestions as to what kind of boards are capable of this.\nOn another note, is it possible to get those black and white infrared images that you usually see with eye tracking cameras on boards like these?", "relevance": 0}, {"search": 3, "content": "Zuckerberg on Vision Pro: Could be the 'future of computing' but 'not the one that I want' ", "relevance": 0}, {"search": 3, "content": "Introduction to Computer Vision ", "relevance": 0}, {"search": 3, "content": "Computer vision (CV) ", "relevance": 0}, {"search": 3, "content": "Computer vision remote positions Guys where can Computer vision engineers or developers find global remote positions?", "relevance": 0}, {"search": 3, "content": "Computer Vision I Is Computer Vision I not offered during the Spring?", "relevance": 0}, {"search": 3, "content": "Best computer vision course I did intro to deep learning in computer vision and also image analysis. Both courses were superb. \n\nI have a hard time choosing what my last elective should be: 02506 advanced image analysis, 02504 computer vision, 02501 advanced deep learning in computer vision.\n\nDo anyone have some feedback on those courses?\n\nPersonally i prefer solid conceptuel understanding of theory over mathematical intuition of theory. Also did ml for signal processing and that was as bad as it got.", "relevance": 0}, {"search": 3, "content": "Advice for starting a computer vision consulting business? Hey guys,   \n\n\nI'm an ML engineer and have been looking to start a computer vision consulting business on the side. I think it's very viable since there seems to be quite a bit of use cases that can be built in-house for companies and a lot of FOSS for CV models. Let me know if you guys have any advice!", "relevance": 0}, {"search": 3, "content": "Introducing the Blitz desktop app: fully automatic build recs, runes, counters, scouting and more, powered by computer vision and OK memes - in open beta! **TL;DR:** The Blitz team built a [**new desktop app for League**] (https://blitz.gg/beta) that uses computer vision to automatically display counters, builds, and teammate stats in champion select, and it’s now in open beta for Windows.\n\n[Click here for GIF] (https://imgur.com/meuEfnI) of how the automation works.\n\n[Click here] (https://imgur.com/a/SyQA6BC) for screenshots.\n\n[Click here] (https://app.blitz.gg/lol/match/na1/doublelift/2758832655) for Doublelift's post-match report card.\n\n&amp;nbsp;\n\n# Introducing: the Blitz desktop app for League!\n\nHey /r/leagueoflegends! It’s Rick from Blitz. You might know us from our content, but for the last few months we’ve also been working hard on an OP new desktop app for League. Think OP.GG + Champion.gg, combined and totally automated so all of your champion counters, runes, builds, and teammate stats are displayed and updated **in real-time** as you go through champion select and live game--no typing required.\n\nI’m excited to announce that the app is now in **open beta** testing for Windows, and we’d love for you to check it out: [**blitz.gg/beta**](https://blitz.gg/beta).\n\n&amp;nbsp;\n******\n&amp;nbsp;\n\nHere’s what’s cool about the Blitz app:\n\n# It’s completely automated so you don’t have to do any work. No typing required.\n\n[*[Gif of automation DURING CHAMP SELECT]*] (https://imgur.com/meuEfnI)\n\nWhen you enter champion select, the Blitz app automatically enters live game mode and uses computer vision to pull your teammates’ summoner names and instantly display their ranked stats, champion proficiency, and playstyles. As players lock in champions, the Blitz app detects those changes and updates their stats and counter recs as you go, without you lifting a finger.\n\n# It gives build recommendations and win rates based on data from high-elo games BUT ALSO contextualizes them by matchup. \n\n[*[Screenshot here]*] (https://i.imgur.com/IinPzur.jpg)\n\nLike other tools, the Blitz app recommends champion skill order, runes, and item builds based on highest winrate and most commonly built in high-elo ranked games (through our own analysis of game and player data pulled from Riot’s API - [more info here] (https://blitzesports.com/desktop/faq#blitzdata)). \n\nHowever, it also adjusts on-the-go based on your specific lane opponent. Your runes and early items should, for example, be very different if you’re laning against an AP poke champ as opposed to an AD assassin. Blitz takes these differences into account and shows the most successful builds **per matchup** (statistically) so you get a more effective build for your specific situation.\n\nThere’s also a handy button that instantly imports the recommended build to your League client so you don’t need to look up items in-game when every second counts.\n\n# It includes champion-specific tips by high-elo players to help you counter your lane opponent.\n\n[*[Screenshot here]*] (https://i.imgur.com/oIhksMG.jpg)\n\nThere are a lot of things that numbers can’t show, and one of these is a clear understanding of the playstyle, power spikes, and weaknesses of your lane opponent. We got high-elo players (big shoutout to u/Kayle_Bot and everyone who helped) to write up quick tips for countering each champion in lane--think of them as SparkNotes that you can skim while your game loads.\n\nWhen you get in game, you can also check your opponents’ ranked stats and playstyles, which the Blitz app automatically pulls and displays once their summoner names are available.\n\n# Finally, it evaluates your performance after every game and breaks your play down into simple tags.\n\n[*[Screenshot here]*] (https://i.imgur.com/z1k13Q4.jpg)\n\n*You can also look [yourself up here on web. Here's Hashinshin's] (https://app.blitz.gg/lol/match/na1/hashinshin/2757275568)*\n\nSometimes you carry the game, sometimes you get carried, and sometimes you’re just plain unlucky. The Blitz app automatically pulls your performance data after every game and instantly compiles a personalized post-match report card with tags like:\n\n* MVP\n* Early Game Monster (high KP% early game)\n* Unlucky :(\n* Flame Horizon\n* CS God\n* THICC (tanked most dmg in the game)\n* Got Camped\n\nThey’re fun to read and easy to apply, so you can start your next game knowing where you stand and what you need to do.\n\n# And that’s about it! \n\nWe’re very excited to finally bring the Blitz app out in the light of day, and we hope it proves useful for all of you!\n\nHere’s the [**link to the app again**] (http://blitz.gg/beta). \n\nRemember, this is a beta so we need your feedback! You can send comments, feature requests, and bug reports directly to the Blitz team in our [Discord server] (http://blitz.gg/discord).\n\nHappy to answer any questions about the app!\n\n&amp;nbsp;\n\n*Edit: Blitz currently works in all servers except Garena and CN. You can look up players and such in KR, but the summoner name detection won't work. ", "relevance": 0}, {"search": 3, "content": "[Invite] Computer Vision in Hawaii - Maritime Computer Vision ", "relevance": 0}, {"search": 3, "content": "Roadmap For Computer Vision Hey, I'm learning ML for 3 months. I have learned some machine learning algorithms and also ANN and it's optimizers and loss functions. So, I was looking for Computer Vision roadmap on internet. I have searched on YouTube, and they don't even tell to learn basic ml algorithms. They just say, learn a programming language then learn image preprocessing and Image classification using CNN and a lot of things. But none of them say learn basic of ml algorithms like: SVM, Decision Tree, etc. \n\nSo, Can you guys tell me the required things that I need and also do I need that algorithms. If I need then tell me what algorithms and also please give me full beginning to the end roadmap. So, if I have left any thing in ml that are required in computer vision that I will cover from that roadmap. And also tell me all technical knowledge that I need for computer vision.", "relevance": 0}, {"search": 3, "content": "computer vision: documenting the jouney ", "relevance": 0}, {"search": 3, "content": "Looking for those with skills in real time computer vision  There's a Solvathon organized by apollo hospitals and IITACB in Bengaluru from 22 to 24 Feb. We recently had 2 team members back down, and I am in need of someone to help us with the coding part of this project. PS: As of now, we are an all-medical team with very limited knowledge on coding.\n\n[Solvathon, IITACB and Apollo](https://www.transformhealth-it.org/solvathon/) Please check this link, and we are working with problem statement one.\n\nABOUT THE PROJECT:\n\nVideo of the ICU (Each patient has one camera)&gt;&gt; Object detection for Monitors&gt;&gt; Image segmentation and classification for separating parameters like heart rate, SpO2 so on &gt;&gt; Optical character recognition&gt;&gt; Output.\n\nThis is very vague, and we need to think about how to make the process real time and integrate multiple patients' data from multiple cameras too... We are also facing trouble with what to do with waveform parameter like ECG. Please lmk if you are interested, so i can share further details!", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "I built a \"cyberdeck\" computer, inspired by the science fiction vision of portable computers from the 1980s. ", "relevance": 0}, {"search": 3, "content": "Computer Vision deep dive interview Hello All, I’m nowadays in giving a streak of interviews currently, I’m shortlisted in  for 3rd round i.e Computer vision ML deep dive, apparently it will be a CV problem to solve in 1hr \nI’m here to ask for suggestions how to prepare for this any websites or similar experience of interviews anyone had, how would be the question difficulty and all, (this company I’m being interviewed has a product of ADAS systems for heavy duty trucks) I have been said I would also be working in that product development, So any thoughts you have about the question, please I’m very much interested in this company.", "relevance": 0}, {"search": 3, "content": "Computer Vision Fundamentals ", "relevance": 0}, {"search": 3, "content": "Computer Vision Roadmap Hey, I'm learning ML for 3 months. I have learned some machine learning algorithms and also ANN and it's optimizers and loss functions. So, I was looking for Computer Vision roadmap on internet. I have searched on YouTube, and they don't even tell to learn basic ml algorithms. They just say, learn a programming language then learn image preprocessing and Image classification using CNN and a lot of things. But none of them say learn basic of ml algorithms like: SVM, Decision Tree, etc. \n\nSo, Can you guys tell me the required things that I need and also do I need that algorithms. If I need then tell me what algorithms and also please give me full beginning to the end roadmap. So, if I have left any thing in ml that are required in computer vision that I will cover from that roadmap. And also tell me all technical knowledge that I need for computer vision.", "relevance": 0}, {"search": 3, "content": "Computer vision chips? Are there any cheap computer vision chips for object detection and/or avoidance? I am trying to build a drone that \"should\" have quite a high resolution camera, and I want to be able to detect/track objects in real-time.  \nAny suggestions? or is it even worth it buying a dedicated chip for the job?", "relevance": 0}, {"search": 3, "content": "Tesla is about to increase its lead in semi-autonomous driving w/ ‘Tesla Vision’: computer vision based on NVIDIA’s parallel computing ", "relevance": 0}, {"search": 3, "content": "Azure Computer Vision alternatives? Hey all, we’ve been working on incorporating image viewing into a software we’re developing and looking for an alternative to view images and describe them. \n\nAnyone out there with an alternative that’s better? Azure is ok 50% of the time, but other times it’s just completely off. \n\nFor example a chess board with chess pieces on it was described as being a calendar. \n\nAny recommendations are appreciated 🙏", "relevance": 0}, {"search": 3, "content": "Switch from Classic Computer vision to Deep Learning I develop classic Computer Vision algorithms on C++ and want to switch to Deep Learning area.  \nFor now, I see these options:  \n**Plan #1:**\n\n1. Join a small HW/mobile startup\n2. Integrate/optimize neural networks (this usually requires C++)\n3. Gradually move to NN finetuning.   \nThis may be possible if NN training and integration is made by the same team. That's why the company should be small.\n\n**Plan #2:**\n\n1. Learn leetcode\n2. Apply to FAANG-like companies for SE in test role to support AI/scientific infrastructure\n3. Try to switch from testing utils to NN finetuning. \n\n**Plan #3:**\n\n1. Learn DL theory on excellent level\n2. Join intern/junior position in bigtech\n3. Hope to get a better offer for middle position from them\n\n  \n**My skills:**\n\n* **C++**: 5 YoE as a main programming language\n* **Python**: 2 YoE for auxiliary utils\n* **DL**: 1 year of **commercial** experience, utilized a few networks as black boxes\n* **DL theoty**: few online courses\n* **Math**: good level\n* **Extra**: 5 YoE in Classic Computer Vision\n\n&amp;#x200B;\n\nSo, I have a couple of questions:\n\n1. What do you think about these plans?\n2. Maybe, you can share some relevant experience?\n3. Do you have other ideas how to switch to DL with my experience?\n4. Should I do pet projects to tell about them on job interview when the interviewer asks me about my DL experience?\n\n&amp;#x200B;\n\nI would also be happy to hear your stories if you did similar transfers.\n\nThanks in advance!", "relevance": 0}, {"search": 3, "content": "Anyone here work in computer vision? I work in engineering analysis but I’m becoming increasingly interested in data science and software. Specifically computer vision. I know python and c++ to a basic-intermediate level and I’m really trying to get better. \n\nMy masters degree is in mechanical engineering though. Will I be able to get into these fields with this background? Or anyone got advice on how to? ", "relevance": 0}, {"search": 3, "content": "Computer Vision/Artificial Intelligence hello po im looking for someone na kaya magcode/program using cv and ai. need lang po maintegrate yung code into robotic arm. pls pm me for more details and also drop your rates na din po thank u!", "relevance": 0}, {"search": 3, "content": "Advanced computer vision courses online Can somebody please name some online free/paid advanced computer vision courses? I want to learn monocular 3D depth estimation, segmentation, keypoint estimation, pose estimation, vision transformer, 3D reconstruction, scene understanding, and other advanced algorithms as well as applications. The course ideally should include both theory and Python/C++ implementation using PyTorch/TensorFlow. I looked into Udemy, udacity, and Coursera but could not find any such advanced-level good courses. I have been working in the computer vision area for a while and I believe I have more than intermediate-level skills.\n\nI have some ideas about self-driving car perception and would like to work and publish a good conference paper within next 6-8 months. If anyone is highly interested, feel free to knock me.", "relevance": 0}, {"search": 3, "content": "Which major for Computer Vision? As someone who’s applying for transfer this upcoming cycle that would also like to get into computer vision, ai, and machine learning, what major would be best fit for my future prospects? I have the potential to apply for L&amp;S CS, EECS, and DS. Which should I choose? Are there any other majors to consider? Thanks in advance!", "relevance": 0}, {"search": 4, "content": "Global Warming is back! I’ve missed the Global Warming propaganda. ", "relevance": 0}, {"search": 4, "content": "Global Warming Is Accelerating ", "relevance": 0}, {"search": 4, "content": "[OC] Global warming: 140 years of data from NASA visualised ", "relevance": 0}, {"search": 4, "content": "100 years of global warming ", "relevance": 0}, {"search": 4, "content": "[OC] How serious do US states think global warming is? ", "relevance": 0}, {"search": 4, "content": "These cold snaps are a result of global warming Not to mention repeatedly getting them will endanger our Agricultural economy as snaps like this can wipe out crops for a full season.", "relevance": 0}, {"search": 4, "content": "Is there any theoretical limit to how high the Earth's temperature can become within the next 50 years due to global warming? I'm particularly interested in knowing if it is possible for the earth to become uninhabitable for humans within the next 50 or 100 years as the air and see temperatures continue to rise. There seems to be some sort of tacit belief that the temperature will level off at some point, but I don't remember seeing that leveling in the graph presented by Al Gore's chart in his movie.\n\nIf there is some sort of plateau, is there an expectation of when it would occur and what the temperatures would be at that point?", "relevance": 0}, {"search": 4, "content": "What they mean with \"global warming will be irreversible in a few years\"? Even if in a few years we reach stop the global warming (:V, we won't) but, as they say, the time limit has passed, will the Earth continue to warm forever? If not, for how long?", "relevance": 0}, {"search": 4, "content": "ELI5: If humans just ignored global warming what exactly would happen to the Earth? Is it really that bad? Could we adapt? ", "relevance": 0}, {"search": 4, "content": "Gotta love global warming ", "relevance": 0}, {"search": 4, "content": "Global Warming ? ", "relevance": 0}, {"search": 4, "content": "Global warming isn't real ", "relevance": 0}, {"search": 4, "content": "Anon discusses global warming ", "relevance": 0}, {"search": 4, "content": "global warming ", "relevance": 0}, {"search": 4, "content": "Is this a result of global warming, global cooling, or something else? ", "relevance": 0}, {"search": 4, "content": "Global Warming is a Myth!! ", "relevance": 0}, {"search": 4, "content": "Never mind global warming, world hunger and a continuous loss of biodiversity. ", "relevance": 0}, {"search": 4, "content": "Reduce global warming but the earth is increasingly polluted ", "relevance": 0}, {"search": 4, "content": "Global warming got the earth spitting fire ", "relevance": 0}, {"search": 4, "content": "People think global warming is a CULT ? ", "relevance": 0}, {"search": 4, "content": "Discussions on global warming in Reddit ", "relevance": 0}, {"search": 4, "content": "Redneck vs scientist about global warming ", "relevance": 0}, {"search": 4, "content": "Global warming is conspiracy! ", "relevance": 0}, {"search": 4, "content": "Solved global warming ", "relevance": 0}, {"search": 4, "content": "How do wind turbines help with global warming? ", "relevance": 0}, {"search": 4, "content": "Global warming set to break key 1.5C limit for first time ", "relevance": 0}, {"search": 4, "content": "\"Liberals Blame Global Warming for Heat Wave\" ", "relevance": 0}, {"search": 4, "content": "Hey look how much we have decreased global warming projections ", "relevance": 0}, {"search": 4, "content": "With all this global warming ... ", "relevance": 0}, {"search": 4, "content": "Global Warming's looking like a catastrophic Warm-Up ", "relevance": 0}, {"search": 4, "content": "Unlimited power with global warming! ", "relevance": 0}, {"search": 4, "content": "Global warming ", "relevance": 0}, {"search": 4, "content": "Who Would Benefit the Most from Global Warming? If global warming continues as it has been, which countries or regions would benefit the most? Better phrased, which places would have the fewest downsides? Since it goes without saying that the mass migrations and increased damage from natural disasters would cause massive harm to the world as a whole. Are there parts of the world where inarable land would now become farmable? Deserts that would turn into flood plains? Landlocked countries that would now have an open shipping port to use? Cold climates that could now grow all manner of crops? ", "relevance": 0}, {"search": 4, "content": "[OC] Global Warming of the Seas ", "relevance": 0}, {"search": 4, "content": "Red Cross: Global warming bigger threat than coronavirus ", "relevance": 0}, {"search": 4, "content": "Global warming is a fairy tale ", "relevance": 0}, {"search": 4, "content": "Global warming wake up call ", "relevance": 0}, {"search": 4, "content": "Global Warming ", "relevance": 0}, {"search": 4, "content": "Global warming set to break key 1.5C limit for first time ", "relevance": 0}, {"search": 4, "content": "Exxon says world set to fail 2°C global warming cap by 2050 ", "relevance": 0}, {"search": 4, "content": "Global Warming not stonks ", "relevance": 0}, {"search": 4, "content": "Global warming: DESTROYED ", "relevance": 0}, {"search": 4, "content": "Global warming tho ", "relevance": 0}, {"search": 4, "content": "Teenager Explains Global Warming to Old Man ", "relevance": 0}, {"search": 4, "content": "Why are we almost ignoring the sheer volume of aircraft in the global warming discussion It's never pushed during discussion and news releases, even though there was a notable improvement in air quality during COVID when many flights were grounded.", "relevance": 0}, {"search": 4, "content": "Global warming ", "relevance": 0}, {"search": 4, "content": "Global Warming ", "relevance": 0}, {"search": 4, "content": "GLOBAL WARMING FAKE!!!!!!! ", "relevance": 0}, {"search": 4, "content": "Global warming getting real ", "relevance": 0}, {"search": 4, "content": "Trump asks ‘what happened to global warming’ after deadly Buffalo storm ", "relevance": 0}, {"search": 4, "content": "Global Warming ", "relevance": 0}, {"search": 4, "content": "Greta Thunberg ends global warming (2019) ", "relevance": 0}, {"search": 4, "content": "Global Warming: Contiguous U.S. Temperature Zones Predicted for 2070-2099 Under Different Emissions Scenarios [OC] ", "relevance": 0}, {"search": 4, "content": "[OC] Animation highlighting the short-term variations within the recent history of global warming ", "relevance": 0}, {"search": 4, "content": "Global warming isn't real ", "relevance": 0}, {"search": 4, "content": "Global Warming ", "relevance": 0}, {"search": 4, "content": "Global Warming destroyed! ", "relevance": 0}, {"search": 4, "content": "Even 50-year-old climate models correctly predicted global warming ", "relevance": 0}, {"search": 4, "content": "Step 1: Scientists predict global warming. Step 2: Extreme global warming happens. Step 3: It's mysterious and inexplicable. ", "relevance": 0}, {"search": 4, "content": "The russian global warming experience ", "relevance": 0}, {"search": 4, "content": "Protesters in Cologne (Germany) raising awareness about global warming. They're standing on ice. ", "relevance": 0}, {"search": 4, "content": "Solving Global Warming ", "relevance": 0}, {"search": 4, "content": "You can fix global warming. ", "relevance": 0}, {"search": 4, "content": "Global warming is real ", "relevance": 0}, {"search": 4, "content": "Researcher argues that global warming is worse than we think and more radical measures are required. ", "relevance": 0}, {"search": 4, "content": "Data: Global warming may be accelerating ", "relevance": 0}, {"search": 4, "content": "Global warming bad ", "relevance": 0}, {"search": 4, "content": "107 year old newspaper article predicting Global Warming. ", "relevance": 0}, {"search": 4, "content": "Global warming: April was 400th straight warmer-than-average month ", "relevance": 0}, {"search": 4, "content": "\"Global Warming and Math\" ", "relevance": 0}, {"search": 4, "content": "A Statue in Berlin of “Politicians Discussing Global Warming” ", "relevance": 0}, {"search": 4, "content": "Politicians Debating Global Warming by Isaac Cordal ", "relevance": 0}, {"search": 4, "content": "Global warming is exciting! ", "relevance": 0}, {"search": 4, "content": "Kamala Harris proposes reducing population instead of pollution in fight against global warming ", "relevance": 0}, {"search": 4, "content": "World has nine years to avert catastrophic global warming, study shows ", "relevance": 0}, {"search": 4, "content": "To Put the Brakes on Global Warming, Slash Methane Emissions First ", "relevance": 0}, {"search": 4, "content": "we need to stop global warming ", "relevance": 0}, {"search": 4, "content": "The color of the ocean is changing, and scientists blame global warming ", "relevance": 0}, {"search": 4, "content": "Global warming study: “Unprecedented” droughts lasting for at least five years will hit several regions around the world by mid-century if nothing is done to curb global warming ", "relevance": 0}, {"search": 4, "content": "Global Warming is Spooky ", "relevance": 0}, {"search": 4, "content": "Global warming didn't exist, then global warming wasn't man made. Apparently now it's good for us? ", "relevance": 0}, {"search": 4, "content": "Global warming, you had ONE job. ", "relevance": 0}, {"search": 4, "content": "Global warming set to break key 1.5C limit for first time ", "relevance": 0}, {"search": 4, "content": "Global Warming ", "relevance": 0}, {"search": 4, "content": "The arctic 103 years ago compared to today. Global warming is real. ", "relevance": 0}, {"search": 4, "content": "Houses Built Into Earth Might Be the Perfect Response to Global Warming ", "relevance": 0}, {"search": 4, "content": "Leo DiCaprio helps fight Global Warming ", "relevance": 0}, {"search": 4, "content": "Houses Built Into Earth Might Be the Perfect Response to Global Warming ", "relevance": 0}, {"search": 4, "content": "Global warming causing glacial flooding in Alaska ", "relevance": 0}, {"search": 4, "content": "It's almost like the global warming is causing the polar vortex ", "relevance": 0}, {"search": 4, "content": "Global warming is a thing… ", "relevance": 0}, {"search": 4, "content": "Evidence for man-made global warming hits 'gold standard': scientists ", "relevance": 0}, {"search": 4, "content": "Global warming says: no ", "relevance": 0}, {"search": 4, "content": "But Global Warming Doesn't Exist ", "relevance": 0}, {"search": 4, "content": "UN: Global warming outpaces efforts to slow it ", "relevance": 0}, {"search": 4, "content": "Global warming man... ", "relevance": 0}, {"search": 4, "content": "Jynx solves global warming ", "relevance": 0}, {"search": 4, "content": "White House cautiously opens the door to study blocking sun’s rays to slow global warming ", "relevance": 0}, {"search": 4, "content": "Does it bother anyone that humanity was so close to dealing with global warming? Renewable energy is exploding and is set to be the dominant power source by next decade. EV's are also being adopted at a high rate, with progress being made into developing electric trucks and planes too.\n\nIt bothers me that all these developments couldn't have happened just a few decades ago. It's a bittersweet outcome for this to be happening now, when average temperatures have already climbed and negative feedback loops have already started.", "relevance": 0}, {"search": 4, "content": "Washington Post Big Boss global warming hypocrisy ", "relevance": 0}, {"search": 5, "content": "Docking your spaceship with the International Space Station (video from @olegmks) ", "relevance": 0}, {"search": 5, "content": "How to drink coffee aboard the International Space Station. ", "relevance": 0}, {"search": 5, "content": "Me Observing Africa from the International Space Station ", "relevance": 0}, {"search": 5, "content": "How astronauts sleep at the International Space Station in zero gravity. ", "relevance": 0}, {"search": 5, "content": "Working at the International Space Station ", "relevance": 0}, {"search": 5, "content": "The International Space Station from my backyard ", "relevance": 0}, {"search": 5, "content": "TIL Since 2011, Chinese astronauts are officially banned from visiting the International Space Station ", "relevance": 0}, {"search": 5, "content": "TIL NASA plans to retire the International Space Station by 2031 by crashing it into the Pacific Ocean ", "relevance": 0}, {"search": 5, "content": "There's a reason NASA wants to destroy the International Space Station, and I'm trying to figure out what it is. I've worked at NASA for almost 30 years, long enough that I got to see the ISS get put in orbit. It's generally regarded as one of the best things we've ever done, and I agree. The amount of scientific data, discovery, disaster observation, it's just priceless. We'd all be living in a worse world without that hunk of metal orbiting our planet. It's a strange feeling to see everyone talking about taking it out of the sky. On one hand the thing is getting pretty old. It was built for 15 years of operation, but it's been functional for 21 now. On the other I'm, well, a little sentimental. Maybe all the talk of dismantling it is making me feel old.\n\nPretext first.\n\nThere are many things I'm not going to tell you about myself for obvious reasons, but I can tell you my experience with NASA. They're very open about things, inside the agency as well as outside. A lot of people like to think NASA is holding some serious secrets but that's just not true. Sometimes you can't walk 20FT without hearing a young excited scientist nerding out about some new discovery or theory to their colleagues. Management puts it how it is because in this line of work everyone needs to know and if anyone miscalculates it can mean disaster. All big scientific discoveries are put on paper within 24 hours and released to the public. You all get the picture. Point is, in 30 years of working here I've never encountered much dishonesty unless a politician walked in the door. I know everyone really well, and we get along just fine.\n\nRecent events have changed everything. The excited chatter has mostly stopped, the US Government has people in suits crawling all over the place, and the higher ups obviously haven't gotten sleep since it was announced that the ISS was to be decommissioned. Despite all this we're to continue like it's business as usual, but every now and then one of us will get called up for an interview with the suits. Sometimes they'd be gone for a few minutes, sometimes they'd be gone for hours, but when they return to work we'd all ask what was going on. Every time we'd get the same answer. The suits would bring them into a room with a table, ask them some confusing un-contextual questions, then let them go.\n\nIt's not hard for us to connect the dots. Something happened in regards to the ISS. Most of us are closed off from upper management now, and those who can talk to them have that look in their eye. The look begging you not to talk to them, but they can't tell you not to. Everyone else is as confused as I am, and work has slowed to a crawl. Occasionally we'll get an exciting announcement that renews our wondrous exploratory child-brains, but for the most part it's become dreary.\n\nA few days in I got pulled into a room with the suits. There were a lot of formalities to get through like my name, age, place of birth, etc. But then the questions started. Their demeanor changed on a dime as soon as the first word was spoken, and given what that question was I would have laughed if I hadn't been dragged into a room with government agents.\n\n\"What is your opinion on the color green?\"\n\nI didn't know how to respond at first, but eventually I said: \"I guess it's an ok color. I mean, it's not my favorite, but its nice.\"\n\nI remember feeling like I was back in elementary school with the entire class talking about what color was the best. It was awkward, and due to the situation quite jarring.\n\nBellow I've got the rest of the questions and my responses that I remember.\n\nAgent: \"Do you have any aspirations besides working at NASA?\"\n\nMe: \"I've got a bucket list. Skydiving, seeing the world, that kind of thing.\"\n\nAgent: \"And do you believe you will come to complete that bucket list?\"\n\nMe: \"Well, yeah? Gotta retire at some point right?\"\n\nAgent: \"Good. Do you wish upon falling stars?\"\n\nMe: \"What? No that's... Ridiculous.\"\n\n&amp;#x200B;\n\nAgent: \"If you did, is there anything you'd wish for?\"\n\nMe: \"Well, I dunno. Biological immortality?\"\n\nAgent: \"Do you hang posters in your room?\"\n\nMe: \"Not since I was a kid, no.\"\n\nAgent: \"What is one thing you consider objectively good?\"\n\nMe: \"Kittens?\"\n\nI said it in jest of course. Sometimes I try and break tension with a little comedy and it was out of my mouth before I knew what I was saying. Even so, I at least expected a slight smile before I was scolded, but the only thing the agent did was straighten his tie and repeat the question with a somehow even more serious look.\n\nMe: \"Fine fine. Making sure those around you live their best lives... I suppose.\"\n\nAgent: \"You suppose?\"\n\nMe: \"No I... Figure of... No that doesn't apply. Listen this is awkward. I stick by what I said, final answer, can we move on?\"\n\nIt was at this point I realized that when the agent had straightened his tie, it had changed from a formal back to a dark green. Either the agent had just pulled a magic trick with the smoothness of someone from Vegas, or I just hadn't realized it had been green the entire time. The brain has a tenancy to find patterns and lie to you, so in that moment I brushed it off, but the other two agents in the room still had black ties on.\n\nAgent: \"Yes, we can. Tell me, what is sound?\"\n\nMe: \"Well, air waves. Specifically vibrations. Right now when you speak you are sending air particles crashing into each other, sending them to me, and my ears are picking it up.\"\n\nAgent: \"Do you mind if we take your temperature?\"\n\nMe: \"No. I had mine taken at the door but I guess you can here too.\"\n\nIt was true. The agents had been taking everyone's temperature at the door these days. I didn't know why they'd need to do it a second time, but I wasn't about to argue. One of them walked over and used an unbranded digital temperature gun. After they had finished, the agent nodded to the others and I was escorted back to my floor and told to have a pleasant day. I was bombarded with questions from my colleagues, as was everyone else who got interviewed, but I didn't really have much of anything new to say.\n\nAfter that day I started doing a bit of investigating. I had only been interviewed for a few minutes, so I started asking for specifics from those who had been taken for far longer. As far as the questions themselves go I had no luck. They were still ridiculous. Things like \"Have you tasted dogwater\" or \"Have you ever gone hiking?\". But there were some consistencies too. When I brought up the green tie they said they saw the same, but brushed it off for the same reasons I did. The temperature check? It happens at the end of every interview to everyone regardless of time. But for those who got interviewed for over an hour? There was another through-line. All of them were asked what the International Space Station was to them.\n\nAt this point I knew for absolute certain that something was being kept from us regarding the ISS. No more rumors, no more speculation, no more conspiracy theories. The agents were interested in our space station too. I had to get to the bottom of this, so I contacted the guys in charge of doing the math for weight on the next supply run to the ISS. Did I mention they're still sending things up there? Because they are. Apparently they were in a tough spot. Usually you know exactly what is going into space. You have to for literally hundreds of safety reasons. But the agents had been interfering since they appeared. They'd say that something new had been added to the list, tell them the weight and then inform them that they needed to update their math to include the mystery item. It was so against code that they'd tried to take it up to management several times, but every time management shot them down. I was told that one guy was considering quitting in protest due to how unsafe just randomly adding unknown things to a spacecraft was, but the next day someone else showed up in his position. The kid was friendly, excited, and under the impression the position had been left vacant for a while. He had no idea he'd just replaced someone. I tried to get into contact with the person who was fired, but no dice. The phone number must have been bad, and I didn't know him well enough to get in contact any other way. Decided given the situation it was a bad idea for me to do so anyways. Those agents kept giving me stares when I started asking for his number. But I'd been working there for 30 years, and I had my contacts.\n\nDecided to hit up some of the old ISS crew members. I was buddy buddy with a few of them, even taking them out for drinks on occasion. I had been joking with a few of them not even a few months ago, and while our current predicament probably had nothing to do with them I had to be certain.\n\nI went through every single number but they all went to voicemail. I know people sometimes change their numbers, but all of them? I branched out beyond the US. Wasn't too close to these guys, but I'd still shared a beer with a few of them. Still nothing. Not a peep. Nothing but the robotic voice telling me to leave a message after the tone. At this point I got anxious. Not a single ISS astronaut was answering the phone. I knew where a few of them lived and started compiling the addresses, but while searching them up I came across their pages. They all have google profiles of course, but now all of them had death dates. I sat there shocked as I saw my co-workers, friends, and associates all described as having died while in the woods, in gas explosions, car accidents, even a serial killer had gotten one of them.\n\nI read into that one by the way. Someone had broken into their home. Family of four. I'll spare you the details but by the time police arrived it was to late for any of them. Allegedly the killer was high on several narcotics and died of overdose while being arrested. Several murders had been linked to him after the fact. I was shocked and heartbroken. No one had ever told me, and the way the guy went out was devastating. But then I looked at the date of the murder. I had to check my calendar, but there it was. I had taken the astronaut, his family, and several co-workers out to a movie not three days after the article said he died. It was to celebrate his full recovery after staying on the ISS so long. Things didn't line up, and while most of the death dates made sense some others didn't correlate with my calendar either. After I compiled all their addresses I took at look at the properties. All of them were closed down due to one thing or another. Gas leak had burned one down, one of them had left a stove on, a local forest fire had destroyed another, every single house was gone.\n\nAt this point I had to see it all with my own eyes. After work the next day I went on a half-hour drive to one of the closer residences. It had been a month or so but the property was owned by one of my closer buddies so it wouldn't be too strange to see me around the area. Sure enough the house was a smouldering ruin. Didn't even look like it had happened that long ago, maybe a day at most. There was even a firetruck still outside with firefighters sorting through it all. I was going to pull up and ask them what happened, but then I spotted the black van across the way. More government agents. I didn't want to be seen there, so I just drove by like anyone else would and didn't make eye contact. Could have been my paranoia, but I swore I could feel their gaze burning into the back of my skull.\n\nNow I knew. Every single ISS crewmate was gone under mysterious circumstances. I think it's the government itself, but I don't understand why. I'd like to believe they aren't actually dead, just in a holding cell somewhere until this all blows over, but I just don't know. To make matters worse I was approached at work the next day. Agents of course. They didn't bring up any specifics, just said the same thing they'd been saying from day one. Don't interfere with their business and everything will be just fine. Then they left, and the day continued as per usual. Scared me half to death though. My mind was running through the possibility that they were going to make me disappear too, and it took every ounce of mental strength I had not to look like I was caught. Not even sure I did look normal that day to be honest. I had lost a lot of sleep and was living off of coffee.\n\nAs of now? Rumors about weapons being smuggled onto the ISS are circulating, no one is allowed to go to the upper floors now, and people are starting to get replaced faster and faster. One of my colleges who's been doing some investigating of his own said he looked at the ISS through his telescope and swears to God that it was spinning out of control and half covered in something black. Took a look myself, but I couldn't find the station at all. It's definitely not on it's projected orbital path. No one outside the agency is talking about this. For all the public knows NASA plans to decommission the ISS in 2031 and land it's remains on Point Nemo, which I will add is the furthest point from human civilization on the planet. They even denied letting museums keep pieces of it, opting to just get rid of the darn thing. I'm too afraid to go to the press about it too. I don't want to be replaced because I'm pretty sure everyone who does isn't just going back home unemployed. And those agents. They've asserted even more control. I pretty much directly report to them now, and they're the only ones who go upstairs. No one has seen anyone from upper management in weeks. To make matters worse I haven't even seen the agents express a hint of remorse, or any emotion really. It's just the stone cold stare 24/7. I'm starting to think they're robots. I'm also starting to think I'm going crazy, like I've been couped up in a cage for too long with eyes on me at every waking moment.\n\nDoes anyone have any idea what's going on? I need to get out of this before I end up in a cell, or worse. I think they know I'm looking into it, and I don't know what I'm going to do. My friends are gone along with half my colleagues. I just feel helpless.  \n\n\nI somehow survived to make a part 2. It's [here](https://www.reddit.com/r/nosleep/comments/yczggn/its_finally_over_the_international_space_station/)", "relevance": 0}, {"search": 5, "content": "Saw the International Space Station appear in front of Jupiter earlier this evening [OC] ", "relevance": 0}, {"search": 5, "content": "Ireland seen from the International Space Station ", "relevance": 0}, {"search": 5, "content": "New Zealand's Cook Straight captured from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "Russia Will Quit International Space Station Over Sanctions ", "relevance": 0}, {"search": 5, "content": "Russia to quit International Space Station 'after 2024': Official ", "relevance": 0}, {"search": 5, "content": "International Space Station fires thrusters to avoid collision with satellite ", "relevance": 0}, {"search": 5, "content": "Ireland seen from the International Space Station ", "relevance": 0}, {"search": 5, "content": "The International Space Station had to move to dodge space junk ", "relevance": 0}, {"search": 5, "content": "View of Italy from the international Space Station. ", "relevance": 0}, {"search": 5, "content": "Space Debris Has Hit And Damaged The International Space Station ", "relevance": 0}, {"search": 5, "content": "View of UK from International Space Station ", "relevance": 0}, {"search": 5, "content": "Russian module mishap destabilises International Space Station ", "relevance": 0}, {"search": 5, "content": "A volcano eruption from the International Space Station ", "relevance": 0}, {"search": 5, "content": "NASA reveals new plan to deorbit International Space Station ", "relevance": 0}, {"search": 5, "content": "The International Space Station retires soon. NASA won't run its future replacement. ", "relevance": 0}, {"search": 5, "content": "A flyby of Earth from the International Space Station ", "relevance": 0}, {"search": 5, "content": "[OMEGA] Repairing my watch aboard the International Space Station ", "relevance": 0}, {"search": 5, "content": "Mt. Fuji from the International Space Station ", "relevance": 0}, {"search": 5, "content": "New Zealand seen from the International Space Station ", "relevance": 0}, {"search": 5, "content": "SpaceX's Crew Dragon have successfully docked into the International Space Station! ", "relevance": 0}, {"search": 5, "content": "TIFU by sending a call from the International Space Station to voicemail This happened two days ago (Sunday). A friend of mine is currently on his second mission to the ISS. I saw a call come in on my iPhone and the caller ID said “Us Gov.” I first had that thought / feeling you get when the principal calls you to their office. “Crap. What did I do that I thought I got away with but maybe I didn’t?!” I was in the middle of something with a bunch of people and showed them what it said on my phone and everyone was all \"Don't answer it!\" Between everyone's suggestion and my gut feeling of being in trouble, I sent it to voicemail. Turns out it was my buddy calling from SPACE. I had a chance to speak to someone that wasn't on Earth and screwed it up. First thing he said in the voicemail was “You probably saw a call from Us Gov and turned it down.” I know he’ll call again, but damn I feel like an idiot right now.\n\nTL;DR My buddy called me from the Iinternational Space Station and the caller ID said “Us Gov” so I sent it to voicemail and missed a call from space.\n\nEdit: He called back tonight! What a fascinating and amazing call! I asked where he was flying over and he said the Western coast of Africa. I asked how the ride was and he said smooth and awesome. He said the second stage acceleration was incredible and that they hit over 4Gs, then at SECO they got thrown into their straps from the deceleration, and bam…orbit. Took roughly 8.5 min to get into orbit. They have a couple of days off (not because of Memorial Day). The conversation was 12 minutes long but we had to end it because of a satellite issue that was about to happens (exact reason is out of my wheelhouse). Ironically, I made him and I laser engraved rocks glasses and I was drinking out of it when he called. We also joked about some funny stuff that happened when I went out for the launch. He was cracking up about the situation with the first call that I shared here and said that’s a common occurrence :)", "relevance": 0}, {"search": 5, "content": "Mount Fuji seen from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "Brexit has now cost more than the International Space Station ", "relevance": 0}, {"search": 5, "content": "The UK, as seen from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "A view of the Pacific Ocean, from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "International Space Station facing irreparable failures, Russia warns ", "relevance": 0}, {"search": 5, "content": "Working out in the International Space Station ", "relevance": 0}, {"search": 5, "content": "Russia Will Quit International Space Station Over Sanctions ", "relevance": 0}, {"search": 5, "content": "Space junk hit the International Space Station, damaging a robotic arm ", "relevance": 0}, {"search": 5, "content": "A View of My View, from the International Space Station. More details in comments! ", "relevance": 0}, {"search": 5, "content": "Thomas Pesquet becomes Commander of the International Space Station, October 2021. Space. ", "relevance": 0}, {"search": 5, "content": "New Zealand's South Island from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Elon Musk responds to Russia’s International Space Station threat ", "relevance": 0}, {"search": 5, "content": "Timelapse of Cargo Dragon approaching the International Space Station yesterday ", "relevance": 0}, {"search": 5, "content": "Astronauts home in on International Space Station air leak ", "relevance": 0}, {"search": 5, "content": "Good morning from the International Space Station ", "relevance": 0}, {"search": 5, "content": "This is Space Shuttle Atlantis on its final Shuttle mission, just before docking with the International Space Station ", "relevance": 0}, {"search": 5, "content": "My reflection selfie in a window on the International Space Station! More details in comments. ", "relevance": 0}, {"search": 5, "content": "DIY Vibration Insulator I made aboard the International Space Station ", "relevance": 0}, {"search": 5, "content": "🔥 A volcano eruption from the International Space Station ", "relevance": 0}, {"search": 5, "content": "The U.K. from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "My first analog star trail from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Downtime at the International Space Station ", "relevance": 0}, {"search": 5, "content": "U.K from the International Space Station ", "relevance": 0}, {"search": 5, "content": "A flyby of earth from the international space station ", "relevance": 0}, {"search": 5, "content": "Russia threatens to leave International Space Station program over US sanctions: reports ", "relevance": 0}, {"search": 5, "content": "Boeing's capsule faces propulsion issues on way to International Space Station ", "relevance": 0}, {"search": 5, "content": "Lichen Survives on Outside of International Space Station ", "relevance": 0}, {"search": 5, "content": "What does the International Space Station have to do with Satan? ", "relevance": 0}, {"search": 5, "content": "Space Shuttle Endeavor Photographed from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Mt. Fuji from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Russia says it's pulling out of International Space Station over sanctions ", "relevance": 0}, {"search": 5, "content": "Getting awkward up in the international space station ", "relevance": 0}, {"search": 5, "content": "Mount Fuji seen from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "SpaceX Crew Dragon Undocked From The International Space Station (Credit: Astronaut Andreas Mogensen) ", "relevance": 0}, {"search": 5, "content": "Russia will pull out of the International Space Station, space agency chief confirms ", "relevance": 0}, {"search": 5, "content": "Rocket launch from earth as seen from the International Space Station ", "relevance": 0}, {"search": 5, "content": "The International Space Station is getting a new toilet this year ", "relevance": 0}, {"search": 5, "content": "Microbes Unknown to Science Discovered on The International Space Station ", "relevance": 0}, {"search": 5, "content": "My camera collection floating in 0-G aboard the International Space Station! More details in comments. ", "relevance": 0}, {"search": 5, "content": "🔥 A flyby of Earth from the International Space Station ", "relevance": 0}, {"search": 5, "content": "A View of Earth, from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Mount Fuji photographed from the International Space Station ", "relevance": 0}, {"search": 5, "content": "Earth Lit-up from Space captured by the International Space Station [4928 x 3280] ", "relevance": 0}, {"search": 5, "content": "Earth Behind a flower that was grown on the International space station ", "relevance": 0}, {"search": 5, "content": "Baby Yoda arrives at the International Space Station! ", "relevance": 0}, {"search": 5, "content": "SpaceX delivered 5,500 lbs of cargo to the International Space Station today ", "relevance": 0}, {"search": 5, "content": "Earth behind a flower grown on the International Space Station ", "relevance": 0}, {"search": 5, "content": "Self portrait of me looking through the largest window on the International Space Station ", "relevance": 0}, {"search": 5, "content": "How does the International Space Station regulate its temperature? If there were one or two people on the ISS, their bodies would generate a lot of heat. Given that the ISS is surrounded by a (near) vacuum, how does it get rid of this heat so that the temperature on the ISS is comfortable?", "relevance": 0}, {"search": 5, "content": "Rocket launch seen from the International Space Station. ", "relevance": 0}, {"search": 5, "content": "NASA plans to retire the International Space Station by 2031 by crashing it into the Pacific Ocean ", "relevance": 0}, {"search": 5, "content": "My conjoined camera setup for infrared photography from the International Space Station! More details in comments. ", "relevance": 0}, {"search": 5, "content": "A rare view of the U.K from the International Space Station ", "relevance": 0}, {"search": 5, "content": "TIL there is a geocache on the International Space Station ", "relevance": 0}, {"search": 5, "content": "Here's what a rocket launch looks like from the International Space Station ", "relevance": 0}, {"search": 5, "content": "International Space Station toolbox ", "relevance": 0}, {"search": 5, "content": "My best shot of cities at night from the International Space Station. More details in comments. ", "relevance": 0}, {"search": 5, "content": "Definitely the video of the day - Soyuz MS-22 spacecraft docked to International Space Station unexpectedly starts leaking coolant to space [HQ] ", "relevance": 0}, {"search": 5, "content": "International Space Station’s US and Russian astronauts will continue as normal despite outbreak of war, NASA says ", "relevance": 0}, {"search": 5, "content": "My camera setup on the International Space station. More details in comments. ", "relevance": 0}, {"search": 5, "content": "On September 11th, 2001 this was the view from the international space station ", "relevance": 0}, {"search": 5, "content": "Russia Will Quit International Space Station Over Sanctions. ", "relevance": 0}, {"search": 5, "content": "Astronauts find hole in the International Space Station, plug it with thumb ", "relevance": 0}, {"search": 5, "content": "Flower grown inside the International Space Station orbiting Earth January 2016 ", "relevance": 0}, {"search": 5, "content": "SpaceX successfully returns four astronauts from the International Space Station ", "relevance": 0}, {"search": 5, "content": "International Space Station (ISS) caught passing in front of the Sun. ", "relevance": 0}, {"search": 5, "content": "Boeing’s Starliner successfully docks to the International Space Station for the first time ", "relevance": 0}, {"search": 5, "content": "Best additions to the International Space Station? ", "relevance": 0}, {"search": 5, "content": "PsBattle: Radish plants on the International Space Station. ", "relevance": 0}, {"search": 5, "content": "Assembling the International Space Station ", "relevance": 0}]